{
  "backend/main.mo": "Motoko canister implementing file, note, folder, mission, and authorization logic with metadata types, storage mixins, access control, pagination, and various diagnostic/health query methods.",
  "feature_evidence.json": "Feature evidence report mapping performance‑related features to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "List of concise summaries describing the purpose and behavior of numerous frontend components, hooks, and utilities.",
  "frontend/DRAFT_BASELINE_V114.md": "Documentation establishing Draft Baseline v114 with verification steps, parity checks, and strict change‑control rules.",
  "frontend/index.css": "Tailwind base styles and OKLCH CSS variables for light and dark themes.",
  "frontend/index.html": "Main HTML entry with PWA config, icons, meta tags, and service worker registration.",
  "frontend/PAUSE_AFTER_RESTORE.md": "Change‑control freeze notice prohibiting code modifications until explicit user approval after baseline restoration.",
  "frontend/public/manifest.json": "PWA manifest defining app metadata, theme colors, and icon set for MyGallery.",
  "frontend/public/sw.js": "Service worker implementing minimal precaching, cache cleanup, and optimized fetch handling.",
  "frontend/PWA_INSTALLABILITY_NOTES.md": "Guide outlining Chrome PWA installability requirements and verification steps including manifest, icons, HTTPS, and service worker checks.",
  "frontend/RESTORE_LIVE_V114_CHECKLIST.md": "Detailed checklist confirming all frontend files and behaviors match Live version 114.",
  "frontend/src/App.tsx": "Root React component wiring providers and showing HomePage with optional intro animation on login.",
  "frontend/src/components/ActorInitErrorState.tsx": "Displays initialization error states with retry, logout, and collapsible technical details.",
  "frontend/src/components/AnimatedGalleryIcon.tsx": "Renders an animated SVG target-style gallery icon with hover effects.",
  "frontend/src/components/ConnectivityIndicator.tsx": "Empty placeholder file with no implementation.",
  "frontend/src/components/DecorativeBottomLine.tsx": "Shows a fixed decorative bottom border line for UI styling.",
  "frontend/src/components/ExternalOpenFallbackDialog.tsx": "Dialog prompting users to retry opening or download a file when the browser blocks new windows.",
  "frontend/src/components/FilePreviewDialog.tsx": "Dialog for previewing files, performing actions like open, download, move, or delete, with type‑specific preview rendering.",
  "frontend/src/components/FileUploadSection.tsx": "Handles file, link, and note uploads with progress tracking, validation, and speech‑to‑text note input.",
  "frontend/src/components/FoldersButton.tsx": "Floating button that opens folder UI, displaying a folder icon and optional disabled/overlay states.",
  "frontend/src/components/FoldersDialog.tsx": "Deprecated folder management dialog supporting create, rename, delete, and selection actions.",
  "frontend/src/components/FoldersFullScreenView.tsx": "Full-screen folder manager allowing create, rename, delete, and select operations with backend mutations and swipe actions.",
  "frontend/src/components/Footer.tsx": "Simple footer displaying copyright, a heart icon, and a link to caffeine.ai.",
  "frontend/src/components/FullScreenViewer.tsx": "Full-screen file viewer with swipe navigation, delete, share, download, move, and external-open support.",
  "frontend/src/components/GallerySection.tsx": "Renders file/note gallery with selection, previews, long-press handling, and dialogs for viewing, moving, and sharing content.",
  "frontend/src/components/Header.tsx": "Top navigation bar with theme toggle, authentication dropdown, app title, and a unified progress bar.",
  "frontend/src/components/IntroScreen.tsx": "Intro splash screen showing an animated icon that fades out and signals completion after a short delay.",
  "frontend/src/components/LinkOpenFallbackDialog.tsx": "Dialog shown when a link fails to open, offering retry and copy-to-clipboard options.",
  "frontend/src/components/LoginButton.tsx": "Login button that triggers Internet Identity sign-in and shows a loading state during authentication.",
  "frontend/src/components/MissionDetailFullScreenView.tsx": "Full-screen mission detail view handling title editing, tasks, files, notes, and autosave with viewer dialogs.",
  "frontend/src/components/MissionEditorDialog.tsx": "Dialog for creating missions with title input and task management before submitting to backend.",
  "frontend/src/components/MissionsButton.tsx": "Floating button that opens the Missions view.",
  "frontend/src/components/MissionsFullScreenView.tsx": "Full-screen list of missions with creation, deletion, filtering, swipe actions, and navigation to details.",
  "frontend/src/components/MobileOnlyLayout.tsx": "Layout wrapper restricting content to mobile-only styling.",
  "frontend/src/components/MoveToMissionDialog.tsx": "Dialog for moving selected files or notes into a chosen mission.",
  "frontend/src/components/NotesButton.tsx": "Empty file placeholder for notes button component.",
  "frontend/src/components/NotesDialog.tsx": "Empty file placeholder for notes dialog component.",
  "frontend/src/components/NotesFullScreenView.tsx": "Empty file placeholder for full-screen notes view.",
  "frontend/src/components/NoteViewerDialog.tsx": "Dialog for viewing a note with actions for downloading, sharing, deleting, or sending it elsewhere.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Empty file placeholder for profile setup dialog.",
  "frontend/src/components/SendToFolderDialog.tsx": "Modal for moving selected files or notes into a folder or back to the main collection, using folder queries and mutation hooks.",
  "frontend/src/components/SwipeActionsRow.tsx": "Swipeable row component that reveals edit and delete actions based on drag gestures.",
  "frontend/src/components/UnifiedProgressBar.tsx": "Displays a unified upload progress bar showing overall percentage and item count during active uploads.",
  "frontend/src/components/WelcomeIntroScreen.tsx": "Landing screen with introductory text, target-themed graphic, and login button.",
  "frontend/src/contexts/ActorContext.tsx": "Manages backend actor initialization with retry logic, error handling, and admin token setup.",
  "frontend/src/contexts/UploadContext.tsx": "Context tracking multiple upload progress states with coalesced updates and computed total progress.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and caches a backend actor via React Query, refreshing dependent queries on identity change.",
  "frontend/src/hooks/useHomePrefetch.ts": "Hook that prefetches core home data (folders, missions, files, notes) once when the actor becomes ready.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity authentication, handling login, stored identity loading, and status tracking.",
  "frontend/src/hooks/useIsCoarsePointer.ts": "Detects whether the device uses a coarse pointer like touch, updating on pointer-type changes.",
  "frontend/src/hooks/useMissionAutosave.ts": "Implements debounced autosaving of mission title and tasks with change detection, mission switching resets, and queued saves.",
  "frontend/src/hooks/useMissionsQueries.ts": "React Query hooks for listing, retrieving, creating, updating, and modifying missions, with actor readiness and identity checks.",
  "frontend/src/hooks/useNotesQueries.ts": "React Query hooks for fetching, creating, and deleting notes across folders and missions with targeted cache invalidation.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for file and folder operations including listing, uploading, and creating folders, with concurrency limits and cache updates.",
  "frontend/src/hooks/useSpeechToText.ts": "React hook wrapping browser SpeechRecognition with interim/final transcript handling and error reporting.",
  "frontend/src/index.css": "Tailwind base styles plus extensive light/dark mode CSS variables for color themes and layout tweaks.",
  "frontend/src/lib/utils.ts": "Utility merging conditional class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "App entry point initializing React, query client, Internet Identity provider, and global styles.",
  "frontend/src/pages/HomePage.tsx": "Main home screen managing folder/mission views, data prefetching, authentication state, and optional dev smoke tests.",
  "frontend/src/utils/actorInitializationMessaging.ts": "Utilities and constants for classifying actor initialization errors and extracting error details.",
  "frontend/src/utils/externalOpen.ts": "Helpers for opening URLs, downloading files or notes, and sharing content via Web Share API.",
  "frontend/src/utils/fileOpenRules.ts": "Logic deciding how files should open based on MIME category, including viewer, preview, or download behavior.",
  "frontend/src/utils/filePreview.ts": "Classifies files by MIME type, determines previewability, and returns human-readable type labels.",
  "frontend/src/utils/missionCompletion.ts": "Computes mission progress, checks completion status, and splits missions into completed/incomplete lists.",
  "frontend/src/utils/missionTaskCompare.ts": "Performs BigInt-safe deep equality checks on task arrays.",
  "frontend/src/utils/notesTime.ts": "Empty placeholder file with no implementation.",
  "frontend/src/utils/performanceDiagnostics.ts": "Provides lazy-initialized performance logging and timing utilities, including async operation timing.",
  "frontend/src/utils/reactQueryDiagnostics.ts": "Offers React Query cache inspection and mutation lifecycle logging for mission-related diagnostics.",
  "frontend/src/utils/smokeTestCoreFlows.ts": "Runs an end-to-end smoke test covering folder creation, mission creation, file upload, and list verification.",
  "frontend/src/utils/uploadConcurrency.ts": "Implements a simple promise concurrency limiter with queued execution.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading, persisting, and clearing URL parameters using URLSearchParams and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme tokens, colors, animations, and plugins.",
  "frontend/V114_BASELINE_FRONTEND_FILES.txt": "Canonical list of all files defining the v114 frontend baseline for drift detection.",
  "project_state.json": "Describes project performance goals, constraints, existing features, and state metadata."
}