{
  "backend/main.mo": "Motoko canister implementing authenticated file and folder management with blob storage, access control, ownership checks, pagination, and basic upload/download APIs.",
  "feature_evidence.json": "Feature evidence report mapping performance and initialization UX improvements to affected frontend files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten high-level summaries of frontend source files describing responsibilities, UI behavior, and recent UX/performance changes.",
  "frontend/index.css": "Global Tailwind CSS base defining light/dark theme tokens using OKLCH colors, layout variables, and base element styling.",
  "frontend/index.html": "HTML entry point configuring PWA metadata, icons, theme color, and mounting the React app at the root element.",
  "frontend/public/manifest.json": "PWA manifest defining app identity, icons, display mode, theme colors, language, and categories for MyGallery.",
  "frontend/public/sw.js": "Lightweight service worker optimized for fast startup with minimal precaching, network-first fetch strategy, and cache cleanup.",
  "frontend/src/App.tsx": "Root React component wiring theme, actor, and upload providers, handling Internet Identity login state and conditional intro screen display.",
  "frontend/src/components/ActorInitErrorState.tsx": "Reusable error UI shown when backend actor initialization fails, offering retry and sign-out actions with clear messaging.",
  "frontend/src/components/AnimatedGalleryIcon.tsx": "Renders an SVG camera icon with hover animations, glow effects, and pulse/flash interactions for a gallery UI element.",
  "frontend/src/components/DecorativeBottomLine.tsx": "Displays a fixed, thin decorative horizontal line near the bottom of the viewport with light/dark theme styling.",
  "frontend/src/components/ExternalOpenFallbackDialog.tsx": "Dialog shown when a browser blocks opening a file externally, offering retry and download actions.",
  "frontend/src/components/FilePreviewDialog.tsx": "Dialog that previews files (images, videos, PDFs, Office docs) and provides actions like open, download, send to folder, and delete.",
  "frontend/src/components/FileUploadSection.tsx": "Drag-and-drop and click-based file upload area that manages upload progress, backend readiness checks, and user feedback.",
  "frontend/src/components/FoldersButton.tsx": "Fixed-position floating button that opens the folders UI, displaying a folder icon and label.",
  "frontend/src/components/FoldersDialog.tsx": "Dialog for listing, creating, renaming, selecting, and deleting folders using backend queries and mutations.",
  "frontend/src/components/Footer.tsx": "Simple footer showing copyright text, a heart icon, and a link to caffeine.ai.",
  "frontend/src/components/FullScreenViewer.tsx": "Full-screen file viewer with navigation, swipe gestures, download, delete, share, external open, and send-to-folder actions.",
  "frontend/src/components/GallerySection.tsx": "Implements the main gallery view with file cards, selection mode, touch/long-press handling, fullscreen viewing, downloads, deletion, and moving files between folders using query hooks.",
  "frontend/src/components/Header.tsx": "Renders the app header with branding, theme toggle, authentication menu (sign out), and a unified upload progress bar.",
  "frontend/src/components/IntroScreen.tsx": "Displays an animated welcome splash screen with a timed transition into the main application.",
  "frontend/src/components/LoginButton.tsx": "Provides a button to sign in with Internet Identity, showing loading feedback during authentication.",
  "frontend/src/components/ProfileSetupDialog.tsx": "File is empty or not implemented; intended for a profile setup dialog.",
  "frontend/src/components/SendToFolderDialog.tsx": "Dialog for moving selected files to another folder or back to the main collection, backed by folder and file mutation queries.",
  "frontend/src/components/UnifiedProgressBar.tsx": "Shows a global upload progress bar reflecting combined progress and file count from the upload context.",
  "frontend/src/contexts/ActorContext.tsx": "Context provider that initializes and manages the backend actor based on authentication state, exposing status, errors, retry, and sign-out helpers.",
  "frontend/src/contexts/UploadContext.tsx": "Context for tracking upload batches and per-file progress, computing overall progress and exposing upload lifecycle helpers.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and caches a backend actor tied to the current identity and invalidates dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication, managing identity state, login/logout actions, and detailed login status. Wraps the app with an InternetIdentityProvider that initializes and persists the AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks and mutations for fetching and mutating files and folders via the backend actor, gated on authentication and actor readiness. Includes optimistic updates, cache invalidation, and standardized error handling.",
  "frontend/src/index.css": "Configures Tailwind CSS base styles, light/dark theme CSS variables, and global UI behaviors like transitions, touch optimizations, and animations. Defines the design system tokens used across the frontend.",
  "frontend/src/lib/utils.ts": "Exports a utility function to merge conditional class names using clsx and tailwind-merge for consistent Tailwind styling.",
  "frontend/src/main.tsx": "Application entry point that renders the React app, wiring up React Query and Internet Identity providers and importing global styles.",
  "frontend/src/pages/HomePage.tsx": "Implements the main landing page with authentication gating, actor initialization handling, and conditional UI for login, loading, errors, and the gallery experience. Coordinates folder selection, file uploads, and core layout components.",
  "frontend/src/utils/actorInitializationMessaging.ts": "Centralizes detection and user-friendly messaging for backend actor initialization and readiness errors. Provides helper functions to classify errors and generate standardized error messages.",
  "frontend/src/utils/externalOpen.ts": "Utility helpers for opening external URLs in a new tab and downloading files via fetch and object URLs, with basic failure handling.",
  "frontend/src/utils/fileOpenRules.ts": "Defines rules for deciding how different file types should be opened (in-app viewer, office preview, or direct download) based on MIME type. Exposes convenience predicates for common file-open decisions.",
  "frontend/src/utils/filePreview.ts": "Provides MIME-type based file categorization, previewability checks, and human-readable file type labels for use in previews and UI.",
  "frontend/src/utils/urlParams.ts": "Provides utilities to read URL parameters from query strings or hash-based routes, persist them to sessionStorage, retrieve persisted values, and clear stored parameters. Includes logic to prioritize URL values, support hash routing, and safely manipulate sessionStorage and URL hash without reloads.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining dark mode, content paths, container sizing, extended theme tokens (colors via CSS variables, radii, shadows, animations), and custom accordion keyframes. Registers typography, container-queries, and animation plugins.",
  "project_state.json": "Machine-readable snapshot of the project’s schema version, overall app summary, and a catalog of implemented features with IDs, descriptions, and versions. Used to track current capabilities and state of the MyGallery PWA and its IC backend."
}