{
  "backend/main.mo": "Defines the backend actor with storage, authorization, file/note/mission types, state maps, and health/diagnostic query methods.",
  "feature_evidence.json": "Lists feature evidence entries linking feature IDs to related frontend files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Provides a mapping of frontend file paths to short descriptions summarizing their purpose and functionality.",
  "frontend/DRAFT_BASELINE_V114.md": "Documents the creation and verification of a frontend baseline identical to Live version 114, outlining parity checks and change control.",
  "frontend/index.css": "Defines global Tailwind styles and OKLCH color variables for light and dark themes.",
  "frontend/index.html": "Root HTML template configuring PWA metadata, icons, service worker registration, and app bootstrap.",
  "frontend/PAUSE_AFTER_RESTORE.md": "Declares a post-restore change freeze, detailing prohibited and permitted actions until explicit user approval.",
  "frontend/public/manifest.json": "PWA manifest specifying app metadata, icons, display settings, and categories for MyGallery.",
  "frontend/public/sw.js": "Service worker implementing minimal precaching, network-first navigation, and bounded runtime caching.",
  "frontend/PWA_INSTALLABILITY_NOTES.md": "Checklist and guidance for verifying PWA installability requirements including manifest, icons, service worker, and testing steps.",
  "frontend/RESTORE_LIVE_V114_CHECKLIST.md": "Checklist confirming all frontend files and behaviors match Live version 114 with verified authentication, UI components, and utilities.",
  "frontend/src/App.tsx": "Main app wrapper using theme, actor, and upload providers with intro-screen logic tied to authentication state.",
  "frontend/src/components/ActorInitErrorState.tsx": "Displays detailed initialization errors with retry, logout, and expandable technical details based on error classification.",
  "frontend/src/components/AnimatedGalleryIcon.tsx": "Renders an animated crosshair-style SVG icon with hover effects.",
  "frontend/src/components/ConnectivityIndicator.tsx": "Empty placeholder file with no implemented component.",
  "frontend/src/components/DecorativeBottomLine.tsx": "Shows a fixed decorative bottom line with theme-based styling.",
  "frontend/src/components/ExternalOpenFallbackDialog.tsx": "Dialog warning users when a file cannot open in a new window and offering retry or download options.",
  "frontend/src/components/FilePreviewDialog.tsx": "Displays previews for various file types and provides actions like open, download, move, or delete.",
  "frontend/src/components/FileUploadSection.tsx": "Handles uploading files, links, and notes with progress tracking, speech-to-text input, and backend mutations.",
  "frontend/src/components/FoldersButton.tsx": "Floating folders button that triggers folder UI and supports disabled and overlay states.",
  "frontend/src/components/FoldersDialog.tsx": "Deprecated dialog for listing, creating, renaming, and deleting folders with swipe actions.",
  "frontend/src/components/FoldersFullScreenView.tsx": "Manages full‑screen folder list with create, rename, delete, and select actions using backend mutations and swipe actions.",
  "frontend/src/components/Footer.tsx": "Renders a simple footer with branding and a link to caffeine.ai.",
  "frontend/src/components/FullScreenViewer.tsx": "Displays files in a full‑screen modal with swipe navigation, delete, share, download, and move actions.",
  "frontend/src/components/GallerySection.tsx": "Shows files and notes in a grid with selection, long‑press, preview, and bulk actions, using multiple data queries.",
  "frontend/src/components/Header.tsx": "Top navigation bar with theme toggle, sign‑out menu, and progress bar.",
  "frontend/src/components/IntroScreen.tsx": "Splash screen showing an animated icon and fading out before signaling completion.",
  "frontend/src/components/LinkOpenFallbackDialog.tsx": "Dialog shown when a link can't open externally, offering retry and copy options.",
  "frontend/src/components/LoginButton.tsx": "Button to trigger Internet Identity login with loading feedback.",
  "frontend/src/components/MissionDetailFullScreenView.tsx": "Full‑screen mission detail view with title editing, task management, autosave, and file/note previews.",
  "frontend/src/components/MissionEditorDialog.tsx": "Dialog for creating missions, allowing title entry and task management with create mutation handling.",
  "frontend/src/components/MissionsButton.tsx": "Floating button that opens the missions view with hover and disabled states.",
  "frontend/src/components/MissionsFullScreenView.tsx": "Full‑screen mission list with filtering, swipe interactions, mission detail navigation, and create/delete handling.",
  "frontend/src/components/MobileOnlyLayout.tsx": "Wrapper enforcing a mobile‑only layout container.",
  "frontend/src/components/MoveToMissionDialog.tsx": "Dialog for selecting a mission to move files or notes into, with mutation handling and feedback.",
  "frontend/src/components/NotesButton.tsx": "Empty placeholder file.",
  "frontend/src/components/NotesDialog.tsx": "Empty placeholder file.",
  "frontend/src/components/NotesFullScreenView.tsx": "Empty placeholder file.",
  "frontend/src/components/NoteViewerDialog.tsx": "Dialog to view, share, download, or delete a note, with optional actions for sending to folder or mission.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Empty placeholder file.",
  "frontend/src/components/SendToFolderDialog.tsx": "Dialog for moving files or notes to a folder or back to main, with mutation handling and performance diagnostics.",
  "frontend/src/components/SwipeActionsRow.tsx": "Swipeable row component enabling edit/delete actions with drag gestures and controlled open state.",
  "frontend/src/components/UnifiedProgressBar.tsx": "Displays a global upload progress bar using UploadContext when uploads are active.",
  "frontend/src/components/WelcomeIntroScreen.tsx": "Intro screen with a target-themed SVG and welcome text plus a login button.",
  "frontend/src/contexts/ActorContext.tsx": "Manages backend actor initialization with retries, error handling, and identity-based state.",
  "frontend/src/contexts/UploadContext.tsx": "Provides upload state management with progress tracking, batching, and legacy API support.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages a backend actor via react-query, refetching on identity changes.",
  "frontend/src/hooks/useHomePrefetch.ts": "Prefetches folders, files, missions, and notes once when the backend actor becomes ready.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing AuthClient creation, login state, and stored identities.",
  "frontend/src/hooks/useIsCoarsePointer.ts": "Detects whether the device uses a coarse pointer (touch) and updates on pointer type changes.",
  "frontend/src/hooks/useMissionAutosave.ts": "Implements debounced autosaving for mission edits with change detection, mission switching handling, and queued save logic.",
  "frontend/src/hooks/useMissionsQueries.ts": "React Query hooks for listing, fetching, creating, and updating missions using the backend actor with identity checks and targeted cache invalidation.",
  "frontend/src/hooks/useNotesQueries.ts": "React Query hooks for fetching, creating, and deleting notes across folders and missions, with concurrency limits and selective cache updates.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for files and folders, supporting listing, fetching by folder or mission, and creating folders with upload concurrency limits.",
  "frontend/src/hooks/useSpeechToText.ts": "Custom React hook wrapping Web SpeechRecognition with continuous/interim transcription, error handling, and state management.",
  "frontend/src/index.css": "Tailwind entry file defining light/dark theme CSS variables, layout rules, and base styling.",
  "frontend/src/lib/utils.ts": "Utility function that merges class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "App entry rendering React root with QueryClient and InternetIdentity providers.",
  "frontend/src/pages/HomePage.tsx": "Main home page managing authentication state, data fetching, UI panels, and dev-only smoke tests.",
  "frontend/src/utils/actorInitializationMessaging.ts": "Helpers and constants for classifying actor initialization errors and extracting messaging details.",
  "frontend/src/utils/externalOpen.ts": "Utilities for opening external URLs, downloading files, and sharing content via Web Share API.",
  "frontend/src/utils/fileOpenRules.ts": "Logic determining how files open (viewer, office preview, or download) based on MIME type.",
  "frontend/src/utils/filePreview.ts": "Provides functions to determine previewability, categorize MIME types, and generate human-readable file-type labels.",
  "frontend/src/utils/missionCompletion.ts": "Calculates mission progress, checks if missions are completed, and splits missions into completed and incomplete groups.",
  "frontend/src/utils/missionTaskCompare.ts": "Compares two task arrays safely with BigInt IDs by checking each field manually.",
  "frontend/src/utils/notesTime.ts": "Empty file with no implemented logic.",
  "frontend/src/utils/performanceDiagnostics.ts": "Implements an optional performance diagnostics tool to time operations and log durations when enabled.",
  "frontend/src/utils/reactQueryDiagnostics.ts": "Logs mission mutation lifecycle events to the console in development mode for debugging.",
  "frontend/src/utils/smokeTestCoreFlows.ts": "Runs development-only backend smoke tests for core flows and formats the results for display.",
  "frontend/src/utils/uploadConcurrency.ts": "Implements a simple promise-based concurrency limiter for controlled parallel execution.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL parameters, including session storage support and hash-based routing handling.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, animations, and plugins for the frontend.",
  "frontend/V114_BASELINE_FRONTEND_FILES.txt": "Canonical inventory of all frontend files defining the v114 baseline for drift detection and Draft sync validation.",
  "project_state.json": "Defines project state, required fixes, and known issues related to immediate UI updates when moving files between collections."
}