{
  "backend/main.mo": "Motoko actor defining types and state for files, notes, folders, missions, authorization, and diagnostics, with health and diagnostic query methods.",
  "feature_evidence.json": "Feature evidence report mapping two mission‑move fixes to affected frontend hooks and components.",
  "frontend-file-summaries.txt": "JSON-style list summarizing many frontend components, hooks, and utilities with short functional descriptions.",
  "frontend/DRAFT_BASELINE_V114.md": "Documentation describing creation of a new Draft identical to Live v114 and validating full frontend parity.",
  "frontend/index.css": "Sets global Tailwind layers and defines light/dark theme CSS variables for UI styling.",
  "frontend/index.html": "HTML entry point configuring PWA metadata, icons, and service-worker registration for the app.",
  "frontend/PAUSE_AFTER_RESTORE.md": "Change-freeze notice explaining that no code changes are allowed post‑restore without explicit user approval.",
  "frontend/public/manifest.json": "PWA manifest describing app metadata, icons, theme settings, and startup behavior.",
  "frontend/public/sw.js": "Service worker implementing precaching, runtime caching, and offline fallback logic.",
  "frontend/PWA_INSTALLABILITY_NOTES.md": "Guide outlining Chrome PWA installability requirements and verification steps for MyGallery.",
  "frontend/RESTORE_LIVE_V114_CHECKLIST.md": "Checklist confirming the frontend was restored to exact Live v114 behavior with verified components and flows.",
  "frontend/src/App.tsx": "Main app component wiring themes, providers, and intro-screen logic around the HomePage.",
  "frontend/src/components/ActorInitErrorState.tsx": "UI component displaying categorized initialization errors with retry, logout, and expandable technical details.",
  "frontend/src/components/AnimatedGalleryIcon.tsx": "Renders an animated SVG target-style gallery icon with hover effects.",
  "frontend/src/components/ConnectivityIndicator.tsx": "Empty file placeholder for a connectivity status component.",
  "frontend/src/components/DecorativeBottomLine.tsx": "Displays a fixed decorative horizontal line near the bottom of the screen.",
  "frontend/src/components/ExternalOpenFallbackDialog.tsx": "Dialog prompting users to retry opening or download a blocked external file.",
  "frontend/src/components/FilePreviewDialog.tsx": "Provides a dialog for previewing files, performing actions like open, download, move, or delete.",
  "frontend/src/components/FileUploadSection.tsx": "Handles file, link, and note uploads with progress tracking and speech‑to‑text support.",
  "frontend/src/components/FoldersButton.tsx": "Floating button that opens the folders UI and displays a folder icon.",
  "frontend/src/components/FoldersDialog.tsx": "Deprecated folder management dialog supporting creation, renaming, selection, and deletion.",
  "frontend/src/components/FoldersFullScreenView.tsx": "Full‑screen folder browser with create, rename, delete, and select actions.",
  "frontend/src/components/Footer.tsx": "Footer displaying copyright info and a link to caffeine.ai.",
  "frontend/src/components/FullScreenViewer.tsx": "Interactive full-screen viewer for navigating, sharing, downloading, deleting, and organizing files with swipe and fallback behaviors.",
  "frontend/src/components/GallerySection.tsx": "Displays files and notes in a gallery with selection, previews, bulk actions, and integration with the full-screen viewer.",
  "frontend/src/components/Header.tsx": "Top navigation bar with theme toggle, auth dropdown, progress bar, and branding.",
  "frontend/src/components/IntroScreen.tsx": "Two‑second fade-out intro splash screen showing the animated icon before the app loads.",
  "frontend/src/components/LinkOpenFallbackDialog.tsx": "Dialog shown when a link cannot be opened, offering retry and copy-to-clipboard options.",
  "frontend/src/components/LoginButton.tsx": "Button to authenticate using Internet Identity with loading state.",
  "frontend/src/components/MissionDetailFullScreenView.tsx": "Full-screen mission detail page supporting autosave, file/note viewing, task management, and external link handling.",
  "frontend/src/components/MissionEditorDialog.tsx": "Dialog for creating missions with title input and task list editing before submission.",
  "frontend/src/components/MissionsButton.tsx": "Renders a floating Missions button with animated icon, hover effects, and optional overlay/disabled states.",
  "frontend/src/components/MissionsFullScreenView.tsx": "Displays a full-screen missions list with swipe actions, mission creation, deletion, filtering, and navigation to mission details.",
  "frontend/src/components/MobileOnlyLayout.tsx": "Wraps children in a container intended for mobile-only layouts.",
  "frontend/src/components/MoveToMissionDialog.tsx": "Dialog allowing files or notes to be moved into a selected mission, showing mission list and handling mutations.",
  "frontend/src/components/NotesButton.tsx": "Empty file.",
  "frontend/src/components/NotesDialog.tsx": "Empty file.",
  "frontend/src/components/NotesFullScreenView.tsx": "Empty file.",
  "frontend/src/components/NoteViewerDialog.tsx": "Full-screen dialog for viewing a note with actions for downloading, sharing, deleting, and sending to folder or mission.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Empty file.",
  "frontend/src/components/SendToFolderDialog.tsx": "Dialog for moving files or notes to folders or back to main collection, with performance logging and mutation handling.",
  "frontend/src/components/SwipeActionsRow.tsx": "Swipeable row component exposing edit/delete actions with pointer gesture handling and animated transitions.",
  "frontend/src/components/UnifiedProgressBar.tsx": "Displays a global upload progress bar showing percent and item count when uploads are active.",
  "frontend/src/components/WelcomeIntroScreen.tsx": "Renders an introductory screen with a target-themed SVG graphic, descriptive text, and a login button.",
  "frontend/src/contexts/ActorContext.tsx": "Manages creation and lifecycle of the backend actor with retry logic, status tracking, and error handling.",
  "frontend/src/contexts/UploadContext.tsx": "Provides upload state management including progress coalescing, batch uploads, and legacy API compatibility.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor via React Query, refreshing dependent queries when the identity changes.",
  "frontend/src/hooks/useHomePrefetch.ts": "Prefetches folders, files, missions, and notes once the actor is ready to speed up home screen loading.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication, exposing identity state, login, logout, and initialization logic.",
  "frontend/src/hooks/useIntroOnAppResume.ts": "Runs a callback when the app returns to the foreground if the user is authenticated and initialized.",
  "frontend/src/hooks/useIsCoarsePointer.ts": "Detects whether the device uses a coarse pointer, indicating touch or mobile input.",
  "frontend/src/hooks/useMissionAutosave.ts": "Implements debounced autosave for mission title and tasks with change detection, mission switching resets, and queued saves.",
  "frontend/src/hooks/useMissionsQueries.ts": "Provides React Query hooks to list, fetch, create, and update missions using a backend actor with targeted cache invalidation.",
  "frontend/src/hooks/useNotesQueries.ts": "Defines hooks for fetching, creating, and deleting notes across folders and missions with concurrency-limited note creation.",
  "frontend/src/hooks/useQueries.ts": "Contains React Query hooks for files and folders, including mission- and folder-specific queries plus folder creation and upload concurrency limiting.",
  "frontend/src/hooks/useSpeechToText.ts": "Wraps browser speech recognition APIs to stream interim and final transcripts with error handling and language configuration.",
  "frontend/src/index.css": "Defines Tailwind layers and extensive CSS variables for light/dark themes and UI styling.",
  "frontend/src/lib/utils.ts": "Provides a utility function that merges class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentity providers.",
  "frontend/src/pages/HomePage.tsx": "Implements the main home page, handling authentication, data fetching, UI state, and dev-only smoke tests.",
  "frontend/src/utils/actorInitializationMessaging.ts": "Defines error messages and utilities to classify and serialize actor initialization errors.",
  "frontend/src/utils/externalOpen.ts": "Implements utilities for opening external URLs, downloading files, and sharing content.",
  "frontend/src/utils/fileOpenRules.ts": "Determines how files should open based on MIME type, including viewer, preview, or download behavior.",
  "frontend/src/utils/filePreview.ts": "Categorizes files by MIME type and provides previewability checks and human-readable labels.",
  "frontend/src/utils/missionCompletion.ts": "Calculates mission progress, determines completion status, and splits missions by state.",
  "frontend/src/utils/missionTaskCompare.ts": "Compares task arrays safely with BigInt support to detect equality.",
  "frontend/src/utils/notesTime.ts": "Empty file with no implemented logic.",
  "frontend/src/utils/performanceDiagnostics.ts": "Provides a lightweight opt-in timing utility to measure operation durations and log results. Includes async timing helpers and a singleton instance.",
  "frontend/src/utils/reactQueryDiagnostics.ts": "Logs React Query mutation phases in development mode for debugging mission-related mutations.",
  "frontend/src/utils/smokeTestCoreFlows.ts": "Runs development-only smoke tests for core backend flows like folder, mission, link, and note creation, and formats results. Collects successes or errors for each tested flow.",
  "frontend/src/utils/uploadConcurrency.ts": "Implements a simple concurrency limiter that queues promise-producing functions to enforce a max number of simultaneous executions.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL parameters, supporting both query and hash-based routing and session storage persistence.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, animations, and radii, with support for dark mode and plugins.",
  "frontend/V114_BASELINE_FRONTEND_FILES.txt": "Defines the complete canonical list of frontend files for version 114 to support drift detection and reproducible builds.",
  "project_state.json": "Describes the project’s state and scope, focusing on fixing immediate and correct transfer of items when moving from folders to missions."
}