{
  "backend/main.mo": "Main Motoko canister defining file, note, folder, mission, and authorization types with state maps and health/diagnostic query methods plus mixed‑in storage and authorization.",
  "feature_evidence.json": "Feature evidence report mapping features to related frontend files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Collection of brief summaries describing the purpose and behavior of numerous frontend components, hooks, and utilities.",
  "frontend/DRAFT_BASELINE_V114.md": "Documentation describing the creation of a draft baseline identical to Live version 114 and outlining validation steps and change control.",
  "frontend/index.css": "Defines Tailwind layers and extensive CSS variables for light and dark themes, applying base colors and global styles.",
  "frontend/index.html": "HTML entry point configuring PWA metadata, icons, and loading the React app root.",
  "frontend/PAUSE_AFTER_RESTORE.md": "Change‑freeze notice stating that no code changes are allowed post‑restoration until explicit user approval.",
  "frontend/public/manifest.json": "PWA manifest specifying app name, theme, icons, and metadata for MyGallery.",
  "frontend/public/sw.js": "Service worker implementing minimal precaching, network-first fetch handling, and runtime cache cleanup for the PWA.",
  "frontend/RESTORE_LIVE_V114_CHECKLIST.md": "Checklist confirming all frontend files and behaviors match Live version 114 after restoration.",
  "frontend/src/App.tsx": "Root React component managing theme, providers, identity initialization, and intro screen logic.",
  "frontend/src/components/ActorInitErrorState.tsx": "UI component showing detailed error states for actor initialization with retry and logout options.",
  "frontend/src/components/AnimatedGalleryIcon.tsx": "SVG-based animated gallery icon featuring target rings, crosshairs, and hover effects.",
  "frontend/src/components/ConnectivityIndicator.tsx": "Empty component file with no implemented logic.",
  "frontend/src/components/DecorativeBottomLine.tsx": "Renders a fixed subtle bottom border line used as a decorative UI element.",
  "frontend/src/components/ExternalOpenFallbackDialog.tsx": "Dialog prompting users to retry opening a file or download it when the browser blocks external opening.",
  "frontend/src/components/FilePreviewDialog.tsx": "Dialog component that previews files by type and provides actions like download, delete, and moving files.",
  "frontend/src/components/FileUploadSection.tsx": "UI section for uploading files, creating links, and creating notes with progress tracking and validation.",
  "frontend/src/components/FoldersButton.tsx": "Floating button that triggers folder-related actions with a folder icon.",
  "frontend/src/components/FoldersDialog.tsx": "Deprecated dialog for listing, creating, renaming, and deleting folders with swipe actions.",
  "frontend/src/components/FoldersFullScreenView.tsx": "Full-screen folder management view supporting creation, editing, deletion, and selection.",
  "frontend/src/components/Footer.tsx": "Simple footer displaying copyright info and a link to caffeine.ai.",
  "frontend/src/components/FullScreenViewer.tsx": "Full-screen viewer for browsing files with swipe navigation and actions like delete, download, share, and move.",
  "frontend/src/components/GallerySection.tsx": "Displays files and notes in a gallery with selection, long-press, previews, and folder/mission actions.",
  "frontend/src/components/Header.tsx": "Renders the app header with theme toggle, authentication menu, and a progress bar.",
  "frontend/src/components/IntroScreen.tsx": "Shows a brief animated splash screen and fades out before calling onComplete.",
  "frontend/src/components/LinkOpenFallbackDialog.tsx": "Dialog shown when a link can't open, offering retry or copy-to-clipboard options.",
  "frontend/src/components/LoginButton.tsx": "Button for signing in with Internet Identity, showing loading state while logging in.",
  "frontend/src/components/MissionDetailFullScreenView.tsx": "Full‑screen mission view allowing title editing, task management, autosave, and viewing attached files and notes.",
  "frontend/src/components/MissionEditorDialog.tsx": "Dialog for creating missions with title input and task list editing before saving.",
  "frontend/src/components/MissionsButton.tsx": "Floating button that opens missions, with hover effects and disabled state handling.",
  "frontend/src/components/MissionsFullScreenView.tsx": "Full-screen mission list UI with mission selection, creation, deletion, progress calculation, and swipe actions.",
  "frontend/src/components/MobileOnlyLayout.tsx": "Simple wrapper that constrains its children to a mobile-only container layout.",
  "frontend/src/components/MoveToMissionDialog.tsx": "Dialog for moving files or notes into a selected mission with mutation handling and success/error toasts.",
  "frontend/src/components/NotesButton.tsx": "Empty file.",
  "frontend/src/components/NotesDialog.tsx": "Empty file.",
  "frontend/src/components/NotesFullScreenView.tsx": "Empty file.",
  "frontend/src/components/NoteViewerDialog.tsx": "Dialog for viewing a note and performing actions such as download, share, send to folder/mission, or delete.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Empty file.",
  "frontend/src/components/SendToFolderDialog.tsx": "Dialog for moving or removing files/notes from folders, including performance diagnostics and mutation coordination.",
  "frontend/src/components/SwipeActionsRow.tsx": "Reusable component enabling swipe-to-reveal edit/delete actions with pointer-gesture handling.",
  "frontend/src/components/UnifiedProgressBar.tsx": "Global upload progress bar showing total progress and item count when uploads are active.",
  "frontend/src/components/WelcomeIntroScreen.tsx": "Renders an intro screen with a target-themed SVG graphic, descriptive text, and a login button.",
  "frontend/src/contexts/ActorContext.tsx": "Provides a context for managing backend actor initialization, retry logic, error handling, and sign‑out behavior.",
  "frontend/src/contexts/UploadContext.tsx": "Manages upload batches, progress updates, and completion state with batched animation‑frame progress updates.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor via React Query, reinitializing on identity changes and invalidating related queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity login, logout, identity persistence, and status tracking using AuthClient.",
  "frontend/src/hooks/useIsCoarsePointer.ts": "Detects whether the device uses a coarse pointer such as touch input.",
  "frontend/src/hooks/useMissionAutosave.ts": "Provides debounced autosave for mission edits with change detection, queued saves, and mission‑switch resets.",
  "frontend/src/hooks/useMissionsQueries.ts": "Provides React Query hooks for listing, fetching, creating, and updating missions with backend actor integration and cache updates.",
  "frontend/src/hooks/useNotesQueries.ts": "Defines React Query hooks for creating, fetching, deleting, and moving notes, with cache invalidation tied to folders and missions.",
  "frontend/src/hooks/useQueries.ts": "Contains React Query hooks for fetching and managing files and folders, including uploads, mission associations, and folder creation.",
  "frontend/src/index.css": "Tailwind CSS configuration defining light and dark mode design tokens and base styling rules.",
  "frontend/src/lib/utils.ts": "Exports a utility function for merging Tailwind class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Initializes the React app with React Query and Internet Identity providers and mounts it to the DOM.",
  "frontend/src/pages/HomePage.tsx": "Implements the main homepage UI, fetching core data and handling folder and mission views with conditional layouts and smoke test logic.",
  "frontend/src/utils/actorInitializationMessaging.ts": "Provides standardized actor initialization error messages and functions to classify errors such as not-ready, initialization failure, invalid admin token, and stopped canister.",
  "frontend/src/utils/externalOpen.ts": "Implements external URL opening, file downloading, text-note exporting, and Web Share API helpers with popup-block detection.",
  "frontend/src/utils/fileOpenRules.ts": "Determines how files should open based on MIME category, including viewer vs download logic and office document handling.",
  "frontend/src/utils/filePreview.ts": "Categorizes MIME types into previewable groups and provides human-readable labels for file types.",
  "frontend/src/utils/missionTaskCompare.ts": "Performs BigInt‑safe equality comparison of Task arrays by checking IDs, text, and completion state.",
  "frontend/src/utils/notesTime.ts": "Empty file placeholder with no implemented logic.",
  "frontend/src/utils/performanceDiagnostics.ts": "Implements optional performance diagnostics with timing, logging, and async operation measurement controlled by flags.",
  "frontend/src/utils/reactQueryDiagnostics.ts": "Provides diagnostics for React Query mission caches and logs delete mutation lifecycle events and errors.",
  "frontend/src/utils/smokeTestCoreFlows.ts": "Runs end‑to‑end smoke tests for core flows including folder creation, mission creation, file upload, and verification steps.",
  "frontend/src/utils/uploadConcurrency.ts": "Implements a simple promise concurrency limiter with a queue and helper factory function.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading URL parameters (including hash routing), persisting them in sessionStorage, and clearing them from the URL.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, radii, animations, and enabling typography and animation plugins.",
  "frontend/V114_BASELINE_FRONTEND_FILES.txt": "Canonical list of all frontend files that define the Live version 114 baseline for drift detection.",
  "project_state.json": "Project metadata describing required fixes to Mission task creation, task toggling, and swipe-to-delete behavior, with scope and feature tracking."
}