{
  "backend/main.mo": "Motoko backend actor implementing file storage, folders, user profiles, notes, missions, and authorization with pagination and diagnostics.",
  "feature_evidence.json": "Feature evidence report linking specific frontend files to implemented folder‑creation and swipe‑action features with metadata and confidence levels.",
  "frontend-file-summaries.txt": "Text file containing short summaries of all major frontend components, hooks, and utilities.",
  "frontend/DRAFT_BASELINE_V114.md": "Documentation describing creation of Draft baseline synced 1:1 with Live v114, including validation steps and change‑control rules.",
  "frontend/index.css": "Configures Tailwind layers and defines extensive CSS variables for light and dark themes.",
  "frontend/index.html": "Main HTML entry for the app with PWA metadata, icons, and script loading the React app.",
  "frontend/PAUSE_AFTER_RESTORE.md": "Freeze notice prohibiting code changes after restoring Live v114 until explicit user approval.",
  "frontend/public/manifest.json": "PWA manifest defining app name, colors, icons, and display properties.",
  "frontend/public/sw.js": "Service worker implementing minimal precaching, runtime caching, and network‑first fetch handling.",
  "frontend/RESTORE_LIVE_V114_CHECKLIST.md": "Checklist verifying all frontend files and behaviors match Live v114 after restoration.",
  "frontend/src/App.tsx": "Sets up theming and providers and shows either an intro screen after login or the home page.",
  "frontend/src/components/ActorInitErrorState.tsx": "UI component showing detailed actor initialization errors with retry, logout, and technical info toggling.",
  "frontend/src/components/AnimatedGalleryIcon.tsx": "SVG camera icon with hover animations and visual effects.",
  "frontend/src/components/ConnectivityIndicator.tsx": "Empty component file.",
  "frontend/src/components/DecorativeBottomLine.tsx": "Renders a fixed decorative bottom line for UI styling.",
  "frontend/src/components/ExternalOpenFallbackDialog.tsx": "Dialog prompting users to retry opening or download a file when external opening is blocked.",
  "frontend/src/components/FilePreviewDialog.tsx": "Displays a dialog for previewing different file types and provides actions like open, download, delete, and move to folder.",
  "frontend/src/components/FileUploadSection.tsx": "Provides a drag‑and‑drop or click‑to‑upload section that uploads files with progress tracking and error handling.",
  "frontend/src/components/FoldersButton.tsx": "Floating button that opens the folders UI, showing a folder icon and handling disabled state.",
  "frontend/src/components/FoldersDialog.tsx": "Dialog for listing, creating, renaming, selecting, and deleting folders with swipe actions and validation.",
  "frontend/src/components/Footer.tsx": "Simple footer displaying copyright info and a link to caffeine.ai.",
  "frontend/src/components/FullScreenViewer.tsx": "Full‑screen viewer for navigating, previewing, sharing, deleting, and moving files with swipe navigation.",
  "frontend/src/components/GallerySection.tsx": "Renders a file gallery with selection, long‑press actions, previews, downloads, and full‑screen viewing.",
  "frontend/src/components/Header.tsx": "Top navigation bar with theme toggle, identity menu, sign‑out action, and a gallery icon with progress bar.",
  "frontend/src/components/IntroScreen.tsx": "Displays an animated welcome screen that triggers an onComplete callback after timed transitions.",
  "frontend/src/components/LoginButton.tsx": "Provides a button to sign in using Internet Identity, showing a loading spinner during authentication.",
  "frontend/src/components/MissionDetailFullScreenView.tsx": "Shows and edits a mission’s details with task management, progress calculation, saving, and deletion controls.",
  "frontend/src/components/MissionEditorDialog.tsx": "Dialog for creating a new mission with title and tasks, including validation and backend submission.",
  "frontend/src/components/MissionsButton.tsx": "Floating button that opens the missions interface using an animated target icon.",
  "frontend/src/components/MissionsFullScreenView.tsx": "Displays the full missions list with creation, swipe actions, deletion, and navigation into mission details.",
  "frontend/src/components/NotesButton.tsx": "Floating button that opens the notes interface using an animated notes icon.",
  "frontend/src/components/NotesDialog.tsx": "Empty component file.",
  "frontend/src/components/NotesFullScreenView.tsx": "Full-screen notes manager supporting creation, editing, deletion, and mobile-friendly editor behavior.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Empty component file.",
  "frontend/src/components/SendToFolderDialog.tsx": "Dialog component for moving selected files into folders or back to the main collection using folder-related mutations.",
  "frontend/src/components/SwipeActionsRow.tsx": "Row component enabling swipe-to-reveal edit and delete actions with touch and mouse gesture handling.",
  "frontend/src/components/UnifiedProgressBar.tsx": "Displays a unified progress bar showing overall upload progress and file count from the UploadContext.",
  "frontend/src/components/WelcomeIntroScreen.tsx": "Intro screen with branding, description, and login button for Internet Identity sign‑in.",
  "frontend/src/contexts/ActorContext.tsx": "Manages backend actor initialization, retry logic, error states, and sign‑out handling for authenticated interactions.",
  "frontend/src/contexts/UploadContext.tsx": "Provides upload batch tracking, progress aggregation, and functions to start, update, and complete uploads.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages a backend actor tied to the current identity and refreshes dependent queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity auth flow, storing and loading identities, tracking login status, and exposing login/clear functions.",
  "frontend/src/hooks/useIsCoarsePointer.ts": "Hook detecting whether the device uses a coarse (touch) pointer to adapt UI behavior.",
  "frontend/src/hooks/useMissionsQueries.ts": "React Query hooks for listing, retrieving, creating, updating, and deleting missions via the backend actor with cache invalidation and diagnostics.",
  "frontend/src/hooks/useNotesQueries.ts": "React Query hooks for listing, retrieving, creating, updating, and deleting notes with sorting, cache updates, and delete diagnostics.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for managing files and folders, including listing, fetching by folder, and creating or renaming folders.",
  "frontend/src/index.css": "Tailwind base styles and custom CSS variables defining light/dark themes and component accent colors.",
  "frontend/src/lib/utils.ts": "Utility function for merging class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "App entry point that initializes React, React Query, Internet Identity, and global styles.",
  "frontend/src/pages/HomePage.tsx": "Main page orchestrating authentication states and UI sections including files, folders, notes, and missions views.",
  "frontend/src/utils/actorInitializationMessaging.ts": "Defines actor initialization error messages and helpers to classify errors such as not-ready, failed init, invalid admin token, or stopped canister.",
  "frontend/src/utils/externalOpen.ts": "Provides utilities to open external URLs in a new tab and to download files via fetch and blob URLs.",
  "frontend/src/utils/fileOpenRules.ts": "Determines how files should open based on MIME type, choosing in-app viewer, office preview, or direct download.",
  "frontend/src/utils/filePreview.ts": "Categorizes files by MIME type and generates labels to support in-app preview behavior.",
  "frontend/src/utils/notesTime.ts": "Formats timestamps into human-readable relative times or short dates.",
  "frontend/src/utils/reactQueryDiagnostics.ts": "Offers diagnostics for React Query caches and logs lifecycle details during delete mutations.",
  "frontend/src/utils/urlParams.ts": "Handles URL and sessionStorage parameters, including retrieval, persistence, and safe removal from hash routing.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, colors, animations, and plugins for the frontend.",
  "frontend/V114_BASELINE_FRONTEND_FILES.txt": "Canonical file list enumerating all frontend files that define the Live v114 baseline.",
  "project_state.json": "Describes the project’s current features, versions, and overall architecture for MyGallery."
}