{
  "backend/main.mo": "Defines the actor with storage, authorization, and data models for files, folders, notes, missions, tasks, health checks, and diagnostics.",
  "feature_evidence.json": "Lists feature evidence entries detailing mission task toggle fixes, involved files, components, and test IDs.",
  "frontend-file-summaries.txt": "Contains short summaries describing the purpose and behavior of various frontend components, hooks, and utilities.",
  "frontend/DRAFT_BASELINE_V114.md": "Documentation describing creation of a draft baseline synced exactly to Live version 114 with validation steps and change‑control rules.",
  "frontend/index.css": "Defines Tailwind layers and CSS variables for light and dark themes.",
  "frontend/index.html": "HTML entrypoint setting meta tags, PWA config, icons, and service worker registration.",
  "frontend/PAUSE_AFTER_RESTORE.md": "Explains the post‑restoration freeze policy prohibiting changes until explicit user approval after restoring Live v114.",
  "frontend/public/manifest.json": "PWA manifest defining app metadata, icons, and display settings.",
  "frontend/public/sw.js": "Service worker implementing precaching, runtime caching, and offline fallback logic.",
  "frontend/PWA_INSTALLABILITY_NOTES.md": "Guide outlining steps to verify Chrome PWA installability including manifest, icons, service worker, and troubleshooting.",
  "frontend/RESTORE_LIVE_V114_CHECKLIST.md": "Checklist verifying that the frontend fully matches Live version 114 across authentication, UI, components, styling, and utilities.",
  "frontend/src/App.tsx": "Main app component wiring providers and intro logic around the HomePage.",
  "frontend/src/components/ActorInitErrorState.tsx": "UI component displaying classified actor initialization errors with retry and logout actions.",
  "frontend/src/components/AnimatedGalleryIcon.tsx": "React component rendering an SVG target-style animated gallery icon with hover effects.",
  "frontend/src/components/ConnectivityIndicator.tsx": "Empty file with no implemented component.",
  "frontend/src/components/DecorativeBottomLine.tsx": "Displays a fixed bottom horizontal line used as a decorative UI separator.",
  "frontend/src/components/ExternalOpenFallbackDialog.tsx": "Dialog shown when a file cannot be opened in a new window, offering retry and download actions.",
  "frontend/src/components/FilePreviewDialog.tsx": "Dialog for previewing files with support for images, videos, PDFs, Office docs, and file actions like delete or move.",
  "frontend/src/components/FileUploadSection.tsx": "Handles uploading files, creating links or notes, and integrates speech-to-text and upload progress tracking.",
  "frontend/src/components/FoldersButton.tsx": "Floating button that opens the folders view, displaying a folder icon and label.",
  "frontend/src/components/FoldersDialog.tsx": "Deprecated dialog for listing, creating, renaming, and deleting folders with swipe actions.",
  "frontend/src/components/FoldersFullScreenView.tsx": "Full-screen folders manager allowing creation, renaming, deletion, and selection of folders.",
  "frontend/src/components/Footer.tsx": "Footer displaying copyright info and a link to caffeine.ai.",
  "frontend/src/components/FullScreenViewer.tsx": "Provides a full‑screen file viewer with swipe navigation, download, delete, share, and external‑open actions, plus dialogs for folder and mission moves.",
  "frontend/src/components/GallerySection.tsx": "Renders a gallery of files and notes with selection, previews, long‑press actions, and viewer dialogs, loading items based on the selected folder.",
  "frontend/src/components/Header.tsx": "Displays the app header with theme toggle, authentication menu, title, and a global progress bar.",
  "frontend/src/components/IntroScreen.tsx": "Shows a fading splash screen with an animated icon and triggers completion after a timed fade-out.",
  "frontend/src/components/LinkOpenFallbackDialog.tsx": "Dialog shown when a link cannot open externally, offering retry and copy‑to‑clipboard options.",
  "frontend/src/components/LoginButton.tsx": "Button that triggers Internet Identity login, showing a loading state during authentication.",
  "frontend/src/components/MissionDetailFullScreenView.tsx": "Displays a full mission view with tasks, autosave, attached files and notes, and file/note viewers with fallback handling for links.",
  "frontend/src/components/MissionEditorDialog.tsx": "Dialog for creating missions with title and task list editing, including optimistic task IDs and form resets.",
  "frontend/src/components/MissionsButton.tsx": "Floating button that opens the missions view with hover and disabled styling.",
  "frontend/src/components/MissionsFullScreenView.tsx": "Full-screen missions manager that lists missions, supports swipe actions, creation, deletion, and detail viewing.",
  "frontend/src/components/MobileOnlyLayout.tsx": "Wrapper layout that displays children only within a mobile-focused container.",
  "frontend/src/components/MoveToMissionDialog.tsx": "Dialog allowing selected files or notes to be moved into a chosen mission.",
  "frontend/src/components/NotesButton.tsx": "Empty placeholder file with no implementation.",
  "frontend/src/components/NotesDialog.tsx": "Empty placeholder file with no implementation.",
  "frontend/src/components/NotesFullScreenView.tsx": "Empty placeholder file with no implementation.",
  "frontend/src/components/NoteViewerDialog.tsx": "Dialog for viewing a note with actions to download, share, delete, or send it elsewhere.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Empty placeholder file with no implementation.",
  "frontend/src/components/SendToFolderDialog.tsx": "Dialog to move files or notes to a folder or back to the main collection, with performance diagnostics.",
  "frontend/src/components/SwipeActionsRow.tsx": "Component that enables swipe-to-reveal edit and delete actions for list rows.",
  "frontend/src/components/UnifiedProgressBar.tsx": "Top progress bar that displays global upload progress when uploads are active.",
  "frontend/src/components/WelcomeIntroScreen.tsx": "Displays a full‑screen intro with a target‑themed SVG graphic and animated text, plus a login button.",
  "frontend/src/contexts/ActorContext.tsx": "Provides a context for managing backend actor initialization with retries, error handling, and sign‑out logic.",
  "frontend/src/contexts/UploadContext.tsx": "Manages upload items with progress tracking, batching, and legacy API compatibility for files, links, and notes.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor via React Query, reinitializing on identity changes and invalidating dependent queries.",
  "frontend/src/hooks/useHomePrefetch.ts": "Prefetches folders, files, missions, and notes once when the backend actor becomes ready for faster home‑screen loading.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity login, logout, state management, and stored‑identity restoration via AuthClient.",
  "frontend/src/hooks/useIntroOnAppResume.ts": "Runs a callback when the app regains focus or visibility, but only after identity is initialized.",
  "frontend/src/hooks/useIsCoarsePointer.ts": "Detects whether the device uses a coarse pointer to differentiate touch vs. mouse input.",
  "frontend/src/hooks/useMissionAutosave.ts": "Provides debounced autosave logic for mission title and tasks, handling mission switching and queued updates.",
  "frontend/src/hooks/useMissionsQueries.ts": "Defines React Query hooks for listing, fetching, creating, and updating missions with actor-based backend calls.",
  "frontend/src/hooks/useNotesQueries.ts": "Implements React Query hooks for retrieving, creating, and deleting notes, including folder and mission filtering.",
  "frontend/src/hooks/useQueries.ts": "Contains React Query hooks for files and folders along with mutation handlers for creating folders and uploading files with concurrency limits.",
  "frontend/src/hooks/useSpeechToText.ts": "Wraps browser speech recognition into a hook that exposes listening state, transcript callbacks, and error handling.",
  "frontend/src/index.css": "Defines Tailwind layers and extensive light/dark theme CSS variables plus base layout styles.",
  "frontend/src/lib/utils.ts": "Provides a utility function to merge conditional class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and loads global styles.",
  "frontend/src/pages/HomePage.tsx": "Implements the main home screen with authentication checks, data fetching, UI state, and optional dev smoke tests.",
  "frontend/src/utils/actorInitializationMessaging.ts": "Centralizes actor initialization error messages and logic for classifying backend actor errors.",
  "frontend/src/utils/externalOpen.ts": "Handles opening URLs, downloading files, and sharing files or notes with fallback logic for browser restrictions.",
  "frontend/src/utils/fileOpenRules.ts": "Determines how files should open based on MIME type and provides helpers for viewer vs download behavior.",
  "frontend/src/utils/filePreview.ts": "Categorizes files by MIME type and provides previewability checks and human-readable type labels.",
  "frontend/src/utils/missionCompletion.ts": "Computes mission progress, completion state, and splits missions into completed and incomplete groups.",
  "frontend/src/utils/missionTaskCompare.ts": "Performs BigInt‑safe equality comparison for task arrays by checking IDs, text, and completion flags.",
  "frontend/src/utils/notesTime.ts": "Empty or placeholder file with no implemented logic.",
  "frontend/src/utils/performanceDiagnostics.ts": "Provides an opt‑in performance logging utility that measures operation durations and logs results. Includes helpers for timing async functions and tracking metadata.",
  "frontend/src/utils/reactQueryDiagnostics.ts": "Logs React Query mutation lifecycle events during development for debugging. Outputs timestamped console messages for start, success, error, and settled phases.",
  "frontend/src/utils/smokeTestCoreFlows.ts": "Runs development smoke tests for core backend flows like creating folders, missions, links, and notes. Aggregates results and formats them for display.",
  "frontend/src/utils/uploadConcurrency.ts": "Implements a simple promise-based concurrency limiter to control parallel async operations. Manages a queue and runs tasks up to a defined concurrency limit.",
  "frontend/src/utils/urlParams.ts": "Utility for reading, persisting, and clearing URL and session-stored parameters, including support for hash-based routing. Also modifies URL hash to remove sensitive params.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, radii, animations, and plugin setup. Defines design tokens and component theming via CSS variables.",
  "frontend/V114_BASELINE_FRONTEND_FILES.txt": "Lists all frontend files included in the v114 canonical build baseline.",
  "project_state.json": "Tracks project metadata, versions, issues, and features; documents requirements for fixing mission task toggle UI updates and stale-state issues."
}