{
  "backend/main.mo": "Defines backend actor with types and state for files, notes, folders, missions, uploads, and authorization, with initial variables and maps for core storage logic.",
  "feature_evidence.json": "Feature evidence report mapping feature requirements to affected frontend files, components, and test IDs with confidence ratings.",
  "frontend-file-summaries.txt": "JSON list providing concise summaries of major frontend components and utilities, describing behavior, structure, and interactions.",
  "frontend/DRAFT_BASELINE_V114.md": "Documentation outlining creation of a new draft synced exactly to Live v114, including verification steps and baseline integrity rules.",
  "frontend/index.css": "Tailwind base stylesheet defining OKLCH theme variables and global styles for light and dark modes.",
  "frontend/index.html": "Main HTML entry point configuring PWA metadata, icons, and service worker registration.",
  "frontend/PAUSE_AFTER_RESTORE.md": "Change‑freeze notice stating no code modifications are allowed post‑restoration until explicit user approval, with guidelines and exceptions.",
  "frontend/public/manifest.json": "PWA manifest describing app metadata, theme colors, icons, and behavior for MYL.",
  "frontend/public/sw.js": "Service worker handling precaching, runtime caching, cache cleanup, and navigation fallback for the PWA.",
  "frontend/PWA_INSTALLABILITY_NOTES.md": "Checklist and instructions for verifying PWA installability on Chrome for Android, covering manifest, service worker, icons, and troubleshooting.",
  "frontend/RESTORE_LIVE_V114_CHECKLIST.md": "Checklist documenting verification of all frontend files and behaviors to ensure full alignment with Live version 114.",
  "frontend/src/App.tsx": "Root app component wiring providers, intro screen logic, and the home page with query and actor contexts.",
  "frontend/src/components/ActorInitErrorState.tsx": "UI component showing detailed actor initialization errors with retry, logout, and technical details expansion.",
  "frontend/src/components/AnimatedGalleryIcon.tsx": "Renders an interactive SVG target-style icon with hover animations and a glow effect.",
  "frontend/src/components/ConnectivityIndicator.tsx": "Empty component file with no implementation.",
  "frontend/src/components/DecorativeBottomLine.tsx": "Displays a fixed decorative horizontal line near the bottom of the screen.",
  "frontend/src/components/ExternalOpenFallbackDialog.tsx": "Dialog shown when a file cannot be opened in a new tab, offering retry and download options.",
  "frontend/src/components/FilePreviewDialog.tsx": "Provides a dialog for previewing files of various types and includes actions like open, download, move, and delete.",
  "frontend/src/components/FileUploadSection.tsx": "Handles uploading files, creating links and notes, with concurrency control, speech‑to‑text, and progress tracking.",
  "frontend/src/components/FoldersButton.tsx": "Floating button that opens the folders interface, with optional pulse and overlay behavior.",
  "frontend/src/components/FoldersDialog.tsx": "Deprecated dialog for listing, creating, renaming, and deleting folders with swipe actions.",
  "frontend/src/components/FoldersFullScreenView.tsx": "Full‑screen folder management view supporting create, rename, delete, and selection actions.",
  "frontend/src/components/Footer.tsx": "Renders a simple footer with branding and a link to caffeine.ai.",
  "frontend/src/components/FullScreenViewer.tsx": "Provides a full-screen file viewer with navigation, touch gestures, file actions, and sharing support.",
  "frontend/src/components/GallerySection.tsx": "Displays files and notes in a gallery with selection, previews, bulk actions, and viewer dialogs.",
  "frontend/src/components/Header.tsx": "Shows the top navigation bar with theme toggle, auth menu, and progress bar.",
  "frontend/src/components/HomeSharedElementTransitionLayer.tsx": "Implements shared-element animations between home screen sections using DOMRect transitions.",
  "frontend/src/components/IntroScreen.tsx": "Shows a brief intro splash screen with a fading animation before loading the app.",
  "frontend/src/components/LinkOpenFallbackDialog.tsx": "Dialog that appears when a link fails to open, offering retry and copy-to-clipboard options.",
  "frontend/src/components/LoginButton.tsx": "A login button that triggers Internet Identity authentication and shows loading state.",
  "frontend/src/components/MissionDetailFullScreenView.tsx": "Full-screen mission detail view handling tasks, autosave, attached files/notes, and viewer dialogs.",
  "frontend/src/components/MissionEditorDialog.tsx": "Dialog for creating missions with title and task management, using mutations to save new missions.",
  "frontend/src/components/MissionsButton.tsx": "Floating missions button with icon, hover effects, and optional pulse animation.",
  "frontend/src/components/MissionsFullScreenView.tsx": "Full-screen mission list with tabs, mission selection, deletion, and mission creation dialog.",
  "frontend/src/components/MobileOnlyLayout.tsx": "Wrapper component that constrains children to a mobile-only layout container.",
  "frontend/src/components/MoveToMissionDialog.tsx": "Dialog to move selected files or notes to a mission, showing mission list and handling move operations.",
  "frontend/src/components/NotesButton.tsx": "Empty placeholder file with no implementation.",
  "frontend/src/components/NotesDialog.tsx": "Empty placeholder file with no implementation.",
  "frontend/src/components/NotesFullScreenView.tsx": "Empty placeholder file with no implementation.",
  "frontend/src/components/NoteViewerDialog.tsx": "Dialog for viewing a single note with options to download, share, move, or delete it.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Empty placeholder file with no implementation.",
  "frontend/src/components/SendToFolderDialog.tsx": "Dialog for moving files or notes into folders or back to main collection, using folder-related mutations.",
  "frontend/src/components/SwipeActionsRow.tsx": "A swipeable row component that reveals edit and delete actions, handling drag gestures and state transitions.",
  "frontend/src/components/UnifiedProgressBar.tsx": "Displays a unified progress bar summarizing active file, link, and note uploads with aggregate progress.",
  "frontend/src/components/UploadQueueRunner.tsx": "Restores and resumes persisted uploads with concurrency control, tracks progress, and cleans up on unmount.",
  "frontend/src/components/WelcomeIntroScreen.tsx": "Renders the introductory welcome screen with branding graphics and a login entry point.",
  "frontend/src/contexts/ActorContext.tsx": "Manages backend actor initialization with retries, error handling, and identity-aware lifecycle management.",
  "frontend/src/contexts/UploadContext.tsx": "Tracks upload items, progress, completion, and restoration, providing functions to start and update uploads.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to identity changes, initializing admin access and refreshing dependent queries.",
  "frontend/src/hooks/useHomePrefetch.ts": "Prefetches folders, files, missions, and notes once when the backend actor and identity are ready.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context with login, logout, status tracking, and AuthClient initialization.",
  "frontend/src/hooks/useIntroOnAppResume.ts": "Triggers a callback when the app regains focus or visibility, but only after identity initialization.",
  "frontend/src/hooks/useIsCoarsePointer.ts": "Detects whether the device uses a coarse pointer like touch input.",
  "frontend/src/hooks/useMissionAutosave.ts": "Autosaves mission title and tasks with debouncing, change detection, and queued updates.",
  "frontend/src/hooks/useMissionsQueries.ts": "React Query hooks for listing, retrieving, creating, and updating missions with backend actor validation.",
  "frontend/src/hooks/useNotesQueries.ts": "React Query hooks for fetching, creating, and deleting notes across folders and missions with concurrency limiting.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching and mutating files and folders through the backend actor with caching and concurrency control.",
  "frontend/src/hooks/useSpeechToText.ts": "Implements a speech‑to‑text hook using the browser SpeechRecognition API with transcript streaming and error handling.",
  "frontend/src/index.css": "Defines Tailwind layers and extensive CSS variables for light/dark themes and layout styling.",
  "frontend/src/lib/utils.ts": "Exports a utility function that merges Tailwind class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentity providers and loads global styles.",
  "frontend/src/pages/HomePage.tsx": "Main home page component managing UI state, authentication readiness, data fetching, and lazy‑loaded folder/mission views.",
  "frontend/src/utils/actorInitializationMessaging.ts": "Provides utilities and constants for classifying actor initialization errors and generating user‑facing messages.",
  "frontend/src/utils/externalOpen.ts": "Provides helpers to open URLs, download files, share files, and detect popup blocking via visibility and focus events.",
  "frontend/src/utils/fileBytesWorkerSingleton.ts": "Manages a singleton web worker for reading file bytes with limited concurrency and queued requests.",
  "frontend/src/utils/fileOpenRules.ts": "Defines rules for whether files open in-app or download based on MIME category.",
  "frontend/src/utils/filePreview.ts": "Classifies files by MIME type and provides previewability checks and human-readable labels.",
  "frontend/src/utils/missionCompletion.ts": "Computes mission progress, checks completion status, and separates missions into completed and incomplete lists.",
  "frontend/src/utils/missionTaskCompare.ts": "Compares two task arrays safely with BigInt IDs by checking each field for equality.",
  "frontend/src/utils/notesTime.ts": "Empty file.",
  "frontend/src/utils/performanceDiagnostics.ts": "Implements optional performance timing utilities enabled via localStorage or URL parameters.",
  "frontend/src/utils/persistedUploadQueue.ts": "Stores upload items in IndexedDB, updating their progress, bytes, and completion state with size limits.",
  "frontend/src/utils/reactQueryDiagnostics.ts": "Logs React Query mutation lifecycle events in development mode for debugging.",
  "frontend/src/utils/smokeTestCoreFlows.ts": "Runs backend-driven smoke tests for core flows like folder, mission, link, and note creation and formats results.",
  "frontend/src/utils/uploadConcurrency.ts": "Provides concurrency limiters for async tasks, including a cancellable version with queue stats.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, persisting, and clearing URL and sessionStorage parameters.",
  "frontend/src/workers/fileBytes.worker.ts": "Web Worker that reads file bytes off the main thread and returns them with metadata.",
  "frontend/tailwind.config.js": "Tailwind CSS config defining custom colors, radius, animations, and plugin setup.",
  "frontend/V114_BASELINE_FRONTEND_FILES.txt": "Canonical file list defining the exact frontend baseline for Live version 114 used for drift detection and draft syncing.",
  "project_state.json": "Project state JSON describing inline in‑app document preview requirements and existing features."
}