{
  "backend/main.mo": "Motoko canister defining file, folder, mission, and user profile types with storage, access control, and creation/query logic.",
  "feature_evidence.json": "Feature evidence report describing a link-opening flow fix and listing related frontend files and components.",
  "frontend-file-summaries.txt": "Collection of short summaries describing the purpose and behavior of various frontend components and utilities.",
  "frontend/DRAFT_BASELINE_V114.md": "Documentation of the v114 baseline creation process ensuring 1:1 parity with Live version 114.",
  "frontend/index.css": "Defines Tailwind base layers and CSS variables for light and dark themes, applying global background, text, and border styles.",
  "frontend/index.html": "HTML entry point configuring PWA metadata, icons, and loading the main React script.",
  "frontend/PAUSE_AFTER_RESTORE.md": "Change‑freeze notice stating no modifications are allowed post‑restoration without explicit user approval.",
  "frontend/public/manifest.json": "PWA manifest specifying app metadata, icons, theme colors, and display settings.",
  "frontend/public/sw.js": "Service worker implementing minimal precaching, network-first fetch handling, and cache cleanup for the PWA.",
  "frontend/RESTORE_LIVE_V114_CHECKLIST.md": "Checklist verifying all frontend files and behaviors match Live version 114 after restoration.",
  "frontend/src/App.tsx": "Main app component wiring providers and showing either an intro screen after login or the HomePage.",
  "frontend/src/components/ActorInitErrorState.tsx": "Error UI component showing initialization failures with retry, sign-out options, and expandable technical details.",
  "frontend/src/components/AnimatedGalleryIcon.tsx": "Animated SVG icon with interactive hover effects for gallery targeting visuals.",
  "frontend/src/components/ConnectivityIndicator.tsx": "Empty component file with no implementation.",
  "frontend/src/components/DecorativeBottomLine.tsx": "Renders a fixed decorative horizontal line near the bottom of the screen.",
  "frontend/src/components/ExternalOpenFallbackDialog.tsx": "Dialog shown when a file fails to open externally, offering retry and download options.",
  "frontend/src/components/FilePreviewDialog.tsx": "Dialog component that previews files by type and provides actions like download, open, move, and delete.",
  "frontend/src/components/FileUploadSection.tsx": "Handles uploading files and creating link-based entries with progress tracking and validation.",
  "frontend/src/components/FoldersButton.tsx": "Floating button that opens the folders UI, with disabled and hover states.",
  "frontend/src/components/FoldersDialog.tsx": "Dialog to list, create, rename, and delete folders with swipe actions and validation.",
  "frontend/src/components/Footer.tsx": "Site footer displaying a copyright message and link to caffeine.ai.",
  "frontend/src/components/FullScreenViewer.tsx": "Full-screen viewer for browsing files with swipe navigation and actions like download, share, move, and delete.",
  "frontend/src/components/GallerySection.tsx": "Displays a grid of files with selection, previews, long‑press actions, and integration with fullscreen viewer and file operations.",
  "frontend/src/components/Header.tsx": "A header with theme toggle, authentication dropdown, app title, and a global progress bar.",
  "frontend/src/components/IntroScreen.tsx": "An animated welcome screen that plays a timed intro and then triggers completion.",
  "frontend/src/components/LinkOpenFallbackDialog.tsx": "A dialog shown when a link fails to open, offering retry and copy‑to‑clipboard options.",
  "frontend/src/components/LoginButton.tsx": "A button that triggers Internet Identity login and shows a loading state during authentication.",
  "frontend/src/components/MissionDetailFullScreenView.tsx": "Full‑screen mission editor with title, tasks, progress, file viewing, and mission update/delete actions.",
  "frontend/src/components/MissionEditorDialog.tsx": "A dialog for creating missions with title input and task list management.",
  "frontend/src/components/MissionsButton.tsx": "A floating button that opens the missions view, with hover animations and disabled state.",
  "frontend/src/components/MissionsFullScreenView.tsx": "Full‑screen missions list with creation, deletion, progress display, and navigation to mission details.",
  "frontend/src/components/MobileOnlyLayout.tsx": "A layout wrapper that renders children inside a mobile-only container.",
  "frontend/src/components/MoveToMissionDialog.tsx": "Dialog for listing missions and moving selected file IDs into a chosen mission, with loading and success/error feedback.",
  "frontend/src/components/NotesButton.tsx": "Empty file.",
  "frontend/src/components/NotesDialog.tsx": "Empty file.",
  "frontend/src/components/NotesFullScreenView.tsx": "Empty file.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Empty file.",
  "frontend/src/components/SendToFolderDialog.tsx": "Dialog for moving files into folders or returning them to the main collection, showing folder list and handling move actions.",
  "frontend/src/components/SwipeActionsRow.tsx": "Swipeable row component enabling edit/delete actions with pointer gesture handling and open/close state logic.",
  "frontend/src/components/UnifiedProgressBar.tsx": "Displays a global upload progress bar when uploads are active, showing percentage and item count.",
  "frontend/src/components/WelcomeIntroScreen.tsx": "Intro screen with branding graphics and messaging plus a login button.",
  "frontend/src/contexts/ActorContext.tsx": "Context managing backend actor initialization with retry logic, error handling, and identity-based setup.",
  "frontend/src/contexts/UploadContext.tsx": "Context that tracks upload batches, progress, and provides functions to start uploads and update or complete them.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on the current identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and helpers for Internet Identity login, logout, and identity persistence using AuthClient.",
  "frontend/src/hooks/useIsCoarsePointer.ts": "Detects whether the device uses a coarse (touch) pointer and updates on changes.",
  "frontend/src/hooks/useMissionsQueries.ts": "Defines mission-related React Query hooks for listing, fetching, creating, and updating missions using the backend actor.",
  "frontend/src/hooks/useNotesQueries.ts": "Empty file with no implemented logic.",
  "frontend/src/hooks/useQueries.ts": "Provides file and folder React Query hooks for fetching, creating, and modifying file and folder data via the backend actor.",
  "frontend/src/index.css": "Defines Tailwind CSS setup and extensive theme variables for light and dark modes, including notes and missions color schemes.",
  "frontend/src/lib/utils.ts": "Exports a utility for merging Tailwind class names with clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/HomePage.tsx": "Implements the main app page, handling authentication state, actor readiness, data fetching, UI sections, and optional smoke tests.",
  "frontend/src/utils/actorInitializationMessaging.ts": "Defines standardized actor initialization error messages and utilities to detect readiness, initialization, token, and canister-stopped errors.",
  "frontend/src/utils/externalOpen.ts": "Provides helpers to open URLs in new tabs with popup-block detection and to download files via fetch and blob URLs.",
  "frontend/src/utils/fileOpenRules.ts": "Determines how files should open based on MIME type, supporting in-app viewing, Office previews, or direct downloads.",
  "frontend/src/utils/filePreview.ts": "Classifies files by MIME type and provides previewability checks and human-readable type labels.",
  "frontend/src/utils/notesTime.ts": "Empty file with no implemented logic.",
  "frontend/src/utils/reactQueryDiagnostics.ts": "Offers React Query cache diagnostics and logging helpers for mission delete mutations plus basic actor error formatting.",
  "frontend/src/utils/smokeTestCoreFlows.ts": "Runs backend smoke tests for folder creation, mission creation, file upload, and list validation, returning step-based results.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, storing, persisting, and clearing URL parameters and session-stored values, including hash support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, radii, animations, and plugin setup.",
  "frontend/V114_BASELINE_FRONTEND_FILES.txt": "Canonical file list enumerating all frontend files included in the v114 baseline.",
  "project_state.json": "Defines project metadata, known issues, and a single existing feature focused on fixing incorrect fallback behavior when opening gallery links. Marks the project as a fix request with no new feature requests."
}