{
  "backend/main.mo": "Defines the backend actor with file, folder, mission, user profile, and authorization logic, including metadata types and CRUD operations with access control.",
  "feature_evidence.json": "Lists feature evidence entries mapping new fixes and behaviors to affected frontend files and components.",
  "frontend-file-summaries.txt": "Contains concise summaries of key frontend files and their responsibilities in the application.",
  "frontend/DRAFT_BASELINE_V114.md": "Documentation describing the creation of a v114 baseline draft with verification steps and change-control rules.",
  "frontend/index.css": "Defines Tailwind layers and extensive CSS variables for light and dark themes, applying global background, text, and border styles.",
  "frontend/index.html": "Main HTML entry point configuring metadata, PWA settings, icons, and loading the React app.",
  "frontend/PAUSE_AFTER_RESTORE.md": "Freeze notice stating no code changes are allowed post‑restoration until explicit user approval.",
  "frontend/public/manifest.json": "PWA manifest specifying app metadata, icons, colors, and display behavior for MyGallery.",
  "frontend/public/sw.js": "Service worker implementing minimal precaching, runtime caching, and network‑first fetch logic with fallbacks.",
  "frontend/RESTORE_LIVE_V114_CHECKLIST.md": "Checklist verifying that the frontend has been fully restored to Live v114 with correct behavior and file integrity.",
  "frontend/src/App.tsx": "Root React component managing theming, providers, and conditional intro display after successful login.",
  "frontend/src/components/ActorInitErrorState.tsx": "UI component showing error details and retry/logout actions for actor initialization failures.",
  "frontend/src/components/AnimatedGalleryIcon.tsx": "SVG-based animated camera icon with hover effects for visual branding.",
  "frontend/src/components/ConnectivityIndicator.tsx": "Empty placeholder component file.",
  "frontend/src/components/DecorativeBottomLine.tsx": "Renders a fixed subtle bottom divider line for UI decoration.",
  "frontend/src/components/ExternalOpenFallbackDialog.tsx": "Dialog shown when a file cannot be opened externally, offering retry and download actions.",
  "frontend/src/components/FilePreviewDialog.tsx": "Dialog component showing previews for various file types with actions like download, delete, and moving files.",
  "frontend/src/components/FileUploadSection.tsx": "Handles file uploads and link creation with validation, progress tracking, and status checks.",
  "frontend/src/components/FoldersButton.tsx": "Floating button that opens the folders UI, with disabled and hover states.",
  "frontend/src/components/FoldersDialog.tsx": "Dialog for listing, creating, renaming, and deleting folders with swipe actions and validation.",
  "frontend/src/components/Footer.tsx": "Simple footer displaying copyright and a link to caffeine.ai.",
  "frontend/src/components/FullScreenViewer.tsx": "Full‑screen file viewer with navigation, delete, download, share, and folder/move actions.",
  "frontend/src/components/GallerySection.tsx": "Displays a grid of files with selection, previews, long‑press actions, and opening behavior based on file type.",
  "frontend/src/components/Header.tsx": "Renders the main header with theme toggle, authentication menu, and a progress bar.",
  "frontend/src/components/IntroScreen.tsx": "Displays an animated welcome screen that auto-transitions to the main app.",
  "frontend/src/components/LinkOpenFallbackDialog.tsx": "Shows a dialog when a link cannot be opened, allowing retry or copying the URL.",
  "frontend/src/components/LoginButton.tsx": "Provides a login button for Internet Identity with loading feedback.",
  "frontend/src/components/MissionDetailFullScreenView.tsx": "Full-screen mission editor handling title, tasks, attachments, and mission updates.",
  "frontend/src/components/MissionEditorDialog.tsx": "Dialog for creating missions with title and task management.",
  "frontend/src/components/MissionsButton.tsx": "Floating button that opens the missions interface.",
  "frontend/src/components/MissionsFullScreenView.tsx": "Full-screen missions list with creation, deletion, and navigation to mission details.",
  "frontend/src/components/MoveToMissionDialog.tsx": "Dialog listing missions and allowing selected files to be moved to a mission, with loading, error, and pending states.",
  "frontend/src/components/NotesButton.tsx": "Empty file.",
  "frontend/src/components/NotesDialog.tsx": "Empty file.",
  "frontend/src/components/NotesFullScreenView.tsx": "Empty file.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Empty file.",
  "frontend/src/components/SendToFolderDialog.tsx": "Dialog for moving files into folders or back to the main collection, with folder listing and action handlers.",
  "frontend/src/components/SwipeActionsRow.tsx": "Swipeable row component exposing edit and delete actions with gesture handling and state control.",
  "frontend/src/components/UnifiedProgressBar.tsx": "Top progress bar showing aggregated upload progress and file count during active uploads.",
  "frontend/src/components/WelcomeIntroScreen.tsx": "Intro screen describing the app's purpose and providing a login button for onboarding.",
  "frontend/src/contexts/ActorContext.tsx": "Context managing backend actor initialization with retries, error classification, and sign-out handling.",
  "frontend/src/contexts/UploadContext.tsx": "Context tracking upload batches, per-file progress, totals, and helper methods to manage uploads.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and caches a backend actor based on identity, refetching dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity login, loading stored identities, and tracking login state.",
  "frontend/src/hooks/useIsCoarsePointer.ts": "React hook that detects whether the device uses a coarse (touch) pointer.",
  "frontend/src/hooks/useMissionsQueries.ts": "React Query hooks for listing, retrieving, creating, and updating missions via the backend actor.",
  "frontend/src/hooks/useNotesQueries.ts": "Empty placeholder file for notes-related React Query hooks.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching and mutating files and folders through the backend actor.",
  "frontend/src/index.css": "Tailwind CSS configuration defining light/dark themes, color variables, and global style rules.",
  "frontend/src/lib/utils.ts": "Utility function for merging Tailwind class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Application entry point initializing React, React Query, Internet Identity, and global styles.",
  "frontend/src/pages/HomePage.tsx": "Home page managing authentication state, backend readiness, data fetching, and UI sections like folders, missions, and uploads.",
  "frontend/src/utils/actorInitializationMessaging.ts": "Defines standardized actor initialization error messages and helpers to classify and extract error details.",
  "frontend/src/utils/externalOpen.ts": "Provides utilities to open external URLs and download files via browser APIs.",
  "frontend/src/utils/fileOpenRules.ts": "Determines how files should open based on MIME type and exposes helper checks for viewer or download behavior.",
  "frontend/src/utils/filePreview.ts": "Categorizes files by MIME type, checks preview support, and generates human-readable type labels.",
  "frontend/src/utils/notesTime.ts": "Empty placeholder file with no implemented logic.",
  "frontend/src/utils/reactQueryDiagnostics.ts": "Implements debugging helpers for React Query cache state and mutation lifecycle logging.",
  "frontend/src/utils/smokeTestCoreFlows.ts": "Runs backend smoke tests for folder creation, missions, file uploads, and list validations.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, storing, and clearing URL and session parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Configures TailwindCSS theme extensions, colors, animations, and plugin setup.",
  "frontend/V114_BASELINE_FRONTEND_FILES.txt": "Canonical list of all frontend files that define the v114 baseline for drift detection and future syncs.",
  "project_state.json": "Defines the current project state, listing three known bugs related to deletion flows and a link-opening UI error, along with corresponding existing feature entries. Indicates this is a fix request with no new feature proposals."
}