{
  "backend/main.mo": "Main backend actor implementing file storage, folder management, mission/task system, notes, user profiles, and authorization with blob storage mixins, access control, and diagnostic endpoints.",
  "feature_evidence.json": "Feature evidence report documenting implemented features for live stack inbox, file organization indicators, and animation behaviors with associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend components including App, HomePage, Header, FileUpload, Gallery, dialogs, hooks, and utilities with their key behaviors and integrations.",
  "frontend/DRAFT_BASELINE_V114.md": "Documentation establishing Draft baseline synced 1:1 with Live version 114, including validation checklist for authentication, actor initialization, UI/UX behavior, and core flows smoke test procedure.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining CSS custom properties for light and dark themes, including sidebar, chart, and UI component color tokens.",
  "frontend/index.html": "Main HTML entry point with PWA configuration, service worker registration, iOS-specific meta tags, and MYL branding with bullseye icon references.",
  "frontend/PAUSE_AFTER_RESTORE.md": "Change control freeze notice prohibiting all code changes after Live v114 restoration until explicit user approval with change list is provided.",
  "frontend/public/manifest.json": "PWA manifest defining MYL app metadata, standalone display mode, purple theme color, and icon references for 192x192 and 512x512 bullseye icons.",
  "frontend/public/sw.js": "Service worker implementing network-first caching strategy with runtime cache trimming, offline fallback to index.html, and skip of canister API calls.",
  "frontend/PWA_INSTALLABILITY_NOTES.md": "Comprehensive PWA installability verification guide for Chrome on Android, covering manifest requirements, service worker checks, testing procedures, and troubleshooting common issues.",
  "frontend/RESTORE_LIVE_V114_CHECKLIST.md": "Comprehensive checklist documenting the restoration and verification of Live version 114 frontend code, including authentication flow, UI components, file management, and behavior verification steps.",
  "frontend/src/App.tsx": "Root application component wrapping HomePage with ThemeProvider, QueryClientProvider, ActorProvider, UploadProvider, and conditional IntroScreen display on app resume when authenticated.",
  "frontend/src/components/ActorInitErrorState.tsx": "Error state component displaying actor initialization failures with collapsible technical details, retry/logout actions, and specialized messaging for stopped canisters and invalid admin tokens.",
  "frontend/src/components/AnimatedGalleryIcon.tsx": "Renders an animated SVG icon with concentric target rings, crosshairs, corner markers, and a pulsing center bullseye. Includes hover effects with color transitions and a glow effect.",
  "frontend/src/components/ConnectivityIndicator.tsx": "Empty file with no content.",
  "frontend/src/components/DecorativeBottomLine.tsx": "Renders a fixed horizontal decorative border line near the bottom of the screen with theme-aware styling.",
  "frontend/src/components/ExternalOpenFallbackDialog.tsx": "Dialog component that appears when a file cannot be opened in a new window, offering retry and download options with warning styling.",
  "frontend/src/components/FilePreviewDialog.tsx": "Dialog for previewing files with support for images, videos, PDFs, and Office documents. Includes actions for download, external open, send to folder, move to mission, and delete with confirmation.",
  "frontend/src/components/FileUploadSection.tsx": "Handles file uploads, link creation, and note creation with speech-to-text support. Manages concurrent uploads with a limiter, persists to IndexedDB, and provides progress tracking.",
  "frontend/src/components/FoldersButton.tsx": "Fixed-position button component for accessing folders, featuring a folder icon with hover effects, pulse animation support, and accessibility attributes.",
  "frontend/src/components/FoldersDialog.tsx": "Deprecated dialog component for managing folders (create, rename, delete) with swipe actions. Marked for removal in favor of FoldersFullScreenView.",
  "frontend/src/components/FoldersFullScreenView.tsx": "Full-screen view for managing folders with create, rename, delete operations using swipe actions. Includes folder selection and navigation back to previous screen.",
  "frontend/src/components/Footer.tsx": "Renders a footer component with copyright notice and a link to caffeine.ai, styled with a heart icon.",
  "frontend/src/components/FullScreenViewer.tsx": "Full-screen file viewer with navigation, keyboard/touch controls, and actions (download, delete, share, move to folder/mission) for viewing files in a gallery.",
  "frontend/src/components/GallerySection.tsx": "Main gallery component displaying files and notes with grid layout, bulk selection, long-press interactions, and integration with folders, missions, and file organization features.",
  "frontend/src/components/Header.tsx": "Application header with animated gallery icon, theme toggle (light/dark), sign-out dropdown menu, and unified progress bar.",
  "frontend/src/components/HomeSharedElementTransitionLayer.tsx": "Provides shared element transition animations with backdrop blur when opening/closing folders or missions sections.",
  "frontend/src/components/IntroScreen.tsx": "Displays an animated splash screen with the gallery icon that fades out after 2 seconds on app load.",
  "frontend/src/components/LinkOpenFallbackDialog.tsx": "Dialog shown when browser blocks opening a link, offering retry and copy-to-clipboard options.",
  "frontend/src/components/LiveStackInbox.tsx": "Fixed bottom-right stack preview showing up to 3 unorganized files with slide-in animations for newly uploaded items.",
  "frontend/src/components/LoginButton.tsx": "Button component for Internet Identity authentication with loading state indicator.",
  "frontend/src/components/MissionDetailFullScreenView.tsx": "Full-screen view for a single mission showing title, tasks, attached files, and notes with autosave functionality. Supports task toggling, adding tasks, viewing attachments, and external link handling.",
  "frontend/src/components/MissionEditorDialog.tsx": "Dialog for creating new missions with title input and task list management. Handles task addition, removal, and completion toggling before mission creation.",
  "frontend/src/components/MissionsButton.tsx": "Floating action button component with Target icon for opening the missions view. Supports disabled state, pulse animation, and z-index control.",
  "frontend/src/components/MissionsFullScreenView.tsx": "Full-screen missions list view with tabs for incomplete/completed missions, swipe-to-delete actions, and navigation to mission detail view. Handles mission creation and deletion.",
  "frontend/src/components/MobileOnlyLayout.tsx": "Simple layout wrapper component that constrains children to a mobile-only container with specific styling classes.",
  "frontend/src/components/MoveToMissionDialog.tsx": "Dialog for moving files and notes to a selected mission. Displays mission list as clickable cards and handles batch move operations.",
  "frontend/src/components/NotesButton.tsx": "Empty file with no content.",
  "frontend/src/components/NotesDialog.tsx": "Empty file with no content.",
  "frontend/src/components/NotesFullScreenView.tsx": "Empty file with no content.",
  "frontend/src/components/NoteViewerDialog.tsx": "Dialog for viewing a single note with actions to send to folder/mission, download, share, and delete. Displays note title and body in a scrollable area.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Empty file with no content.",
  "frontend/src/components/SendToFolderDialog.tsx": "Dialog component for moving files and notes to folders or returning them to the main collection, with performance diagnostics tracking and loading states.",
  "frontend/src/components/SwipeActionsRow.tsx": "Swipeable row component with touch gesture support that reveals edit and delete action buttons when swiped left.",
  "frontend/src/components/UnifiedProgressBar.tsx": "Fixed progress bar component that displays upload progress for active file, link, and note uploads with percentage and item counts.",
  "frontend/src/components/UploadQueueRunner.tsx": "Background component that restores and resumes pending uploads from persisted queue on app load, managing concurrent uploads with progress tracking.",
  "frontend/src/components/WelcomeIntroScreen.tsx": "Welcome screen with animated target/crosshair logo and introductory text explaining the app's purpose, including a login button.",
  "frontend/src/contexts/ActorContext.tsx": "React context provider that manages backend actor initialization with identity authentication, exponential backoff retry logic, and error classification for stopped canisters.",
  "frontend/src/contexts/UploadContext.tsx": "React context that manages upload progress tracking for files, links, and notes, providing functions to start uploads, update progress, complete uploads, and restore items with automatic cleanup after completion.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages the backend actor instance based on Internet Identity authentication state, initializing access control with admin token and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useFileOrganizationStatus.ts": "Hook that identifies unorganized files (those not in any folder or mission) by querying root files and returning a Set of unorganized file IDs for efficient lookup.",
  "frontend/src/hooks/useHomePrefetch.ts": "Hook that prefetches core data (folders, files, missions, notes) once when the actor becomes ready and user is authenticated, using a ref to prevent refetch loops.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and provider, managing login/logout state, identity persistence, and AuthClient configuration with idle handling options.",
  "frontend/src/hooks/useIntroOnAppResume.ts": "Hook that detects when the app returns to foreground (visibility change or window focus) and invokes a callback only when user is authenticated and initialization is complete.",
  "frontend/src/hooks/useIsCoarsePointer.ts": "Hook that detects if the device has a coarse pointer (touch device) using media queries, returning true for mobile/touch and false for desktop/mouse devices.",
  "frontend/src/hooks/useMissionAutosave.ts": "Hook that provides debounced autosave functionality for mission edits, tracking changes from hydrated state, handling mission switches, and queuing updates during active saves.",
  "frontend/src/hooks/useMissionsQueries.ts": "Provides React Query hooks for mission CRUD operations (list, get, create, update) with optimistic updates, targeted cache invalidations, and BigInt-safe comparisons for sorting and state management.",
  "frontend/src/hooks/useNotesQueries.ts": "React Query hooks for managing notes CRUD operations (create, delete, update) with targeted cache invalidation based on folder/mission context and concurrency limiting.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for file and folder operations including paginated fetches, uploads with concurrency limiting (3 concurrent), and mutations with performance diagnostics.",
  "frontend/src/hooks/useSpeechToText.ts": "Custom hook wrapping Web Speech Recognition API for continuous speech-to-text with interim results, error handling, and configurable language support.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light/dark themes, including specialized color schemes for notes (green) and missions (purple) sections.",
  "frontend/src/lib/utils.ts": "Utility function combining clsx and tailwind-merge for conditional CSS class name composition.",
  "frontend/src/main.tsx": "Application entry point setting up React Query and Internet Identity providers, rendering the root App component.",
  "frontend/src/pages/HomePage.tsx": "Main home page component managing folders/missions full-screen views, file uploads, gallery display, authentication state, and optional dev-mode smoke tests with lazy-loaded views.",
  "frontend/src/utils/actorInitializationMessaging.ts": "Provides utilities for detecting and classifying actor initialization errors (not ready, stopped canister, invalid admin token) and standardizing user-facing error messages.",
  "frontend/src/utils/externalOpen.ts": "Contains functions for opening URLs externally, downloading files, sharing files via Web Share API, and handling file/note downloads with popup blocker detection.",
  "frontend/src/utils/fileBytesWorkerSingleton.ts": "Manages a singleton Web Worker for reading file bytes with concurrency limiting (max 3 concurrent requests) and request queuing.",
  "frontend/src/utils/fileOpenRules.ts": "Determines the primary action (in-app viewer vs. download-only) when a user opens a file based on its MIME type category.",
  "frontend/src/utils/filePreview.ts": "Categorizes files by MIME type (image, video, PDF, office, unsupported) and provides helpers to check if files are previewable in-app and get human-readable type labels.",
  "frontend/src/utils/missionCompletion.ts": "Calculates mission progress percentage, determines completion status (100% with at least 1 task), and splits missions into incomplete/completed lists.",
  "frontend/src/utils/missionTaskCompare.ts": "Provides BigInt-safe equality comparison for Task arrays by comparing taskId, task text, and completed status without using JSON.stringify.",
  "frontend/src/utils/notesTime.ts": "Empty utility file with no content.",
  "frontend/src/utils/performanceDiagnostics.ts": "Opt-in performance diagnostics utility (via localStorage or URL param) that logs operation timings and provides helpers for timing async operations.",
  "frontend/src/utils/persistedUploadQueue.ts": "Manages an IndexedDB-backed upload queue for persisting file uploads (up to 50MB) with progress tracking, completion marking, and recovery capabilities.",
  "frontend/src/utils/reactQueryDiagnostics.ts": "Development-only logging helper for React Query mutation lifecycle phases (start, success, error, settled) with timestamps.",
  "frontend/src/utils/smokeTestCoreFlows.ts": "Development utility that runs smoke tests for core application flows (folder, mission, link, and note creation) by executing backend operations and verifying results.",
  "frontend/src/utils/uploadConcurrency.ts": "Provides concurrency limiters for managing parallel task execution with configurable limits, including a cancellable variant with queue statistics.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/src/workers/fileBytes.worker.ts": "Web Worker that reads file bytes off the main thread, converting Files to Uint8Arrays and returning metadata with error handling.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH color space, extended theme for sidebar/notes/missions, and animation utilities.",
  "frontend/V114_BASELINE_FRONTEND_FILES.txt": "Canonical list of all frontend files that define the v114 baseline, organized by category (core, components, contexts, hooks, utilities, styling, PWA, configuration) for repeatable validation.",
  "project_state.json": "Project state tracking document defining the Live Stack Inbox feature for newly uploaded files with slide animations, unorganized indicators, and gallery integration requirements."
}