{
  "backend/main.mo": "Motoko canister implementing file, folder, profile, notes, and mission management with authorization, storage mixins, and various query/update methods.",
  "feature_evidence.json": "Feature evidence report listing swipe-gesture UI features, associated frontend files, components, and confidence metadata.",
  "frontend-file-summaries.txt": "Text file mapping many frontend paths to short functional descriptions of each component or utility.",
  "frontend/DRAFT_BASELINE_V114.md": "Documentation describing creation and verification of a Draft baseline synced exactly to Live version 114.",
  "frontend/index.css": "Tailwind setup defining light/dark theme CSS variables and base styles.",
  "frontend/index.html": "Main HTML entry configuring PWA metadata, icons, and loading the React app.",
  "frontend/PAUSE_AFTER_RESTORE.md": "Change‑freeze notice stating that no code changes are allowed until explicit user approval after restoring Live v114.",
  "frontend/public/manifest.json": "PWA manifest defining app metadata, icons, and display behavior.",
  "frontend/public/sw.js": "Service worker implementing minimal precaching and network-first caching logic.",
  "frontend/RESTORE_LIVE_V114_CHECKLIST.md": "Checklist verifying that the frontend fully matches Live version 114, covering authentication, actor init, UI, and configuration.",
  "frontend/src/App.tsx": "Root React app managing theme, providers, and conditional intro screen after login.",
  "frontend/src/components/ActorInitErrorState.tsx": "UI component showing detailed actor initialization errors with retry and logout actions.",
  "frontend/src/components/AnimatedGalleryIcon.tsx": "SVG camera icon with hover animations and visual effects.",
  "frontend/src/components/ConnectivityIndicator.tsx": "Empty placeholder component.",
  "frontend/src/components/DecorativeBottomLine.tsx": "Renders a fixed subtle bottom divider line for UI decoration.",
  "frontend/src/components/ExternalOpenFallbackDialog.tsx": "Dialog shown when a file cannot open externally, offering retry and download options.",
  "frontend/src/components/FilePreviewDialog.tsx": "Dialog that previews files by type and provides actions like open, download, send to folder, and delete.",
  "frontend/src/components/FileUploadSection.tsx": "Upload section handling file input, progress tracking, and upload mutations with status checks and toasts.",
  "frontend/src/components/FoldersButton.tsx": "Floating button that displays a folder icon and triggers folder-related actions.",
  "frontend/src/components/FoldersDialog.tsx": "Dialog for listing, creating, renaming, and deleting folders with backend mutations and swipe actions.",
  "frontend/src/components/Footer.tsx": "Simple footer showing copyright and attribution link.",
  "frontend/src/components/FullScreenViewer.tsx": "Fullscreen viewer for browsing files with swipe navigation and actions like download, share, delete, and send to folder.",
  "frontend/src/components/GallerySection.tsx": "Gallery view displaying files or folder contents, supporting long‑press selection, file actions, and fullscreen viewing.",
  "frontend/src/components/Header.tsx": "App header with theme toggle, authentication menu, and progress bar integration.",
  "frontend/src/components/IntroScreen.tsx": "Displays a timed welcome animation and triggers onComplete after finishing.",
  "frontend/src/components/LoginButton.tsx": "Button that initiates Internet Identity login and shows loading state.",
  "frontend/src/components/MissionDetailFullScreenView.tsx": "Full‑screen mission editor allowing task management, title editing, and save/delete actions.",
  "frontend/src/components/MissionEditorDialog.tsx": "Dialog for creating missions with tasks, including add/remove and validation logic.",
  "frontend/src/components/MissionsButton.tsx": "Floating button that opens the missions view with animated icon states.",
  "frontend/src/components/MissionsFullScreenView.tsx": "Manages listing, creating, selecting, and deleting missions with navigation to detail view.",
  "frontend/src/components/NotesButton.tsx": "Floating button that opens the notes view with a stylized icon.",
  "frontend/src/components/NotesDialog.tsx": "Empty placeholder file.",
  "frontend/src/components/NotesFullScreenView.tsx": "Full‑screen notes manager supporting creation, editing, deletion, and mobile editor flow.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Empty placeholder file.",
  "frontend/src/components/SendToFolderDialog.tsx": "Dialog component to move files into folders or back to the main collection using folder queries and mutations.",
  "frontend/src/components/SwipeRevealRow.tsx": "Swipeable row component that reveals action buttons on touch drag with open/close state handling.",
  "frontend/src/components/UnifiedProgressBar.tsx": "Displays a unified upload progress bar showing total progress and file count when uploads are active.",
  "frontend/src/components/WelcomeIntroScreen.tsx": "Intro screen with branding, description, and login button for first‑time or signed‑out users.",
  "frontend/src/contexts/ActorContext.tsx": "Context managing backend actor creation with retries, error handling, and identity-based initialization.",
  "frontend/src/contexts/UploadContext.tsx": "Context tracking upload batches, progress updates, and completion with derived totals and counts.",
  "frontend/src/hooks/useActor.ts": "Hook that builds and caches an actor via react-query, refreshing dependent queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth state, login/clear functions, and persistence using AuthClient.",
  "frontend/src/hooks/useMissionsQueries.ts": "React Query hooks for listing, fetching, creating, updating, and deleting missions via the backend actor with caching and optimistic updates.",
  "frontend/src/hooks/useNotesQueries.ts": "React Query hooks for CRUD operations on notes, including sorting, invalidation, and legacy compatibility.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for managing files and folders, supporting pagination, folder operations, and optimistic folder rename updates.",
  "frontend/src/index.css": "Tailwind CSS setup defining light/dark theme variables and component styling tokens.",
  "frontend/src/lib/utils.ts": "Utility function merging class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Application entry point initializing React, QueryClient, Internet Identity, and global styles.",
  "frontend/src/pages/HomePage.tsx": "Main page handling authentication states and rendering file gallery, folders, notes, and missions views with related UI controls.",
  "frontend/src/utils/actorInitializationMessaging.ts": "Defines user-facing actor initialization messages and helpers to classify IC-related errors including not-ready, init-failure, invalid admin token, and stopped canister.",
  "frontend/src/utils/externalOpen.ts": "Provides utilities to open URLs in new tabs and to download files via blob links.",
  "frontend/src/utils/fileOpenRules.ts": "Determines how files should open (viewer, office preview, or download) based on MIME type and helper predicates.",
  "frontend/src/utils/filePreview.ts": "Categorizes MIME types into previewable groups and returns human‑readable file labels.",
  "frontend/src/utils/notesTime.ts": "Formats timestamps into relative phrases like minutes/hours ago or a short date.",
  "frontend/src/utils/urlParams.ts": "Handles reading, persisting, and clearing URL parameters with sessionStorage support and hash‑based routing awareness.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme tokens, OKLCH color mappings, animations, and plugin setup.",
  "frontend/V114_BASELINE_FRONTEND_FILES.txt": "Canonical file list enumerating all frontend files that define the Live version 114 baseline for parity validation.",
  "project_state.json": "Describes overall project state, features, and metadata for the MyGallery PWA backed by an IC canister."
}