{
  "backend/main.mo": "Motoko actor handling file, folder, mission, user profile storage, plus diagnostics and authorization.",
  "feature_evidence.json": "Feature evidence report mapping features to related frontend files, components, tests, and confidence.",
  "frontend-file-summaries.txt": "Prewritten summaries describing purposes of multiple frontend files and components.",
  "frontend/DRAFT_BASELINE_V114.md": "Documentation of creating a v114-synced draft baseline with full parity and validation steps.",
  "frontend/index.css": "Defines Tailwind layers and extensive CSS variables for light and dark themes plus base element styling.",
  "frontend/index.html": "HTML entry point configuring PWA metadata, icons, and loads the main React app.",
  "frontend/PAUSE_AFTER_RESTORE.md": "Change‑freeze notice after restoring Live v114, outlining prohibited and allowed actions.",
  "frontend/public/manifest.json": "PWA manifest defining app metadata, colors, icons, and startup settings.",
  "frontend/public/sw.js": "Service worker implementing minimal precaching, network-first fetch handling, and cache cleanup.",
  "frontend/RESTORE_LIVE_V114_CHECKLIST.md": "Checklist verifying full restoration of frontend to Live v114, covering flows, components, and behavior.",
  "frontend/src/App.tsx": "Main app wrapper providing theme, actor, and upload contexts around the HomePage component.",
  "frontend/src/components/ActorInitErrorState.tsx": "UI component displaying actor initialization errors with retry, logout, and expandable technical details.",
  "frontend/src/components/AnimatedGalleryIcon.tsx": "SVG-based animated target-style gallery icon with hover effects.",
  "frontend/src/components/ConnectivityIndicator.tsx": "Empty component file with no implementation.",
  "frontend/src/components/DecorativeBottomLine.tsx": "Renders a fixed subtle bottom line decoration for UI layout.",
  "frontend/src/components/ExternalOpenFallbackDialog.tsx": "Dialog shown when a file cannot open externally, offering retry and download options.",
  "frontend/src/components/FilePreviewDialog.tsx": "Displays a dialog for previewing files with support for images, videos, PDFs, Office docs, and actions like download, delete, and moving files.",
  "frontend/src/components/FileUploadSection.tsx": "Provides UI for uploading files or creating external links, managing progress and backend mutations.",
  "frontend/src/components/FoldersButton.tsx": "Renders a floating button that opens the folders view, with optional disabled and initializing states.",
  "frontend/src/components/FoldersDialog.tsx": "Deprecated folder management dialog allowing creation, renaming, deletion, and selection of folders.",
  "frontend/src/components/FoldersFullScreenView.tsx": "Full‑screen folder manager that supports creating, renaming, deleting, and selecting folders.",
  "frontend/src/components/Footer.tsx": "Simple footer showing copyright text and a link to caffeine.ai.",
  "frontend/src/components/FullScreenViewer.tsx": "Full‑screen media viewer with swipe navigation and actions like download, delete, share, and moving files.",
  "frontend/src/components/GallerySection.tsx": "Displays files in a gallery with touch interactions, selection mode, previews, and external/open logic.",
  "frontend/src/components/Header.tsx": "Provides the top navigation bar with theme toggle, auth menu, and progress bar.",
  "frontend/src/components/IntroScreen.tsx": "Shows a short animated splash screen that fades out after a timed sequence.",
  "frontend/src/components/LinkOpenFallbackDialog.tsx": "Dialog shown when a link fails to open, offering retry or copy-to-clipboard options.",
  "frontend/src/components/LoginButton.tsx": "Button that triggers Internet Identity login and shows loading state.",
  "frontend/src/components/MissionDetailFullScreenView.tsx": "Full-screen mission editor showing tasks, file attachments, progress, and save/delete actions.",
  "frontend/src/components/MissionEditorDialog.tsx": "Dialog for creating a new mission with title and task list management.",
  "frontend/src/components/MissionsButton.tsx": "Floating action button that opens the missions interface, with disabled and loading states.",
  "frontend/src/components/MissionsFullScreenView.tsx": "Full-screen missions list with creation, selection, swipe actions, and delete confirmation.",
  "frontend/src/components/MobileOnlyLayout.tsx": "Wrapper component that displays children inside a mobile-only styled container.",
  "frontend/src/components/MoveToMissionDialog.tsx": "Dialog that lists missions and moves selected files to a chosen mission using async mutations.",
  "frontend/src/components/NotesButton.tsx": "Empty placeholder file.",
  "frontend/src/components/NotesDialog.tsx": "Empty placeholder file.",
  "frontend/src/components/NotesFullScreenView.tsx": "Empty placeholder file.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Empty placeholder file.",
  "frontend/src/components/SendToFolderDialog.tsx": "Dialog for moving files to a folder or returning them to the main collection with performance logging.",
  "frontend/src/components/SwipeActionsRow.tsx": "Swipeable row component exposing edit and delete actions with pointer gesture handling.",
  "frontend/src/components/UnifiedProgressBar.tsx": "Global upload progress bar showing total progress and item count.",
  "frontend/src/components/WelcomeIntroScreen.tsx": "Intro screen with branding graphics and a login button for new users.",
  "frontend/src/contexts/ActorContext.tsx": "Context managing backend actor initialization, retry logic, error handling, and sign-out behavior.",
  "frontend/src/contexts/UploadContext.tsx": "Provides upload state management, batching, and progress updates using React context with throttled progress flushing.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the user's identity and refreshes dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication, loading stored identities, and providing login/logout state through a React context.",
  "frontend/src/hooks/useIsCoarsePointer.ts": "Detects whether the device uses a coarse pointer via matchMedia and updates on changes.",
  "frontend/src/hooks/useMissionsQueries.ts": "Defines React Query hooks for listing, fetching, creating, updating, and deleting missions using the backend actor.",
  "frontend/src/hooks/useNotesQueries.ts": "Empty file placeholder for future notes-related query hooks.",
  "frontend/src/hooks/useQueries.ts": "Provides file and folder query hooks plus upload handling with concurrency limits and performance diagnostics.",
  "frontend/src/index.css": "Tailwind-based global styles defining light/dark themes and custom design tokens for UI elements.",
  "frontend/src/lib/utils.ts": "Exports a utility function for merging class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider before rendering App.",
  "frontend/src/pages/HomePage.tsx": "Home page component managing authentication state, folder/mission overlays, data fetching, and optional dev smoke-test execution.",
  "frontend/src/utils/actorInitializationMessaging.ts": "Defines standardized actor initialization error messages and helpers to classify actor-related errors.",
  "frontend/src/utils/externalOpen.ts": "Provides utilities to open external URLs with popup‑block detection and to download files via blob links.",
  "frontend/src/utils/fileOpenRules.ts": "Determines how files should be opened (viewer, office preview, or download) based on MIME type.",
  "frontend/src/utils/filePreview.ts": "Classifies files by MIME type, checks preview capability, and provides human‑readable file type labels.",
  "frontend/src/utils/notesTime.ts": "Empty placeholder file with no implemented logic.",
  "frontend/src/utils/performanceDiagnostics.ts": "Lightweight performance diagnostics tool that times operations when enabled via localStorage or URL param.",
  "frontend/src/utils/reactQueryDiagnostics.ts": "Developer utilities for inspecting React Query cache state and logging mission delete mutation lifecycles.",
  "frontend/src/utils/smokeTestCoreFlows.ts": "Runs a backend smoke test covering folder creation, mission creation, file upload, and list verification.",
  "frontend/src/utils/uploadConcurrency.ts": "Implements a simple promise-based concurrency limiter that queues tasks and runs them up to a specified maximum in parallel.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading URL parameters, persisting them in sessionStorage, and managing hash-based parameters.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, radii, animations, and enabling plugins for animation and typography.",
  "frontend/V114_BASELINE_FRONTEND_FILES.txt": "Canonical file list for frontend v114 used to validate 1:1 draft sync.",
  "project_state.json": "JSON file describing the project's current state, features, issues, and performance-related startup improvements."
}