{
  "backend/main.mo": "Motoko actor defining types and state for files, notes, folders, missions, uploads, authorization, and persistent storage.",
  "feature_evidence.json": "Feature evidence report listing two gallery bulk-selection related features with associated files, components, tests, and confidence.",
  "frontend-file-summaries.txt": "Collection of concise per-file frontend summaries describing component behavior, hooks, and utilities.",
  "frontend/DRAFT_BASELINE_V114.md": "Documentation establishing a v114 baseline with verification steps, parity validation, and workflow notes.",
  "frontend/index.css": "Defines Tailwind base layers and theme variables for light and dark modes.",
  "frontend/index.html": "HTML entry point setting up PWA metadata, icons, and service worker registration.",
  "frontend/PAUSE_AFTER_RESTORE.md": "Change‑control notice declaring a freeze on modifications after restoring Live v114 until explicit user approval.",
  "frontend/public/manifest.json": "PWA manifest specifying app metadata, icons, and display configuration.",
  "frontend/public/sw.js": "Service worker implementing precaching, runtime caching, and network-first navigation handling.",
  "frontend/PWA_INSTALLABILITY_NOTES.md": "Checklist and troubleshooting guide for verifying PWA installability and service worker/manifest requirements.",
  "frontend/RESTORE_LIVE_V114_CHECKLIST.md": "Checklist confirming full restoration of frontend to Live v114 with validated behavior, components, and configuration.",
  "frontend/src/App.tsx": "Main React app component wiring providers, intro screen behavior, and the home page.",
  "frontend/src/components/ActorInitErrorState.tsx": "UI component displaying actor initialization errors with retry, logout, and expandable technical details.",
  "frontend/src/components/AnimatedGalleryIcon.tsx": "SVG-based animated gallery icon with hover effects and target-style graphics.",
  "frontend/src/components/ConnectivityIndicator.tsx": "Empty component file with no implementation yet.",
  "frontend/src/components/DecorativeBottomLine.tsx": "Renders a fixed bottom border line used as a decorative UI element.",
  "frontend/src/components/ExternalOpenFallbackDialog.tsx": "Dialog shown when a browser blocks opening a file externally, offering retry or download options.",
  "frontend/src/components/FilePreviewDialog.tsx": "Displays a file preview with actions such as open, download, move, and delete, supporting multiple file types.",
  "frontend/src/components/FileUploadSection.tsx": "Handles file uploads, link creation, and note creation with concurrency control and speech-to-text support.",
  "frontend/src/components/FoldersButton.tsx": "Floating button that opens the folders view, styled with a folder icon.",
  "frontend/src/components/FoldersDialog.tsx": "Deprecated folder management dialog allowing creation, renaming, deletion, and selection of folders.",
  "frontend/src/components/FoldersFullScreenView.tsx": "Full‑screen interface for managing and selecting folders with create, rename, and delete actions.",
  "frontend/src/components/Footer.tsx": "Simple footer showing © 2025 and a link to caffeine.ai.",
  "frontend/src/components/FullScreenViewer.tsx": "Full‑screen file viewer with navigation, share, delete, folder move, and external open fallback handling.",
  "frontend/src/components/GallerySection.tsx": "Displays files and notes within a folder, supporting selection, long‑press actions, previews, and external opening rules.",
  "frontend/src/components/Header.tsx": "Renders the app header with theme toggle, auth menu, and a progress bar.",
  "frontend/src/components/IntroScreen.tsx": "Shows a temporary animated splash screen that fades out after 2 seconds and triggers completion.",
  "frontend/src/components/LinkOpenFallbackDialog.tsx": "Dialog shown when a link cannot be opened, offering retry and copy‑to‑clipboard actions.",
  "frontend/src/components/LoginButton.tsx": "Button component that initiates Internet Identity login and shows loading state.",
  "frontend/src/components/MissionDetailFullScreenView.tsx": "Full‑screen mission view allowing task management, autosave, and viewing attached files and notes.",
  "frontend/src/components/MissionEditorDialog.tsx": "Dialog for creating missions with title entry and task list editing.",
  "frontend/src/components/MissionsButton.tsx": "Floating button that opens the missions view with animated styling.",
  "frontend/src/components/MissionsFullScreenView.tsx": "Full-screen missions list with swipe actions, mission grouping, creation, deletion, and navigation into mission details.",
  "frontend/src/components/MobileOnlyLayout.tsx": "Wrapper layout that displays children inside a mobile-only container.",
  "frontend/src/components/MoveToMissionDialog.tsx": "Dialog for moving selected files or notes into a mission, showing available missions and handling move operations.",
  "frontend/src/components/NotesButton.tsx": "Empty file.",
  "frontend/src/components/NotesDialog.tsx": "Empty file.",
  "frontend/src/components/NotesFullScreenView.tsx": "Empty file.",
  "frontend/src/components/NoteViewerDialog.tsx": "Dialog to view a single note with options to download, share, delete, or send it to a folder or mission.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Empty file.",
  "frontend/src/components/SendToFolderDialog.tsx": "Dialog for moving files or notes into folders or back to the main collection, with performance diagnostics.",
  "frontend/src/components/SwipeActionsRow.tsx": "Swipeable row component enabling edit and delete actions with gesture handling and animation.",
  "frontend/src/components/UnifiedProgressBar.tsx": "Fixed top bar showing unified upload progress and counts for active file, link, and note uploads.",
  "frontend/src/components/UploadQueueRunner.tsx": "Restores persisted upload items once the backend actor is ready and resumes their uploads with concurrency control and progress tracking.",
  "frontend/src/components/WelcomeIntroScreen.tsx": "Displays an introductory welcome screen with a target-style illustration and messaging plus a login button.",
  "frontend/src/contexts/ActorContext.tsx": "Manages backend actor initialization with retry logic, admin token handling, status tracking, and error classification.",
  "frontend/src/contexts/UploadContext.tsx": "Provides state and helpers for starting uploads, tracking progress, completing uploads, and restoring queued items.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the current identity and refreshes dependent queries when it updates.",
  "frontend/src/hooks/useHomePrefetch.ts": "Prefetches folders, files, missions, and notes once the actor becomes ready to speed up home page loading.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing identity loading, login, logout, and status tracking.",
  "frontend/src/hooks/useIntroOnAppResume.ts": "Triggers a callback when the app regains focus or visibility, but only after Internet Identity has initialized and the user is authenticated.",
  "frontend/src/hooks/useIsCoarsePointer.ts": "Detects whether the device uses a coarse pointer (e.g., touch) and updates on pointer type changes.",
  "frontend/src/hooks/useMissionAutosave.ts": "Automatically debounces and saves mission title and tasks, handling mission switches, pending saves, and mutation queuing.",
  "frontend/src/hooks/useMissionsQueries.ts": "Provides React Query hooks for listing, retrieving, creating, and updating missions using the backend actor with identity gating.",
  "frontend/src/hooks/useNotesQueries.ts": "Implements React Query hooks to fetch, create, and delete notes across folders and missions, with concurrency-limited creation.",
  "frontend/src/hooks/useQueries.ts": "Contains React Query hooks for files and folders, including fetching, folder creation, and upload-limited file operations.",
  "frontend/src/hooks/useSpeechToText.ts": "Custom React hook wrapping the Web Speech API for continuous speech recognition with interim and final transcripts and error handling.",
  "frontend/src/index.css": "Tailwind base styles plus extensive light/dark theme CSS variables and mobile layout rules.",
  "frontend/src/lib/utils.ts": "Utility function merging class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "App entry point setting up React Query, Internet Identity provider, and rendering the root app.",
  "frontend/src/pages/HomePage.tsx": "Main home page managing folder/mission views, data fetching, authentication state, and optional dev smoke tests.",
  "frontend/src/utils/actorInitializationMessaging.ts": "Helpers for classifying actor initialization errors and providing standardized error messages.",
  "frontend/src/utils/externalOpen.ts": "Utilities for external navigation, file downloading, note exporting, and Web Share API usage.",
  "frontend/src/utils/fileBytesWorkerSingleton.ts": "Singleton managing a worker for reading file bytes with concurrency control and request queuing.",
  "frontend/src/utils/fileOpenRules.ts": "Defines rules for determining how files open in the app and helper checks for viewer, download, and Office document behavior.",
  "frontend/src/utils/filePreview.ts": "Classifies files by MIME type, checks previewability, and provides human-readable type labels.",
  "frontend/src/utils/missionCompletion.ts": "Computes mission progress, determines mission completion, and splits missions into completed and incomplete groups.",
  "frontend/src/utils/missionTaskCompare.ts": "Provides a BigInt‑safe equality check for comparing arrays of tasks by ID, text, and completion state.",
  "frontend/src/utils/notesTime.ts": "Empty file with no implemented logic.",
  "frontend/src/utils/performanceDiagnostics.ts": "Implements an optional performance diagnostics system that logs operation timings and supports async timing helpers.",
  "frontend/src/utils/persistedUploadQueue.ts": "Manages a persisted upload queue in IndexedDB, storing file bytes, tracking progress, and updating completion status.",
  "frontend/src/utils/reactQueryDiagnostics.ts": "Logs React Query mutation phases during development to aid debugging.",
  "frontend/src/utils/smokeTestCoreFlows.ts": "Runs development-only smoke tests for core backend flows like creating folders, missions, links, and notes, and formats results.",
  "frontend/src/utils/uploadConcurrency.ts": "Provides concurrency limiters, including a cancellable version, for queued async tasks.",
  "frontend/src/utils/urlParams.ts": "Utility for reading, persisting, and clearing URL parameters, supporting both query strings and hash routing.",
  "frontend/src/workers/fileBytes.worker.ts": "Web worker that reads file bytes off the main thread and returns metadata or an error via postMessage. Transfers the ArrayBuffer for efficient data handling.",
  "frontend/tailwind.config.js": "Tailwind config extending theme colors, radius, animations, and enabling dark mode with custom plugins. Defines extensive OKLCH-based color variables for UI components.",
  "frontend/V114_BASELINE_FRONTEND_FILES.txt": "Lists all frontend files that define the v114 baseline for validation and drift detection.",
  "project_state.json": "Project state describing the requirement to add an 'All files' bulk-select option in the Gallery and supporting undo behavior. Contains metadata, existing features, and pending requests."
}