{
  "backend/main.mo": "Motoko canister defining file, folder, user profile, and mission data models with related CRUD operations and access control.",
  "feature_evidence.json": "Feature evidence report describing required UI icon replacement and listing affected files and components.",
  "frontend-file-summaries.txt": "Reference file providing short summaries for various frontend components and utilities.",
  "frontend/DRAFT_BASELINE_V114.md": "Documentation of the creation and validation of a draft baseline matching Live version 114 exactly.",
  "frontend/index.css": "Tailwind base layers defining extensive CSS variables for light and dark themes.",
  "frontend/index.html": "Main HTML entry with PWA meta tags, icons, and root mount point loading the frontend app.",
  "frontend/PAUSE_AFTER_RESTORE.md": "Post‑restoration change‑freeze notice restricting modifications until explicit user approval.",
  "frontend/public/manifest.json": "PWA manifest specifying app metadata, icons, theme, and startup configuration.",
  "frontend/public/sw.js": "Service worker implementing minimal precaching, runtime caching, and network-first fetch handling.",
  "frontend/RESTORE_LIVE_V114_CHECKLIST.md": "Checklist confirming full restoration of frontend behavior and structure to Live version 114.",
  "frontend/src/App.tsx": "Root React app configuring themes and providers, showing an intro screen after successful login.",
  "frontend/src/components/ActorInitErrorState.tsx": "Error UI component displaying classified actor initialization errors with retry and logout actions.",
  "frontend/src/components/AnimatedGalleryIcon.tsx": "SVG-based animated gallery icon with hover effects.",
  "frontend/src/components/ConnectivityIndicator.tsx": "Empty component file with no implementation.",
  "frontend/src/components/DecorativeBottomLine.tsx": "Renders a fixed decorative horizontal line near the bottom of the viewport.",
  "frontend/src/components/ExternalOpenFallbackDialog.tsx": "Dialog prompting users to retry opening or download a file when a browser blocks external window opens.",
  "frontend/src/components/FilePreviewDialog.tsx": "Provides a dialog to preview files of various types and perform actions like open, download, move, and delete.",
  "frontend/src/components/FileUploadSection.tsx": "Handles file uploads and adding external links with progress tracking and validation.",
  "frontend/src/components/FoldersButton.tsx": "Displays a floating button to open the folders interface.",
  "frontend/src/components/FoldersDialog.tsx": "Dialog for listing, creating, renaming, and deleting folders, with swipe actions and validation.",
  "frontend/src/components/Footer.tsx": "Renders a simple footer with attribution and external link.",
  "frontend/src/components/FullScreenViewer.tsx": "Full-screen viewer for navigating, sharing, downloading, and organizing files with gesture support.",
  "frontend/src/components/GallerySection.tsx": "Displays a grid of files with selection, long-press actions, navigation, and integration with viewer and folder dialogs.",
  "frontend/src/components/Header.tsx": "Header component with theme toggle, auth dropdown, app title, and progress bar.",
  "frontend/src/components/IntroScreen.tsx": "Intro splash screen that animates a logo and triggers a completion callback after timed transitions.",
  "frontend/src/components/LinkOpenFallbackDialog.tsx": "Dialog shown when a browser blocks opening a link, offering retry and copy-to-clipboard options.",
  "frontend/src/components/LoginButton.tsx": "Button that triggers Internet Identity login and shows loading state during authentication.",
  "frontend/src/components/MissionDetailFullScreenView.tsx": "Full‑screen mission editor displaying mission data, tasks, attachments, and save/delete actions with file and link viewers.",
  "frontend/src/components/MissionEditorDialog.tsx": "Dialog for creating a new mission with title and task management before submission.",
  "frontend/src/components/MissionsButton.tsx": "Floating action button that opens the missions interface with animated target icon.",
  "frontend/src/components/MissionsFullScreenView.tsx": "Full‑screen mission list view with creation, deletion, selection, progress display, and swipe actions.",
  "frontend/src/components/MissionTargetIcon.tsx": "Small wrapper component rendering a styled Target icon.",
  "frontend/src/components/MoveToMissionDialog.tsx": "Dialog for listing missions and moving selected file IDs to a chosen mission with loading and error handling.",
  "frontend/src/components/NotesButton.tsx": "Empty file.",
  "frontend/src/components/NotesDialog.tsx": "Empty file.",
  "frontend/src/components/NotesFullScreenView.tsx": "Empty file.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Empty file.",
  "frontend/src/components/SendToFolderDialog.tsx": "Dialog for moving files into folders or back to the main collection, showing folder list and handling mutations.",
  "frontend/src/components/SwipeActionsRow.tsx": "Component enabling horizontal swipe gestures to reveal edit/delete actions with pointer event handling.",
  "frontend/src/components/UnifiedProgressBar.tsx": "Global upload progress bar showing total progress and file count during ongoing uploads.",
  "frontend/src/components/WelcomeIntroScreen.tsx": "Intro screen presenting app purpose and sign‑in prompt with a mission-themed visual layout.",
  "frontend/src/contexts/ActorContext.tsx": "Provides actor initialization, retry logic, and error handling for backend access tied to Internet Identity.",
  "frontend/src/contexts/UploadContext.tsx": "Context managing upload batches, per-file progress, and aggregated upload state.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and caches an actor based on identity, initializing access control and invalidating related queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for managing Internet Identity auth, including login, logout, and initializing stored identities.",
  "frontend/src/hooks/useIsCoarsePointer.ts": "Detects whether the device uses a coarse pointer (touch) and updates reactively.",
  "frontend/src/hooks/useMissionsQueries.ts": "React Query hooks for listing, fetching, creating, and updating missions via the backend actor.",
  "frontend/src/hooks/useNotesQueries.ts": "Empty placeholder file for future note-related React Query hooks.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching and mutating files and folders, using the backend actor and Internet Identity.",
  "frontend/src/index.css": "Tailwind CSS setup defining light/dark themes, color tokens, and touch interaction optimizations.",
  "frontend/src/lib/utils.ts": "Utility function to merge Tailwind class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Application entry point initializing React, React Query, and Internet Identity provider.",
  "frontend/src/pages/HomePage.tsx": "Main page composing UI sections, running smoke tests in dev, and orchestrating data fetching based on auth and actor state.",
  "frontend/src/utils/actorInitializationMessaging.ts": "Defines user-facing actor initialization messages and utilities for classifying backend/actor errors.",
  "frontend/src/utils/externalOpen.ts": "Provides helpers for opening external URLs and downloading files via browser APIs.",
  "frontend/src/utils/fileOpenRules.ts": "Determines how files should open based on MIME type, including viewer, office preview, or download behavior.",
  "frontend/src/utils/filePreview.ts": "Categorizes files by MIME type and provides previewability checks and human-readable labels.",
  "frontend/src/utils/notesTime.ts": "Empty placeholder file with no implemented logic.",
  "frontend/src/utils/reactQueryDiagnostics.ts": "Offers diagnostics for React Query cache states and logs mutation lifecycle details for missions.",
  "frontend/src/utils/smokeTestCoreFlows.ts": "Runs backend smoke tests covering folder creation, mission creation, file upload, and listing verification.",
  "frontend/src/utils/urlParams.ts": "Handles reading, persisting, and clearing URL and session parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, radii, animations, and enabling custom plugins.",
  "frontend/V114_BASELINE_FRONTEND_FILES.txt": "Canonical list of all frontend files defining the official Live v114 baseline.",
  "project_state.json": "Metadata describing project state, features, and pending requests for the mission icon update."
}