{
  "backend/main.mo": "Main Motoko canister implementing storage-backed file management, folders, user profiles, notes, and missions with access control, authorization mixins, and cycle diagnostics.",
  "feature_evidence.json": "Structured report mapping implemented frontend features to files, components, test IDs, and confidence levels, primarily covering actor initialization, cold-start retry behavior, and error handling.",
  "frontend-file-summaries.txt": "Prewritten high-level summaries of all major frontend source files describing responsibilities, UI behavior, and recent fixes, used as a reference overview.",
  "frontend/DRAFT_BASELINE_V114.md": "Documentation describing creation of a new Draft perfectly synced 1:1 with Live frontend version 114, including validation steps and enforced change control.",
  "frontend/index.css": "Tailwind CSS entry file defining base, component, and utility layers plus extensive CSS variables for light/dark themes, colors, radius, and layout tokens.",
  "frontend/index.html": "Main HTML entry for the MyGallery frontend with PWA meta tags, icons, manifest link, and mounting point for the React app.",
  "frontend/PAUSE_AFTER_RESTORE.md": "Change-freeze notice establishing a strict no-modification policy after restoring Live version 114, outlining prohibited changes and required user approval process.",
  "frontend/public/manifest.json": "PWA manifest describing the MyGallery app metadata, theme colors, display mode, scope, categories, and app icons.",
  "frontend/public/sw.js": "Service worker implementing a minimal, network-first caching strategy for fast startup, runtime caching, and cache cleanup.",
  "frontend/RESTORE_LIVE_V114_CHECKLIST.md": "Detailed checklist verifying that all frontend files, behaviors, and UI elements exactly match Live version 114 after restoration.",
  "frontend/src/App.tsx": "Root React component wiring theme support, actor and upload contexts, authentication flow, and conditional intro screen before rendering the home page.",
  "frontend/src/components/ActorInitErrorState.tsx": "UI component that displays detailed error states when backend actor initialization fails, with retry, logout, and expandable technical details.",
  "frontend/src/components/AnimatedGalleryIcon.tsx": "Reusable animated SVG gallery/camera icon with hover effects and Tailwind-based transitions.",
  "frontend/src/components/DecorativeBottomLine.tsx": "Simple decorative fixed bottom border line used as a visual separator in the UI.",
  "frontend/src/components/ExternalOpenFallbackDialog.tsx": "Dialog shown when a browser blocks opening a file externally, offering retry and download options.",
  "frontend/src/components/FilePreviewDialog.tsx": "Dialog for previewing files (images, video, PDF, Office) with actions to open, download, move, or delete files, including confirmation handling.",
  "frontend/src/components/FileUploadSection.tsx": "Provides a drag-and-drop and click-to-upload file input that uploads multiple files, tracks progress via context, and shows success/error toasts when the backend actor is ready.",
  "frontend/src/components/FoldersButton.tsx": "Renders a fixed-position floating button with a folder icon that triggers an onClick callback to open folder-related UI.",
  "frontend/src/components/FoldersDialog.tsx": "Implements a dialog for listing, creating, renaming, selecting, and deleting folders using backend queries, with validation, loading states, and toast feedback.",
  "frontend/src/components/Footer.tsx": "Displays a simple footer with copyright text, a heart icon, and a link crediting caffeine.ai.",
  "frontend/src/components/FullScreenViewer.tsx": "Shows files in a fullscreen dialog with swipe and button navigation, allowing download, delete, share, external open, and sending files to folders.",
  "frontend/src/components/GallerySection.tsx": "Renders the main file gallery with folder-based views, selectable file cards, long-press and touch handling, batch actions, and integration with the fullscreen viewer.",
  "frontend/src/components/Header.tsx": "Provides the top application header with branding, theme toggle, authentication menu (sign out), and a unified upload progress bar.",
  "frontend/src/components/IntroScreen.tsx": "Displays an animated welcome screen with a timed logo animation before transitioning into the main application.",
  "frontend/src/components/LoginButton.tsx": "Renders a login button for Internet Identity authentication, showing a loading spinner and disabled state during sign-in.",
  "frontend/src/components/MissionDetailFullScreenView.tsx": "Full-screen mission detail editor that loads a mission, allows editing the title and tasks, tracks unsaved changes, shows progress, and supports saving or deleting the mission via backend hooks.",
  "frontend/src/components/MissionEditorDialog.tsx": "Dialog for creating a new mission with a title and task list, handling task add/remove/toggle and submitting creation via backend mutation.",
  "frontend/src/components/MissionsButton.tsx": "Floating action button that triggers opening the Missions UI, styled with a target icon and hover animations.",
  "frontend/src/components/MissionsFullScreenView.tsx": "Full-screen missions hub that lists missions with progress, supports creating and deleting missions, and routes into the mission detail full-screen view.",
  "frontend/src/components/NotesButton.tsx": "Floating action button that opens the Notes UI, rendered with a notes icon and accent styling.",
  "frontend/src/components/NotesDialog.tsx": "Empty or placeholder file with no implemented content.",
  "frontend/src/components/NotesFullScreenView.tsx": "Full-screen notes manager that lists notes, supports creating, selecting, editing, saving, and deleting notes, with responsive mobile editor behavior.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Empty or placeholder file intended for a profile setup dialog but currently contains no implementation.",
  "frontend/src/components/SendToFolderDialog.tsx": "Dialog that lets users move selected files into a folder or return them to the main collection using folder-related backend mutations.",
  "frontend/src/components/UnifiedProgressBar.tsx": "Global upload progress bar that displays total upload progress and file count based on the upload context.",
  "frontend/src/contexts/ActorContext.tsx": "Provides a React context that initializes and manages a backend actor tied to Internet Identity, including retry logic, status tracking, error classification, and sign-out handling.",
  "frontend/src/contexts/UploadContext.tsx": "Defines a React context to track batched file uploads, per-file progress, total progress, and upload lifecycle helpers.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and caches a backend actor based on the current Internet Identity, handling anonymous access and invalidating dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity authentication context and hook, managing login, logout, persisted identities, and detailed login status flags via DFINITY AuthClient.",
  "frontend/src/hooks/useMissionsQueries.ts": "Collection of React Query hooks for listing, fetching, creating, updating, and deleting missions using the backend actor, with cache invalidation and readiness checks.",
  "frontend/src/hooks/useNotesQueries.ts": "Collection of React Query hooks for CRUD operations on notes via the backend actor, including sorting, cache invalidation, and legacy compatibility exports.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching files and folders and mutating folder state (create/rename) via the backend actor. Includes query enabling based on actor readiness and optimistic updates with error handling.",
  "frontend/src/index.css": "Global Tailwind CSS setup defining extensive CSS variables for light/dark themes, sidebar, charts, and feature-specific color schemes. Also applies base styles, transitions, and touch interaction optimizations.",
  "frontend/src/lib/utils.ts": "Provides a utility function to merge conditional class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Application entry point that renders the React app and wires up React Query and Internet Identity providers. Imports global styles and mounts the root component.",
  "frontend/src/pages/HomePage.tsx": "Implements the main landing page with authentication-aware UI, data prefetching, and conditional rendering for login, loading, error, and main gallery states. Manages dialogs and full-screen views for folders, notes, and missions.",
  "frontend/src/utils/actorInitializationMessaging.ts": "Centralizes detection, classification, and user-facing messaging for backend actor initialization errors. Provides helpers to identify transient canister issues, authorization problems, and retryable states.",
  "frontend/src/utils/externalOpen.ts": "Utilities for opening URLs in a new browser tab and downloading files via fetch and blob URLs, with basic error handling.",
  "frontend/src/utils/fileOpenRules.ts": "Defines rules for how different file types should be opened (in-app viewer, office preview, or direct download) based on MIME type. Exposes helper predicates for viewer and download behavior.",
  "frontend/src/utils/filePreview.ts": "Categorizes files by MIME type and determines preview eligibility in the app. Also provides human-readable file type labels for UI display.",
  "frontend/src/utils/notesTime.ts": "Formats a Date into a relative, human-friendly timestamp string for notes (e.g., just now, minutes ago, or calendar date).",
  "frontend/src/utils/urlParams.ts": "Provides utilities to read URL parameters from query strings or hash-based routes, persist them in sessionStorage, and retrieve or clear them with URL values taking precedence. Includes helpers to safely store, retrieve, and remove sensitive parameters and to clean them from the URL hash without page reload.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration enabling class-based dark mode, defining content paths, and extending the theme with CSS-variable-driven colors, radii, animations, and keyframes. Includes plugins for animations and typography and custom color namespaces for app sections like sidebar, notes, and missions.",
  "frontend/V114_BASELINE_FRONTEND_FILES.txt": "Canonical list of all frontend files that define the Live version 114 baseline, used to detect drift and validate 1:1 parity.",
  "project_state.json": "Machine-readable snapshot of the project’s overall state, describing MyGallery’s architecture, tech stack, and feature set with versioned feature definitions. Acts as a planning and documentation artifact for existing capabilities, authentication, theming, PWA behavior, and backend integration."
}