{
  "backend/main.mo": "Defines the main actor with file, folder, note, mission, upload tracking, and authorization logic, initializing various maps and counters for application state.",
  "backend/migration.mo": "Provides migration types and a no-op run function that returns the old actor state unchanged.",
  "feature_evidence.json": "Lists feature evidence entries mapping features to related frontend files, components, tests, and metadata.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of multiple frontend source files describing their roles and behaviors.",
  "frontend/DRAFT_BASELINE_V114.md": "Documentation describing the creation and validation of a Draft baseline synced 1:1 with Live version 114.",
  "frontend/index.css": "Defines global Tailwind layers and OKLCH-based light/dark theme variables.",
  "frontend/index.html": "Main HTML entry with PWA metadata, icons, and service worker registration.",
  "frontend/PAUSE_AFTER_RESTORE.md": "Explains a post-restore change freeze policy requiring explicit user approval before modifying the baseline.",
  "frontend/public/manifest.json": "PWA manifest specifying app metadata, icons, colors, and capabilities.",
  "frontend/public/sw.js": "Service worker implementing minimal precaching, runtime caching, and update handling.",
  "frontend/PWA_INSTALLABILITY_NOTES.md": "Provides a checklist and troubleshooting guide for verifying PWA installability on Chrome for Android.",
  "frontend/RESTORE_LIVE_V114_CHECKLIST.md": "Checklist documenting verification steps to restore the frontend to the exact Live v114 state.",
  "frontend/src/App.tsx": "Root React app wiring providers, intro logic, homepage rendering, and upload queue runner.",
  "frontend/src/components/ActorInitErrorState.tsx": "UI component showing actor initialization errors with retry, sign‑out, and technical details.",
  "frontend/src/components/AnimatedGalleryIcon.tsx": "Renders an animated SVG target-style gallery icon with hover effects.",
  "frontend/src/components/ConnectivityIndicator.tsx": "Empty component file with no implemented content.",
  "frontend/src/components/DecorativeBottomLine.tsx": "Displays a fixed bottom horizontal line used as a decorative UI element.",
  "frontend/src/components/ExternalOpenFallbackDialog.tsx": "Dialog prompting users to retry opening or download a file when the browser blocks external file opening.",
  "frontend/src/components/FilePreviewDialog.tsx": "Dialog that previews files by type, provides actions like open, download, move, and delete, and manages related confirmations.",
  "frontend/src/components/FileUploadSection.tsx": "Handles file, link, and note uploads including Web Worker processing, speech-to-text input, and progress tracking.",
  "frontend/src/components/FoldersButton.tsx": "Floating button that opens folders view, showing a folder icon and label.",
  "frontend/src/components/FoldersDialog.tsx": "Deprecated folder management dialog supporting creation, renaming, deletion, and selection of folders.",
  "frontend/src/components/FoldersFullScreenView.tsx": "Fullscreen folder manager enabling creation, renaming, deletion, and selection of folders.",
  "frontend/src/components/Footer.tsx": "Displays a footer with copyright text and a link to caffeine.ai.",
  "frontend/src/components/FullScreenViewer.tsx": "Provides a full-screen viewer for files with swipe navigation, download, delete, share, and folder/mission actions.",
  "frontend/src/components/GallerySection.tsx": "Displays files and notes in a gallery with selection, previews, and bulk actions, and opens items in viewers.",
  "frontend/src/components/Header.tsx": "Renders the app header with theme toggle, auth menu, title, and a unified progress bar.",
  "frontend/src/components/IntroScreen.tsx": "Shows a timed splash intro animation that fades out and signals completion.",
  "frontend/src/components/LinkOpenFallbackDialog.tsx": "Modal shown when external links fail to open, allowing retry or copy to clipboard.",
  "frontend/src/components/LoginButton.tsx": "Button to sign in via Internet Identity with loading feedback.",
  "frontend/src/components/MissionDetailFullScreenView.tsx": "Full-screen mission view for editing title, tasks, and viewing attached files/notes with autosave.",
  "frontend/src/components/MissionEditorDialog.tsx": "Dialog for creating missions with title input and task list management.",
  "frontend/src/components/MissionsButton.tsx": "Renders a floating missions button with hover animations and optional disabled/overlay states.",
  "frontend/src/components/MissionsFullScreenView.tsx": "Provides a full‑screen missions list with swipe navigation, mission CRUD actions, and detail/creation views.",
  "frontend/src/components/MobileOnlyLayout.tsx": "Wraps children in a mobile‑only container layout.",
  "frontend/src/components/MoveToMissionDialog.tsx": "Dialog for moving selected files or notes into a mission, showing missions and handling move operations.",
  "frontend/src/components/NotesButton.tsx": "Empty placeholder file.",
  "frontend/src/components/NotesDialog.tsx": "Empty placeholder file.",
  "frontend/src/components/NotesFullScreenView.tsx": "Empty placeholder file.",
  "frontend/src/components/NoteViewerDialog.tsx": "Displays a full note view with actions for sending, downloading, sharing, and deleting the note.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Empty placeholder file.",
  "frontend/src/components/SendToFolderDialog.tsx": "Dialog for moving or returning files and notes to folders, with performance diagnostics and batch operations.",
  "frontend/src/components/SwipeActionsRow.tsx": "Provides swipeable row behavior exposing edit and delete actions with gesture handling.",
  "frontend/src/components/UnifiedProgressBar.tsx": "Shows an upload progress bar summarizing active uploads and overall progress.",
  "frontend/src/components/UploadQueueRunner.tsx": "Restores pending uploads on startup and resumes them with progress tracking and concurrency limiting.",
  "frontend/src/components/WelcomeIntroScreen.tsx": "Displays the app’s introductory landing screen with an illustrated target icon and login button.",
  "frontend/src/contexts/ActorContext.tsx": "Manages creation and lifecycle of the backend actor with retry logic, error mapping, and identity handling.",
  "frontend/src/contexts/UploadContext.tsx": "Provides upload state management, batching, and progress updates with throttled rendering.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor via React Query, reinitializing when identity changes.",
  "frontend/src/hooks/useHomePrefetch.ts": "Prefetches core home-screen data once the backend actor is ready to speed up initial loading.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing identity loading, login, logout, and status flags.",
  "frontend/src/hooks/useIntroOnAppResume.ts": "Runs a callback when the app regains focus or visibility, but only after identity initialization and authentication.",
  "frontend/src/hooks/useIsCoarsePointer.ts": "Detects whether the device uses a coarse pointer such as touch, updating on input changes.",
  "frontend/src/hooks/useMissionAutosave.ts": "Implements debounced mission autosave with mutation queuing, mission-change resets, and change detection against hydrated state.",
  "frontend/src/hooks/useMissionsQueries.ts": "Defines React Query hooks for listing, fetching, creating, and updating missions with actor readiness checks and targeted cache invalidation.",
  "frontend/src/hooks/useNotesQueries.ts": "Provides React Query hooks for fetching notes by folder or mission and creating notes with concurrency limiting and selective cache invalidation.",
  "frontend/src/hooks/useQueries.ts": "Contains React Query hooks for file and folder operations, including paginated fetching, creation, and upload-concurrency control.",
  "frontend/src/hooks/useSpeechToText.ts": "React hook wrapping browser SpeechRecognition with streaming transcripts, error handling, and lifecycle management.",
  "frontend/src/index.css": "Tailwind base styles plus extensive CSS variable themes for light/dark modes and component color tokens.",
  "frontend/src/lib/utils.ts": "Utility function combining clsx and tailwind-merge to merge class names safely.",
  "frontend/src/main.tsx": "Application entry point initializing React, React Query, Internet Identity provider, and global styles.",
  "frontend/src/pages/HomePage.tsx": "Home page component managing authentication state, data fetching, lazy-loaded views, and optional dev smoke tests.",
  "frontend/src/utils/actorInitializationMessaging.ts": "Helpers for classifying actor initialization errors and producing standardized user-facing messages.",
  "frontend/src/utils/externalOpen.ts": "Utilities for opening external URLs, downloading files or notes, and sharing content via Web Share API.",
  "frontend/src/utils/fileOpenRules.ts": "Logic for determining how to open files based on MIME type, including viewer, preview, or download-only rules.",
  "frontend/src/utils/filePreview.ts": "Provides helpers to categorize files by MIME type, determine previewability, and return human-readable file labels.",
  "frontend/src/utils/missionCompletion.ts": "Calculates mission progress, determines completion status, and splits missions into completed and incomplete groups.",
  "frontend/src/utils/missionTaskCompare.ts": "Compares two Task arrays safely with BigInt IDs by checking length and field equality.",
  "frontend/src/utils/notesTime.ts": "Empty placeholder file with no implemented logic.",
  "frontend/src/utils/performanceDiagnostics.ts": "Implements an optional performance diagnostics tool with timing, logging, and async operation helpers.",
  "frontend/src/utils/persistedUploadQueue.ts": "Manages a persisted IndexedDB-backed upload queue, allowing enqueueing, progress updates, removal, and retrieval of upload items.",
  "frontend/src/utils/reactQueryDiagnostics.ts": "Logs React Query mutation lifecycle events during development for debugging.",
  "frontend/src/utils/smokeTestCoreFlows.ts": "Runs development-only smoke tests for key backend flows and formats results for display.",
  "frontend/src/utils/uploadConcurrency.ts": "Creates a concurrency limiter that queues tasks and ensures no more than a set number run simultaneously.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading, storing, persisting, and clearing URL and session parameters, including hash-based routing support.",
  "frontend/src/workers/fileBytes.worker.ts": "Web Worker that reads file bytes off the main thread and returns them or an error response.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom radius, color tokens, animations, and plugins for typography and animations.",
  "frontend/V114_BASELINE_FRONTEND_FILES.txt": "Canonical list of all frontend files that define the v114 baseline for drift detection.",
  "project_state.json": "Defines project state, goals, and feature requirements for improving background multi-file uploads, progress accuracy, and speed."
}