{
  "backend/main.mo": "Primary backend canister defining file, folder, mission, profile management, authorization mixins, and diagnostic endpoints with in‑memory maps and counters.",
  "backend/migration.mo": "Migration module converting old persistent mission data structures into the new format by mapping missions and tasks.",
  "feature_evidence.json": "Feature evidence report linking mission-related frontend files to specific requirements and confidence assessments.",
  "frontend-file-summaries.txt": "Prewritten summaries of numerous frontend files describing their roles in UI, hooks, dialogs, and utilities.",
  "frontend/DRAFT_BASELINE_V114.md": "Documentation establishing a frozen baseline identical to Live v114, outlining validation steps and change‑control rules.",
  "frontend/index.css": "Defines Tailwind base layers and CSS variables for light/dark themes with global styling.",
  "frontend/index.html": "Primary HTML entrypoint setting up PWA metadata, icons, and loading the React app.",
  "frontend/PAUSE_AFTER_RESTORE.md": "Change‑control notice declaring a post‑restore freeze and restrictions until explicit user approval.",
  "frontend/public/manifest.json": "PWA manifest defining app metadata, icons, display mode, and startup configuration.",
  "frontend/public/sw.js": "Service worker implementing minimal precaching, network-first fetch logic, and cache cleanup.",
  "frontend/RESTORE_LIVE_V114_CHECKLIST.md": "Checklist verifying frontend restoration to Live v114, covering authentication, UI components, styling, and utilities.",
  "frontend/src/App.tsx": "Main React app wrapper handling theme, providers, and conditional intro display based on authentication.",
  "frontend/src/components/ActorInitErrorState.tsx": "UI component showing error states during actor initialization with retry, logout, and technical details.",
  "frontend/src/components/AnimatedGalleryIcon.tsx": "SVG-based animated gallery icon with hover effects and layered visual elements.",
  "frontend/src/components/ConnectivityIndicator.tsx": "Empty file placeholder for a connectivity status component.",
  "frontend/src/components/DecorativeBottomLine.tsx": "Renders a fixed decorative bottom line for UI styling.",
  "frontend/src/components/ExternalOpenFallbackDialog.tsx": "Dialog shown when a file cannot be opened in a new tab, offering retry and download options.",
  "frontend/src/components/FilePreviewDialog.tsx": "Displays a dialog with file preview, metadata, and actions like open, download, move, and delete.",
  "frontend/src/components/FileUploadSection.tsx": "Handles file and link uploads with progress tracking, validation, and backend mutations.",
  "frontend/src/components/FoldersButton.tsx": "Floating button that opens the folders view, with optional overlay and disabled states.",
  "frontend/src/components/FoldersDialog.tsx": "Deprecated folders management dialog supporting create, rename, delete, and selection of folders.",
  "frontend/src/components/FoldersFullScreenView.tsx": "Full‑screen UI for listing, creating, renaming, deleting, and selecting folders.",
  "frontend/src/components/Footer.tsx": "Simple footer showing copyright and a link to caffeine.ai.",
  "frontend/src/components/FullScreenViewer.tsx": "Full‑screen file viewer with swipe navigation, external open, download, delete, share, and folder actions.",
  "frontend/src/components/GallerySection.tsx": "Displays files in a gallery with touch gestures, selection mode, long‑press handling, and file opening logic including viewer, download, and link fallback dialogs.",
  "frontend/src/components/Header.tsx": "Renders the top navigation bar with theme toggle, authentication menu, and a global progress bar.",
  "frontend/src/components/IntroScreen.tsx": "Shows a timed animated splash screen that fades out before calling a completion callback.",
  "frontend/src/components/LinkOpenFallbackDialog.tsx": "Provides a dialog for when external link opening fails, offering retry and copy‑link actions.",
  "frontend/src/components/LoginButton.tsx": "A button that triggers Internet Identity login and shows a spinner while logging in.",
  "frontend/src/components/MissionDetailFullScreenView.tsx": "Full‑screen mission editor displaying mission data, tasks, autosave behavior, and attached file viewing with link fallback support.",
  "frontend/src/components/MissionEditorDialog.tsx": "Dialog for creating missions with title input, task list editing, and submit handling through backend APIs.",
  "frontend/src/components/MissionsButton.tsx": "Floating action button that opens the missions section, with animated icon and disabled state handling.",
  "frontend/src/components/MissionsFullScreenView.tsx": "Full-screen mission list UI supporting creation, selection, swipe actions, progress display, and mission deletion with animations.",
  "frontend/src/components/MobileOnlyLayout.tsx": "Container component that restricts its children to a mobile-only layout wrapper.",
  "frontend/src/components/MoveToMissionDialog.tsx": "Dialog for selecting a mission and moving files into it, showing mission list and handling mutation state.",
  "frontend/src/components/NotesButton.tsx": "Empty file.",
  "frontend/src/components/NotesDialog.tsx": "Empty file.",
  "frontend/src/components/NotesFullScreenView.tsx": "Empty file.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Empty file.",
  "frontend/src/components/SendToFolderDialog.tsx": "Dialog for moving files to folders or back to the main collection, with mutation handling and folder list UI.",
  "frontend/src/components/SwipeActionsRow.tsx": "Reusable row component enabling swipe-to-reveal edit and delete actions with pointer gesture handling.",
  "frontend/src/components/UnifiedProgressBar.tsx": "Global upload progress bar showing overall progress and item count when uploads are active.",
  "frontend/src/components/WelcomeIntroScreen.tsx": "Intro screen with branding graphics and a login button for first-time users.",
  "frontend/src/contexts/ActorContext.tsx": "Provides a context managing backend actor initialization with retries, admin-token setup, and error classification.",
  "frontend/src/contexts/UploadContext.tsx": "Tracks file and link upload batches, aggregates progress, and updates progress efficiently using animation-frame batching.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the current identity using React Query, initializing access control when needed.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity login, logout, and identity state management using Dfinity’s AuthClient.",
  "frontend/src/hooks/useIsCoarsePointer.ts": "Detects whether the device uses a coarse pointer to distinguish touch from mouse input.",
  "frontend/src/hooks/useMissionAutosave.ts": "Autosaves mission title and tasks with debouncing, deep-change detection, and queued saves during in‑flight updates.",
  "frontend/src/hooks/useMissionsQueries.ts": "Implements React Query hooks for listing, retrieving, creating, and updating missions using the backend actor.",
  "frontend/src/hooks/useNotesQueries.ts": "File is empty or missing content.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating files and folders via a backend actor with caching and concurrency controls.",
  "frontend/src/index.css": "Defines Tailwind CSS layers and theme variables for light and dark modes, plus global and mobile layout styles.",
  "frontend/src/lib/utils.ts": "Provides a helper function to merge Tailwind class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it in React Query and Internet Identity providers.",
  "frontend/src/pages/HomePage.tsx": "Implements the main home page, handling authentication state, data fetching, smoke tests, and UI section toggling.",
  "frontend/src/utils/actorInitializationMessaging.ts": "Defines standardized actor initialization error messages and helpers to classify backend actor errors.",
  "frontend/src/utils/externalOpen.ts": "Provides utilities for opening external URLs with popup‑block detection and downloading files via blobs.",
  "frontend/src/utils/fileOpenRules.ts": "Determines how files should open (viewer, office preview, or download) based on MIME type.",
  "frontend/src/utils/filePreview.ts": "Categorizes files by MIME type and provides helpers for determining preview capability and readable labels.",
  "frontend/src/utils/missionTaskCompare.ts": "Compares arrays of mission tasks safely with BigInt support to detect equality.",
  "frontend/src/utils/notesTime.ts": "Empty placeholder file with no implemented logic.",
  "frontend/src/utils/performanceDiagnostics.ts": "Provides optional performance timing utilities with start/end logging and an async wrapper, enabled via URL or localStorage.",
  "frontend/src/utils/reactQueryDiagnostics.ts": "Adds helpers to inspect React Query mission cache state and log delete mutation lifecycle details.",
  "frontend/src/utils/smokeTestCoreFlows.ts": "Runs a backend smoke test covering folder creation, mission creation, file upload, and list verification steps.",
  "frontend/src/utils/uploadConcurrency.ts": "Implements a simple promise-based concurrency limiter with a queue and max parallel execution setting.",
  "frontend/src/utils/urlParams.ts": "Utility for reading, persisting, and clearing URL parameters using query strings, hash routes, and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, radius, animations, and enabling plugins and dark mode.",
  "frontend/V114_BASELINE_FRONTEND_FILES.txt": "Lists all frontend files defining the v114 baseline for verification and drift detection.",
  "project_state.json": "Project metadata describing mission-related bugs, scope limits, existing requirements, and pending feature requests."
}