{
  "backend/main.mo": "Main backend actor implementing file storage, folder management, mission tracking, notes, and user profiles with authorization, upload tracking, and diagnostic endpoints.",
  "feature_evidence.json": "Feature evidence report documenting the positioning of the MissionsButton component next to the FoldersButton component with appropriate spacing.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend components, hooks, utilities, and pages describing their functionality, state management, and UI behavior.",
  "frontend/DRAFT_BASELINE_V114.md": "Documentation of Draft baseline creation synced 1:1 with Live version 114, including verification steps, validation results, and change control policy with core flows smoke test instructions.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for UI elements (background, foreground, primary, secondary, muted, accent, destructive, borders, charts, sidebar) using oklch color space.",
  "frontend/index.html": "Main HTML entry point with PWA configuration (manifest, icons, meta tags for iOS and mobile), service worker registration script with update handling, and root div for React mounting.",
  "frontend/PAUSE_AFTER_RESTORE.md": "Change control freeze notice prohibiting all code changes until explicit user approval, establishing clean baseline and requiring documented change list for any modifications.",
  "frontend/public/manifest.json": "PWA manifest defining app metadata (name: MYL, theme colors, icons, display mode standalone) for installability on mobile devices and desktop.",
  "frontend/public/sw.js": "Service worker implementing network-first caching strategy with offline fallback, runtime cache trimming (max 50 entries, 7-day age limit), and precaching of essential assets for PWA functionality.",
  "frontend/PWA_INSTALLABILITY_NOTES.md": "Comprehensive PWA installability verification guide for Chrome on Android, including DevTools checks, testing steps, common issues, and troubleshooting solutions.",
  "frontend/RESTORE_LIVE_V114_CHECKLIST.md": "Detailed restoration checklist verifying all core application files, authentication flows, UI components, gallery features, styling, and behavior match Live version 114 exactly.",
  "frontend/src/App.tsx": "Root React component wrapping the app with providers (Theme, QueryClient, Actor, Upload), rendering HomePage with IntroScreen on app resume and UploadQueueRunner for background uploads.",
  "frontend/src/components/ActorInitErrorState.tsx": "Error UI component displaying actor initialization failures with classification-based messaging (stopped canister, invalid admin token), collapsible technical details, and retry/logout actions.",
  "frontend/src/components/AnimatedGalleryIcon.tsx": "SVG-based bullseye/target icon component with concentric rings, crosshairs, corner markers, hover animations (pulse, color transitions), and glow effect for gallery/missions UI.",
  "frontend/src/components/ConnectivityIndicator.tsx": "Empty component file (no content provided).",
  "frontend/src/components/DecorativeBottomLine.tsx": "Fixed-position horizontal decorative line component rendered at bottom of viewport (above bottom navigation) with theme-aware border styling.",
  "frontend/src/components/ExternalOpenFallbackDialog.tsx": "A dialog component that appears when the browser blocks opening a file in a new window, offering options to retry opening or download the file.",
  "frontend/src/components/FilePreviewDialog.tsx": "A dialog component that displays file previews (images, videos, PDFs, Office docs) with metadata and action buttons for downloading, opening externally, moving to folders/missions, and deleting files.",
  "frontend/src/components/FileUploadSection.tsx": "Handles file uploads, link creation, and note creation with speech-to-text support, using a concurrency limiter and persisted upload queue with background file processing via Web Workers.",
  "frontend/src/components/FoldersButton.tsx": "A fixed-position button component that opens the folders view, with hover effects, pulse animation support, and accessibility features.",
  "frontend/src/components/FoldersDialog.tsx": "DEPRECATED dialog component for managing folders (create, rename, delete) with swipe actions; kept for backward compatibility but replaced by FoldersFullScreenView.",
  "frontend/src/components/FoldersFullScreenView.tsx": "Full-screen view for managing folders with create, rename, delete operations using swipe actions, replacing the deprecated FoldersDialog component.",
  "frontend/src/components/Footer.tsx": "A simple footer component displaying copyright information and a link to caffeine.ai with a heart icon.",
  "frontend/src/components/FullScreenViewer.tsx": "Full-screen file viewer component with navigation, keyboard/touch controls, and actions (download, delete, share, send to folder/mission). Supports image/video preview and handles file deletion with index management.",
  "frontend/src/components/GallerySection.tsx": "Main gallery view displaying files and notes in a grid with selection mode, long-press support, and bulk actions. Handles file/note opening, downloading, sharing, deletion, and organization with folder/mission integration.",
  "frontend/src/components/Header.tsx": "Application header with theme toggle, animated gallery icon, sign-out dropdown menu, and unified progress bar. Shows different UI based on authentication state.",
  "frontend/src/components/HomeSharedElementTransitionLayer.tsx": "Animated transition layer for shared element transitions between home sections (folders/missions). Creates morphing animation with backdrop blur during navigation.",
  "frontend/src/components/IntroScreen.tsx": "Splash screen component displaying animated gallery icon with 2-second fade-out transition on app launch.",
  "frontend/src/components/LinkOpenFallbackDialog.tsx": "Dialog shown when browser blocks opening external links, offering retry and copy-to-clipboard options with warning UI.",
  "frontend/src/components/LiveStackInbox.tsx": "Fixed bottom-right stack preview showing up to 3 unorganized files with diagonal offset layout and slide-in animation for newly uploaded items.",
  "frontend/src/components/LoginButton.tsx": "Internet Identity login button with loading state and spinner animation during authentication.",
  "frontend/src/components/MissionDetailFullScreenView.tsx": "Full-screen view for a single mission showing title, tasks, attached files/notes with autosave functionality, task toggling, and file/note viewing capabilities.",
  "frontend/src/components/MissionEditorDialog.tsx": "Dialog for creating new missions with title input, task list management (add/toggle/remove), and form validation before submission.",
  "frontend/src/components/MissionsButton.tsx": "Fixed-position button component with Target icon that triggers missions view, supports disabled/pulse states and hover animations.",
  "frontend/src/components/MissionsFullScreenView.tsx": "Full-screen missions list view with tabs for incomplete/completed missions, swipe-to-delete actions, and navigation to mission detail or creation dialog.",
  "frontend/src/components/MobileOnlyLayout.tsx": "Simple layout wrapper component that constrains content to mobile-only container and content divs.",
  "frontend/src/components/MoveToMissionDialog.tsx": "Dialog for moving files and/or notes to a selected mission, displaying available missions as clickable cards.",
  "frontend/src/components/NotesButton.tsx": "Empty file with no content.",
  "frontend/src/components/NotesDialog.tsx": "Empty file with no content.",
  "frontend/src/components/NotesFullScreenView.tsx": "Empty file with no content.",
  "frontend/src/components/NoteViewerDialog.tsx": "Dialog for viewing a note's content with actions to send to folder/mission, download, share, or delete the note.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Empty file with no content.",
  "frontend/src/components/SendToFolderDialog.tsx": "Dialog component for moving files and notes to folders or returning them to the main collection, with performance diagnostics tracking and loading states.",
  "frontend/src/components/SwipeActionsRow.tsx": "Reusable swipe gesture component that reveals edit and delete action buttons when swiped left, with pointer event handling and smooth animations.",
  "frontend/src/components/UnifiedProgressBar.tsx": "Fixed-position progress bar that displays upload progress for active files, links, and notes with a unified percentage indicator.",
  "frontend/src/components/UploadQueueRunner.tsx": "Background component that restores and resumes pending uploads from persisted queue on app load, managing concurrent uploads with progress tracking and cleanup.",
  "frontend/src/components/WelcomeIntroScreen.tsx": "Landing page component with animated target/crosshair logo and welcome text explaining the app's purpose, featuring a login button.",
  "frontend/src/contexts/ActorContext.tsx": "React context that manages the backend actor lifecycle, including initialization with Internet Identity, exponential backoff retry logic for stopped canisters, and error classification.",
  "frontend/src/contexts/UploadContext.tsx": "React context providing upload progress tracking for files, links, and notes with batch management, progress updates, and automatic cleanup of completed uploads.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages the backend actor instance with authentication, initializing it with Internet Identity and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useFileOrganizationStatus.ts": "Hook that identifies unorganized files (those without a folderId or missionId) and returns a Set of their IDs for efficient lookup.",
  "frontend/src/hooks/useHomePrefetch.ts": "Hook that prefetches core data (folders, files, missions, notes) once when the actor becomes ready and user is authenticated, preventing refetch loops.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and hook for Internet Identity authentication, managing login/logout state, identity persistence, and providing authentication status throughout the app.",
  "frontend/src/hooks/useIntroOnAppResume.ts": "Hook that detects when the app returns to foreground (visibility or focus) and triggers a callback only when user is authenticated and initialization is complete.",
  "frontend/src/hooks/useIsCoarsePointer.ts": "Hook that detects if the device has a coarse pointer (touch device) using media queries, returning true for mobile/touch and false for desktop/mouse.",
  "frontend/src/hooks/useMissionAutosave.ts": "Hook providing debounced autosave functionality for mission edits, tracking changes from hydrated state and handling save queuing to prevent concurrent saves.",
  "frontend/src/hooks/useMissionsQueries.ts": "React Query hooks for mission CRUD operations (list, get, create, update) with optimistic updates, targeted cache invalidation, and BigInt-safe comparisons.",
  "frontend/src/hooks/useNotesQueries.ts": "React Query hooks for managing notes operations (CRUD) with concurrency limiting, targeted cache invalidation, and support for notes in folders and missions.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for file and folder operations including paginated fetching, uploads with concurrency limiting, and mutations with performance diagnostics.",
  "frontend/src/hooks/useSpeechToText.ts": "Custom hook providing browser speech recognition API integration with continuous listening, interim results, error handling, and language support.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light/dark themes, including color schemes for notes (green), missions (purple), and sidebar styling.",
  "frontend/src/lib/utils.ts": "Utility function combining clsx and tailwind-merge for conditional CSS class name merging.",
  "frontend/src/main.tsx": "Application entry point setting up React Query, Internet Identity provider, and rendering the root App component.",
  "frontend/src/pages/HomePage.tsx": "Main home page component managing folders/missions views, file uploads, gallery display, authentication state, and optional dev-mode smoke tests with lazy-loaded full-screen views.",
  "frontend/src/utils/actorInitializationMessaging.ts": "Provides utilities for detecting and classifying actor initialization errors (not ready, stopped canister, invalid admin token) and standardizing user-facing error messages.",
  "frontend/src/utils/externalOpen.ts": "Handles opening URLs externally with popup-blocker detection, file downloads, same-tab navigation for mobile app pickers, and Web Share API integration.",
  "frontend/src/utils/fileBytesWorkerSingleton.ts": "Manages a singleton Web Worker for reading file bytes with concurrency limiting (max 3 concurrent requests) and request queuing.",
  "frontend/src/utils/fileOpenRules.ts": "Determines the primary action (in-app viewer vs. download-only) when a user opens a file based on its MIME type category.",
  "frontend/src/utils/filePreview.ts": "Categorizes files by MIME type (image, video, PDF, office, unsupported) and provides preview capability checks and human-readable type labels.",
  "frontend/src/utils/missionCompletion.ts": "Calculates mission progress percentages, determines completion status (100% with at least one task), and splits missions into incomplete/completed lists.",
  "frontend/src/utils/missionTaskCompare.ts": "Provides BigInt-safe equality comparison for Task arrays by comparing taskId, task text, and completed status without JSON.stringify.",
  "frontend/src/utils/notesTime.ts": "Empty utility file with no content.",
  "frontend/src/utils/performanceDiagnostics.ts": "Opt-in performance diagnostics utility (via localStorage or URL param) that times operations and logs durations with metadata for debugging.",
  "frontend/src/utils/persistedUploadQueue.ts": "Manages an IndexedDB-backed upload queue for persisting file uploads (up to 50MB) with progress tracking, completion marking, and queue restoration.",
  "frontend/src/utils/reactQueryDiagnostics.ts": "Development-only logging helper for React Query mutation lifecycle phases (start, success, error, settled) with timestamps and metadata.",
  "frontend/src/utils/smokeTestCoreFlows.ts": "Development utility that runs smoke tests for core application flows (folder, mission, link, and note creation) by executing backend operations and verifying results. Includes formatting functions to display test results with pass/fail status.",
  "frontend/src/utils/uploadConcurrency.ts": "Provides concurrency limiters for managing parallel task execution with configurable limits. Includes both basic and cancellable versions with queue management and statistics tracking.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting and managing URL parameters from both query strings and hash-based routing. Supports sessionStorage persistence and parameter cleanup from URLs.",
  "frontend/src/workers/fileBytes.worker.ts": "Web Worker that reads file bytes off the main thread, converting File objects to Uint8Array with metadata. Handles errors and uses transferable objects for efficient data passing.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color schemes using OKLCH color space, including theme colors for sidebar, notes, missions, and chart components. Includes custom animations and typography plugin.",
  "frontend/V114_BASELINE_FRONTEND_FILES.txt": "Canonical file list documenting all frontend files in Live version 114, organized by category (core, pages, components, contexts, hooks, utilities, styling, PWA, config, assets) for baseline validation and drift detection.",
  "project_state.json": "Project metadata tracking architectural notes, known issues, and feature requests. Currently contains one existing feature for positioning mission and folder icons with appropriate spacing."
}