{
  "backend/main.mo": "Actor implementing file, note, folder, mission, and authorization logic with types, state maps, and health/diagnostic queries.",
  "feature_evidence.json": "Feature evidence report listing mission‑related UI and React Query tasks with associated files and components.",
  "frontend-file-summaries.txt": "Collection of short descriptions summarizing the purpose and behavior of multiple frontend components and utilities.",
  "frontend/DRAFT_BASELINE_V114.md": "Documentation describing creation and verification of a Draft baseline identical to Live v114 with strict change‑control rules.",
  "frontend/index.css": "Tailwind base stylesheet defining OKLCH color variables and light/dark theme rules.",
  "frontend/index.html": "Main HTML entry point configuring PWA metadata, icons, and service worker registration.",
  "frontend/PAUSE_AFTER_RESTORE.md": "Post‑restoration freeze notice outlining prohibited changes and required user approval for modifications.",
  "frontend/public/manifest.json": "PWA manifest defining app metadata, icons, and display configuration for MyGallery.",
  "frontend/public/sw.js": "Service worker implementing minimal precaching, runtime caching, and offline fallback logic.",
  "frontend/PWA_INSTALLABILITY_NOTES.md": "Guide for verifying Chrome PWA installability, covering manifest, icons, service worker, and testing steps.",
  "frontend/RESTORE_LIVE_V114_CHECKLIST.md": "Checklist documenting verification of all frontend files and behaviors to match Live version 114.",
  "frontend/src/App.tsx": "Root React component wiring theming, context providers, and intro-screen logic based on identity state.",
  "frontend/src/components/ActorInitErrorState.tsx": "UI component showing error states during actor initialization with retry, logout, and expandable technical details.",
  "frontend/src/components/AnimatedGalleryIcon.tsx": "SVG-based animated gallery icon with hover effects and decorative targeting rings.",
  "frontend/src/components/ConnectivityIndicator.tsx": "Empty or placeholder component with no implementation.",
  "frontend/src/components/DecorativeBottomLine.tsx": "Renders a fixed decorative bottom border line for layout styling.",
  "frontend/src/components/ExternalOpenFallbackDialog.tsx": "Dialog shown when a file cannot be opened in a new window, offering retry and download options.",
  "frontend/src/components/FilePreviewDialog.tsx": "Dialog for previewing files of various types with actions for downloading, deleting, and moving files.",
  "frontend/src/components/FileUploadSection.tsx": "Handles uploading files, links, and notes with progress tracking, validation, and optional speech-to-text input.",
  "frontend/src/components/FoldersButton.tsx": "Floating button that triggers folder-related actions with a folder icon and optional disabled state.",
  "frontend/src/components/FoldersDialog.tsx": "Deprecated dialog for listing, creating, renaming, and deleting folders with swipe actions and confirmation prompts.",
  "frontend/src/components/FoldersFullScreenView.tsx": "UI for listing, creating, renaming, deleting, and selecting folders with swipe actions and dialogs.",
  "frontend/src/components/Footer.tsx": "Static footer displaying attribution and link to caffeine.ai.",
  "frontend/src/components/FullScreenViewer.tsx": "Full-screen viewer for browsing, downloading, deleting, sharing, and organizing files with swipe navigation.",
  "frontend/src/components/GallerySection.tsx": "Displays files and notes in a grid with selection, previews, bulk actions, and support dialogs.",
  "frontend/src/components/Header.tsx": "Top navigation bar with theme toggle, sign-out menu, and progress bar.",
  "frontend/src/components/IntroScreen.tsx": "Animated splash screen that fades out and triggers completion after a short delay.",
  "frontend/src/components/LinkOpenFallbackDialog.tsx": "Dialog shown when a link cannot be opened, offering retry and copy options.",
  "frontend/src/components/LoginButton.tsx": "Button to sign in using Internet Identity with loading indication.",
  "frontend/src/components/MissionDetailFullScreenView.tsx": "Full-screen mission view allowing task editing, autosave, and viewing attached files and notes.",
  "frontend/src/components/MissionEditorDialog.tsx": "Dialog for creating missions with title and task management, including adding, toggling, and removing tasks and submitting to backend.",
  "frontend/src/components/MissionsButton.tsx": "Floating button that triggers the missions interface with animated icon and disabled state handling.",
  "frontend/src/components/MissionsFullScreenView.tsx": "Full‑screen mission browser supporting creation, deletion, swipe navigation, and switching between incomplete and completed missions.",
  "frontend/src/components/MobileOnlyLayout.tsx": "Wrapper component that constrains its children to a mobile‑only layout container.",
  "frontend/src/components/MoveToMissionDialog.tsx": "Dialog allowing selected files or notes to be moved to an existing mission, handling loading and mutation states.",
  "frontend/src/components/NotesButton.tsx": "Empty file.",
  "frontend/src/components/NotesDialog.tsx": "Empty file.",
  "frontend/src/components/NotesFullScreenView.tsx": "Empty file.",
  "frontend/src/components/NoteViewerDialog.tsx": "Dialog for viewing a note with actions to download, share, move, or delete it.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Empty file.",
  "frontend/src/components/SendToFolderDialog.tsx": "Dialog for moving files or notes into folders or back to the main collection, with performance diagnostics and mutation handling.",
  "frontend/src/components/SwipeActionsRow.tsx": "Swipeable row component enabling edit/delete actions with drag gestures and controlled open state.",
  "frontend/src/components/UnifiedProgressBar.tsx": "Displays a unified upload progress bar showing overall percentage and item count.",
  "frontend/src/components/WelcomeIntroScreen.tsx": "Intro screen with a target-themed SVG graphic and onboarding text plus a login button.",
  "frontend/src/contexts/ActorContext.tsx": "Context managing backend actor initialization, retry logic, error handling, and sign-out.",
  "frontend/src/contexts/UploadContext.tsx": "Context tracking multiple upload items with coalesced progress updates and legacy API compatibility.",
  "frontend/src/hooks/useActor.ts": "Hook creating and caching a backend actor per identity and invalidating dependent queries on change.",
  "frontend/src/hooks/useHomePrefetch.ts": "Hook prefetching core home data once when the backend actor becomes ready.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for managing Internet Identity authentication using AuthClient, including login state and stored identity handling.",
  "frontend/src/hooks/useIsCoarsePointer.ts": "Hook that detects whether the device uses a coarse (touch) pointer by listening to a media query.",
  "frontend/src/hooks/useMissionAutosave.ts": "Implements debounced autosaving for mission title and tasks with change detection, concurrency handling, and mission switch resets.",
  "frontend/src/hooks/useMissionsQueries.ts": "React Query hooks for listing, retrieving, creating, and updating missions via the backend actor, including cache invalidation.",
  "frontend/src/hooks/useNotesQueries.ts": "React Query hooks for fetching, creating, and deleting notes with targeted cache invalidation and concurrency limiting.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for managing files and folders, including listing, folder contents, mission attachments, and creating folders with upload concurrency limits.",
  "frontend/src/hooks/useSpeechToText.ts": "Custom React hook wrapping the browser SpeechRecognition API, handling interim/final transcripts, errors, and listening state.",
  "frontend/src/index.css": "Tailwind CSS base file defining light/dark theme variables, component styles, and mobile layout constraints.",
  "frontend/src/lib/utils.ts": "Utility merging Tailwind class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "App entry point creating the React root, setting up React Query and Internet Identity provider, and rendering App.",
  "frontend/src/pages/HomePage.tsx": "Main homepage component handling authentication, data fetching, UI state, and optional dev smoke tests with lazy-loaded views.",
  "frontend/src/utils/actorInitializationMessaging.ts": "Helpers for classifying backend actor initialization errors and standardizing related messages.",
  "frontend/src/utils/externalOpen.ts": "Utilities to open URLs externally, download files or notes, and share files via Web Share API.",
  "frontend/src/utils/fileOpenRules.ts": "Logic determining how files should open based on MIME category, supporting in-app viewer, office preview, or direct download.",
  "frontend/src/utils/filePreview.ts": "Categorizes MIME types into previewable groups and returns human-readable labels.",
  "frontend/src/utils/missionCompletion.ts": "Computes mission progress, checks completion status, and splits missions into complete/incomplete lists.",
  "frontend/src/utils/missionTaskCompare.ts": "Provides BigInt‑safe equality checking for Task arrays.",
  "frontend/src/utils/notesTime.ts": "Empty placeholder file with no implemented logic.",
  "frontend/src/utils/performanceDiagnostics.ts": "Implements a toggleable performance diagnostics logger with timing utilities and async operation wrappers.",
  "frontend/src/utils/reactQueryDiagnostics.ts": "Logs React Query mutation lifecycle events during development.",
  "frontend/src/utils/smokeTestCoreFlows.ts": "Runs development‑only backend smoke tests for core flows like creating folders, missions, links, and notes, and formats results.",
  "frontend/src/utils/uploadConcurrency.ts": "Provides a simple promise concurrency limiter with queueing.",
  "frontend/src/utils/urlParams.ts": "Utility for reading, persisting, and clearing URL and session‑stored parameters, including hash‑based routing support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, radii, animations, and plugins.",
  "frontend/V114_BASELINE_FRONTEND_FILES.txt": "Canonical list of all frontend files that define the v114 baseline for drift detection.",
  "project_state.json": "Project state metadata describing mission‑related fix requirements and existing feature definitions."
}