{
  "backend/main.mo": "Defines the backend actor with types, authorization mixins, storage logic, mission/task structures, and health/diagnostic queries plus ID counters and maps for files, notes, folders, and missions.",
  "feature_evidence.json": "Contains feature evidence entries mapping PWA‑related requirements to affected frontend files, components, and test IDs with high-confidence verification data.",
  "frontend-file-summaries.txt": "Lists concise per-file frontend descriptions summarizing component roles, behaviors, hooks, styling, and data-flow characteristics.",
  "frontend/DRAFT_BASELINE_V114.md": "Documents creation of Draft Baseline V114, confirming 1:1 parity with the live version and detailing validation steps, constraints, and smoke-test guidance.",
  "frontend/index.css": "Tailwind base and component layers defining OKLCH color variables, light/dark themes, and global styling.",
  "frontend/index.html": "Main HTML entry with PWA meta tags, icons, and service worker registration for the MYL app.",
  "frontend/PAUSE_AFTER_RESTORE.md": "Declares a post-restore change freeze, outlining prohibited modifications, permitted documentation updates, and required user approval for future changes.",
  "frontend/public/manifest.json": "PWA manifest defining MYL app metadata, icons, display settings, and categories.",
  "frontend/public/sw.js": "Service worker implementing precaching, runtime caching with limits, and network‑first navigation handling.",
  "frontend/PWA_INSTALLABILITY_NOTES.md": "Provides a detailed checklist for verifying PWA installability on Chrome Android, covering manifest fields, service worker requirements, icons, and troubleshooting steps.",
  "frontend/RESTORE_LIVE_V114_CHECKLIST.md": "Checklist verifying frontend code and behavior match Live v114, covering auth, UI, components, hooks, and utilities.",
  "frontend/src/App.tsx": "Root app component managing theme, providers, and intro screen logic triggered on login or app resume.",
  "frontend/src/components/ActorInitErrorState.tsx": "Error UI component showing classified actor initialization failures with details, retry, and logout actions.",
  "frontend/src/components/AnimatedGalleryIcon.tsx": "Renders an animated SVG target-style gallery icon with hover effects.",
  "frontend/src/components/ConnectivityIndicator.tsx": "Empty file with no implementation.",
  "frontend/src/components/DecorativeBottomLine.tsx": "Renders a fixed bottom horizontal line used as a decorative UI element.",
  "frontend/src/components/ExternalOpenFallbackDialog.tsx": "Dialog shown when a file fails to open in a new window, offering retry and download options.",
  "frontend/src/components/FilePreviewDialog.tsx": "Dialog for previewing files with support for images, videos, PDFs, Office docs, and file actions like download or delete.",
  "frontend/src/components/FileUploadSection.tsx": "Handles file, link, and note uploads with progress tracking, speech-to-text support, and validation.",
  "frontend/src/components/FoldersButton.tsx": "Clickable button that opens the folders view, displaying a styled folder icon.",
  "frontend/src/components/FoldersDialog.tsx": "Deprecated folder management dialog supporting creation, renaming, deletion, and selection of folders.",
  "frontend/src/components/FoldersFullScreenView.tsx": "Full‑screen folder management UI allowing creation, editing, deletion, and selection of folders.",
  "frontend/src/components/Footer.tsx": "Simple footer showing copyright text and a link to caffeine.ai.",
  "frontend/src/components/FullScreenViewer.tsx": "Full-screen file viewer with swipe navigation, file actions (delete, download, share), and dialogs for folder or mission moves and external-open fallback.",
  "frontend/src/components/GallerySection.tsx": "Renders a gallery of files and notes with selection, long-press handling, preview dialogs, and file/note actions like delete, move, share, and open.",
  "frontend/src/components/Header.tsx": "Top navigation bar with theme toggle, auth menu, app title, and a global progress bar.",
  "frontend/src/components/IntroScreen.tsx": "Splash intro screen showing an animated icon that fades out after a timed transition.",
  "frontend/src/components/LinkOpenFallbackDialog.tsx": "Dialog shown when a link cannot be opened, offering retry and copy-to-clipboard options.",
  "frontend/src/components/LoginButton.tsx": "Button that triggers Internet Identity login and shows a loading state while authenticating.",
  "frontend/src/components/MissionDetailFullScreenView.tsx": "Full-screen mission view with tasks, autosave, attached files/notes, and preview dialogs.",
  "frontend/src/components/MissionEditorDialog.tsx": "Dialog for creating missions, including title input, task list editing, and mission submission.",
  "frontend/src/components/MissionsButton.tsx": "Renders a fixed missions button with icon, hover animations, and disabled/overlay states.",
  "frontend/src/components/MissionsFullScreenView.tsx": "Displays a full-screen missions list with swipe actions, mission creation, deletion, filtering, and detail navigation.",
  "frontend/src/components/MobileOnlyLayout.tsx": "Wraps children in a container intended for mobile-only display.",
  "frontend/src/components/MoveToMissionDialog.tsx": "Dialog for moving selected files or notes into a mission, showing mission list and handling mutations.",
  "frontend/src/components/NotesButton.tsx": "Empty file.",
  "frontend/src/components/NotesDialog.tsx": "Empty file.",
  "frontend/src/components/NotesFullScreenView.tsx": "Empty file.",
  "frontend/src/components/NoteViewerDialog.tsx": "Viewer dialog for a note with options to send, download, share, or delete.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Empty file.",
  "frontend/src/components/SendToFolderDialog.tsx": "Dialog for moving or removing items from folders with folder list and mutation handling.",
  "frontend/src/components/SwipeActionsRow.tsx": "Provides a swipeable row with edit and delete actions, managing swipe gestures and animations.",
  "frontend/src/components/UnifiedProgressBar.tsx": "Shows a global upload progress bar when uploads are active.",
  "frontend/src/components/WelcomeIntroScreen.tsx": "Displays an introductory screen with a target-themed SVG graphic, descriptive text, and a login button layout.",
  "frontend/src/contexts/ActorContext.tsx": "Manages creation and lifecycle of the backend actor with retry logic, error handling, and authentication integration.",
  "frontend/src/contexts/UploadContext.tsx": "Provides context for tracking upload items with progress updates, batching, legacy APIs, and requestAnimationFrame coalescing.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor using react-query, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useHomePrefetch.ts": "Prefetches core home-page data once per authenticated session when the actor becomes ready.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication flow, exposing identity state, login, logout, and status flags.",
  "frontend/src/hooks/useIntroOnAppResume.ts": "Runs a callback when the app regains focus or visibility while the user is authenticated.",
  "frontend/src/hooks/useIsCoarsePointer.ts": "Detects whether the device uses a coarse pointer, indicating a touch-based interface.",
  "frontend/src/hooks/useMissionAutosave.ts": "Provides a debounced autosave hook for missions with change detection, mission switching reset, and queued save handling.",
  "frontend/src/hooks/useMissionsQueries.ts": "Defines React Query hooks for listing, fetching, creating, and updating missions with actor checks and targeted cache invalidation.",
  "frontend/src/hooks/useNotesQueries.ts": "Implements React Query hooks for fetching, creating, and deleting notes, including folder and mission filtering with concurrency limiting.",
  "frontend/src/hooks/useQueries.ts": "Contains React Query hooks for files and folders, including paginated fetches, mission-specific queries, and limited‑concurrency uploads.",
  "frontend/src/hooks/useSpeechToText.ts": "Provides a speech‑to‑text hook using browser recognition APIs with handling for transcripts, interim results, errors, and lifecycle.",
  "frontend/src/index.css": "Defines Tailwind layers and extensive CSS variables for light/dark themes and component styling.",
  "frontend/src/lib/utils.ts": "Provides a helper function to merge conditional classnames using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider, then renders App.",
  "frontend/src/pages/HomePage.tsx": "Implements the main home screen with authentication checks, data fetching, and lazy-loaded full-screen views.",
  "frontend/src/utils/actorInitializationMessaging.ts": "Defines error messages and helpers to classify actor initialization, stopped canister, and auth token errors.",
  "frontend/src/utils/externalOpen.ts": "Utilities for opening external URLs, downloading files or notes, and sharing files via Web Share API.",
  "frontend/src/utils/fileOpenRules.ts": "Determines how files should open based on MIME type, including viewer, office preview, or download rules.",
  "frontend/src/utils/filePreview.ts": "Categorizes files by MIME type, checks preview support, and provides human-readable file type labels.",
  "frontend/src/utils/missionCompletion.ts": "Calculates mission progress, checks completion status, and splits missions into completed and incomplete groups.",
  "frontend/src/utils/missionTaskCompare.ts": "Performs BigInt-safe comparison of task arrays by matching IDs, text, and completion flags.",
  "frontend/src/utils/notesTime.ts": "Empty or placeholder file with no implementation.",
  "frontend/src/utils/performanceDiagnostics.ts": "Provides an opt-in performance timing utility that logs durations of operations with optional metadata.",
  "frontend/src/utils/reactQueryDiagnostics.ts": "Logs React Query mutation lifecycle events in development mode for debugging.",
  "frontend/src/utils/smokeTestCoreFlows.ts": "Runs development-only backend smoke tests for creating folders, missions, links, and notes, and formats the results.",
  "frontend/src/utils/uploadConcurrency.ts": "Implements a simple concurrency limiter to control parallel async operations.",
  "frontend/src/utils/urlParams.ts": "Utility for reading, storing, and clearing URL parameters with sessionStorage persistence and hash support.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, animations, and content paths with custom design tokens.",
  "frontend/V114_BASELINE_FRONTEND_FILES.txt": "Canonical list of all frontend files defining the v114 baseline used for drift detection and validation.",
  "project_state.json": "Defines the project’s PWA-related goals, requirements, and current architectural notes for MYL."
}