{
  "backend/main.mo": "Motoko canister implementing core backend logic including blob storage, authorization, user profiles, notes, missions/tasks, folders, and file metadata with persistent state and access control.",
  "feature_evidence.json": "Machine-readable report documenting a single frontend feature change, its affected file, related components, test ID, and confidence level.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose and behavior of key frontend source files for the MyGallery application.",
  "frontend/DRAFT_BASELINE_V114.md": "Documentation establishing a draft baseline that is exactly synced 1:1 with Live version 114, including verification steps and parity guarantees.",
  "frontend/index.css": "Global Tailwind CSS base stylesheet defining OKLCH color tokens, light/dark theme variables, and foundational layout and border styles.",
  "frontend/index.html": "HTML entry point for the frontend that sets up meta tags, favicons, and PWA configuration, and mounts the React app at #root via src/main.tsx.",
  "frontend/PAUSE_AFTER_RESTORE.md": "Change-control notice declaring a freeze after restoring Live v114, outlining prohibited changes and the process required to resume modifications.",
  "frontend/public/manifest.json": "Web app manifest defining MyGallery PWA metadata, display settings, theme colors, scope, and a comprehensive set of app icons.",
  "frontend/public/sw.js": "Service worker implementing a lightweight PWA caching strategy with minimal precaching, network-first fetch handling, runtime caching, and cache cleanup.",
  "frontend/RESTORE_LIVE_V114_CHECKLIST.md": "Detailed checklist verifying that the frontend was restored to exactly match Live version 114 across authentication, UI, behavior, and configuration.",
  "frontend/src/App.tsx": "Root React component that wires up theme, actor, and upload providers, manages Internet Identity login state, and conditionally shows an intro screen after successful login.",
  "frontend/src/components/ActorInitErrorState.tsx": "UI component that displays categorized actor initialization errors with retry and logout actions, including expandable technical details.",
  "frontend/src/components/AnimatedGalleryIcon.tsx": "Reusable animated SVG camera/gallery icon component with hover effects and subtle animations for branding or navigation.",
  "frontend/src/components/ConnectivityIndicator.tsx": "Empty component file; no implementation present.",
  "frontend/src/components/DecorativeBottomLine.tsx": "Simple presentational component that renders a fixed decorative horizontal line near the bottom of the viewport.",
  "frontend/src/components/ExternalOpenFallbackDialog.tsx": "Dialog component shown when a browser blocks opening a file externally, offering retry and download options.",
  "frontend/src/components/FilePreviewDialog.tsx": "Dialog component for previewing files (images, video, PDF, Office), with actions to open, download, move to folder, or delete files.",
  "frontend/src/components/FileUploadSection.tsx": "Implements a drag-and-drop and click file upload UI that uploads multiple files, tracks per-file progress via context, and shows toast notifications based on backend readiness and upload results.",
  "frontend/src/components/FoldersButton.tsx": "Renders a fixed-position floating button that opens the folders UI, with disabled and hover states and a custom folder icon.",
  "frontend/src/components/FoldersDialog.tsx": "Provides a dialog for listing, creating, renaming, selecting, and deleting folders using backend queries, with inline editing and toast feedback gated by backend readiness.",
  "frontend/src/components/Footer.tsx": "Displays a simple footer with copyright text, a heart icon, and a link crediting caffeine.ai.",
  "frontend/src/components/FullScreenViewer.tsx": "Shows files in a full-screen dialog with swipe and button navigation, supporting download, delete, share, send-to-folder, and external open actions with fallbacks.",
  "frontend/src/components/GallerySection.tsx": "Renders a file gallery for a selected folder or root, including file cards with long-press selection, bulk actions, previews, downloads, and integration with the full-screen viewer.",
  "frontend/src/components/Header.tsx": "Defines the top navigation bar with app branding, theme toggle, authentication menu (sign out), and a unified upload progress bar.",
  "frontend/src/components/IntroScreen.tsx": "Displays an animated welcome screen with a timed logo animation before transitioning to the main application.",
  "frontend/src/components/LoginButton.tsx": "Provides a login button for Internet Identity authentication, showing a loading state while signing in.",
  "frontend/src/components/MissionDetailFullScreenView.tsx": "Full-screen editor for a single mission that loads mission data, lets users edit the title and tasks, track progress, save changes, or delete the mission with confirmation.",
  "frontend/src/components/MissionEditorDialog.tsx": "Dialog-based UI for creating a new mission, allowing entry of a title and task list and submitting it via a create-mission mutation.",
  "frontend/src/components/MissionsButton.tsx": "Floating action button that opens the Missions interface, with disabled and hover visual states.",
  "frontend/src/components/MissionsFullScreenView.tsx": "Full-screen Missions hub that lists missions with progress, supports creating and deleting missions, and navigates into a mission detail view.",
  "frontend/src/components/NotesButton.tsx": "Floating action button that opens the Notes interface, with disabled and hover visual states.",
  "frontend/src/components/NotesDialog.tsx": "Empty placeholder file for a Notes dialog component with no implementation.",
  "frontend/src/components/NotesFullScreenView.tsx": "Full-screen notes manager that lists notes, supports creating, editing, saving, and deleting notes, and handles mobile-friendly editor behavior.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Empty placeholder file for a profile setup dialog component with no implementation.",
  "frontend/src/components/SendToFolderDialog.tsx": "Dialog that lets users move selected files into a folder or return them to the main collection using folder-related mutations.",
  "frontend/src/components/UnifiedProgressBar.tsx": "Top-level progress bar that appears during uploads, showing overall upload percentage and file count from the upload context.",
  "frontend/src/components/WelcomeIntroScreen.tsx": "Renders a full-screen welcome page with branding, introductory text, and a login call-to-action using Internet Identity.",
  "frontend/src/contexts/ActorContext.tsx": "Provides a React context that manages backend actor initialization, status, retries with backoff, error handling, and sign-out tied to Internet Identity.",
  "frontend/src/contexts/UploadContext.tsx": "Defines an upload tracking context that manages upload batches, per-file progress, aggregate progress, and exposes helpers to start, update, and complete uploads.",
  "frontend/src/hooks/useActor.ts": "A React Query hook that creates and caches a backend actor based on the current identity and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity authentication provider and hook, handling login, logout, persisted identity loading, and detailed login status state.",
  "frontend/src/hooks/useMissionsQueries.ts": "Collection of React Query hooks for listing, fetching, creating, updating, and deleting missions via the backend actor with cache invalidation.",
  "frontend/src/hooks/useNotesQueries.ts": "Collection of React Query hooks for CRUD operations on notes, including list and detail queries, using the backend actor with proper cache management.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching files and folders and for creating/renaming folders, integrating backend actor readiness, identity checks, caching, and optimistic updates.",
  "frontend/src/index.css": "Global Tailwind CSS setup defining extensive light and dark theme design tokens, color variables, layout base styles, and touch interaction optimizations.",
  "frontend/src/lib/utils.ts": "Provides a utility function to merge conditional class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Application entry point that initializes React, configures React Query, wraps the app with Internet Identity and query providers, and loads global styles.",
  "frontend/src/pages/HomePage.tsx": "Main landing page component that orchestrates authentication state, error handling, data prefetching, and conditional rendering of gallery, folders, notes, and missions views.",
  "frontend/src/utils/actorInitializationMessaging.ts": "Centralizes detection, classification, and user-facing messaging for backend actor initialization and connectivity errors.",
  "frontend/src/utils/externalOpen.ts": "Utilities for opening external URLs in a new tab and downloading files via browser APIs with basic error handling.",
  "frontend/src/utils/fileOpenRules.ts": "Defines rules for deciding whether a file opens in-app, uses an office preview, or downloads directly based on file metadata and MIME type.",
  "frontend/src/utils/filePreview.ts": "Categorizes files by MIME type and provides helpers to determine preview capability and human-readable file type labels.",
  "frontend/src/utils/notesTime.ts": "Formats note timestamps into relative or localized human-readable strings such as \"Just now\" or calendar dates.",
  "frontend/src/utils/urlParams.ts": "Provides utility functions to read URL parameters from query strings or hash-based routing, persist them in sessionStorage, and retrieve or clear them safely. Includes logic to prioritize URL values, persist sensitive tokens across navigation, and clean parameters from the URL hash without reloading.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining content paths, class-based dark mode, extended border radii, animations, and a comprehensive OKLCH-based color token system for app, sidebar, notes, and missions themes. Enables accordion animations and includes animate and typography plugins.",
  "frontend/V114_BASELINE_FRONTEND_FILES.txt": "Canonical list of all frontend files that define the Live version 114 baseline, used to detect drift and validate 1:1 parity.",
  "project_state.json": "Machine-readable snapshot of the project’s overall architecture and implemented features, including PWA setup, theming, Internet Identity authentication, canister-backed storage, and user-facing file, notes, and missions functionality. Serves as versioned documentation of current capabilities and system design."
}