{
  "backend/main.mo": "Main backend actor implementing file storage, folders, missions, notes, tasks, user profiles, upload tracking, authorization via mixins, and diagnostic/health endpoints with timing metrics.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to implementation files, components, test IDs, and confidence levels for floating file stack, gallery hiding, stack design, full-screen view, and bulk file actions.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend source files describing component responsibilities, hooks, utilities, contexts, and integration points across the application.",
  "frontend/DRAFT_BASELINE_V114.md": "Documentation establishing Draft baseline synced 1:1 with Live version 114, including verification checklist for authentication, actor initialization, UI behavior, and core flows smoke test instructions.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining CSS custom properties for light and dark themes, including sidebar, chart, and UI component color tokens.",
  "frontend/index.html": "Main HTML entry point for MYL PWA with meta tags, manifest links, iOS-specific configuration, and service worker registration script for offline capability.",
  "frontend/PAUSE_AFTER_RESTORE.md": "Change control freeze notice prohibiting all code changes after Live v114 restoration until explicit user-provided change list is received, with emergency override criteria.",
  "frontend/public/manifest.json": "PWA manifest defining MYL app metadata, icons, display mode (standalone), theme colors, and orientation for installability on mobile devices.",
  "frontend/public/sw.js": "Service worker implementing network-first caching strategy with runtime cache trimming, offline fallback to index.html, and automatic cache cleanup for PWA functionality.",
  "frontend/PWA_INSTALLABILITY_NOTES.md": "Comprehensive PWA installability verification guide for Chrome on Android, covering manifest, service worker, icons, DevTools checks, common issues, and testing checklist.",
  "frontend/RESTORE_LIVE_V114_CHECKLIST.md": "Comprehensive checklist documenting the restoration of frontend code to Live version 114, including verification steps for core files, authentication, UI components, gallery management, styling, and behavior validation.",
  "frontend/src/App.tsx": "Root application component wrapping the app with ThemeProvider, QueryClientProvider, ActorProvider, and UploadProvider, managing intro screen display on app resume and rendering HomePage with UploadQueueRunner.",
  "frontend/src/components/ActorInitErrorState.tsx": "Error state component displaying actor initialization failures with collapsible technical details, retry and logout actions, and specialized messaging for stopped canisters or invalid admin tokens.",
  "frontend/src/components/AnimatedGalleryIcon.tsx": "React component rendering an animated SVG icon with concentric target rings, crosshairs, corner markers, and hover effects styled with missions-accent colors.",
  "frontend/src/components/ConnectivityIndicator.tsx": "Empty file with no content.",
  "frontend/src/components/DecorativeBottomLine.tsx": "Renders a fixed horizontal decorative border line near the bottom of the viewport with theme-aware styling.",
  "frontend/src/components/ExternalOpenFallbackDialog.tsx": "Dialog component that appears when a browser blocks opening a file in a new window, offering retry and download options.",
  "frontend/src/components/FilePreviewDialog.tsx": "Dialog component for previewing files with support for images, videos, PDFs, and Office documents, plus actions like download, delete, send to folder, and move to mission.",
  "frontend/src/components/FileUploadSection.tsx": "Component handling file uploads, link creation, and note creation with progress tracking using a file bytes worker and upload context.",
  "frontend/src/components/FloatingFileStack.tsx": "Floating UI component displaying a stacked preview of recently uploaded files with animations and a count badge, clickable to open the full stack.",
  "frontend/src/components/FoldersButton.tsx": "Fixed-position button component for accessing folders, featuring a folder icon with hover effects, pulse animation support, and accessibility attributes.",
  "frontend/src/components/FoldersDialog.tsx": "Deprecated dialog for managing folders (create, rename, delete) with swipe actions; marked for replacement by FoldersFullScreenView.",
  "frontend/src/components/FoldersFullScreenView.tsx": "Full-screen folder management view with create, rename, delete operations and swipe actions. Handles folder selection and navigation back to main view.",
  "frontend/src/components/Footer.tsx": "Simple footer component displaying copyright notice and attribution link to caffeine.ai with a heart icon.",
  "frontend/src/components/FullScreenViewer.tsx": "Full-screen file viewer with navigation, keyboard/touch controls, and actions (download, delete, share, move to folder/mission). Supports swipe gestures for navigation between files.",
  "frontend/src/components/GallerySection.tsx": "Main gallery component displaying files and notes in grid layout with support for folder filtering, bulk selection, long-press interactions, and various file actions. Handles both file and note items with different preview types.",
  "frontend/src/components/Header.tsx": "Application header with theme toggle, animated gallery icon, sign-out dropdown menu, and unified progress bar. Shows different UI based on authentication state.",
  "frontend/src/components/HomeSharedElementTransitionLayer.tsx": "Provides shared element transition animations between home view and folders/missions views with backdrop blur effects. Manages transition state and timing for opening/closing animations.",
  "frontend/src/components/IntroScreen.tsx": "Splash screen component displaying animated gallery icon with fade-out transition. Auto-completes after 2 seconds.",
  "frontend/src/components/LinkOpenFallbackDialog.tsx": "Dialog shown when browser blocks opening external links, offering retry and copy-to-clipboard options with the blocked URL displayed.",
  "frontend/src/components/LoginButton.tsx": "Internet Identity login button with loading state indicator. Triggers authentication flow when clicked.",
  "frontend/src/components/MissionDetailFullScreenView.tsx": "Full-screen view for displaying and editing a single mission with tasks, attached files, and notes. Implements autosave functionality, task toggling, and file/note viewing with optimistic updates.",
  "frontend/src/components/MissionEditorDialog.tsx": "Dialog component for creating new missions with a title and task list. Handles task addition, removal, and completion toggling before mission creation.",
  "frontend/src/components/MissionsButton.tsx": "Floating action button component with Target icon for opening the missions view. Supports disabled state, pulse animation, and z-index control.",
  "frontend/src/components/MissionsFullScreenView.tsx": "Full-screen list view of all missions with tabs for incomplete/completed missions. Supports swipe-to-delete actions, mission creation, and navigation to mission details.",
  "frontend/src/components/MobileOnlyLayout.tsx": "Simple wrapper component that applies mobile-only container and content styling to its children.",
  "frontend/src/components/MoveToMissionDialog.tsx": "Dialog for moving files and notes to a selected mission. Displays a list of available missions and handles the move operation with success/error feedback.",
  "frontend/src/components/NotesButton.tsx": "Empty file with no content.",
  "frontend/src/components/NotesDialog.tsx": "Empty file with no content.",
  "frontend/src/components/NotesFullScreenView.tsx": "Empty file with no content.",
  "frontend/src/components/NoteViewerDialog.tsx": "Dialog for viewing a single note with actions to send to folder/mission, download, share, or delete. Displays note title and body in a scrollable area.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Empty file with no content.",
  "frontend/src/components/SendToFolderDialog.tsx": "Dialog component for moving files and notes to folders or returning them to the main collection, with performance diagnostics and loading states.",
  "frontend/src/components/StackFilesFullScreenView.tsx": "Full-screen view for managing stacked files with multi-select, batch operations (delete, move to folder/mission, download, share), and integrated file viewer.",
  "frontend/src/components/SwipeActionsRow.tsx": "Swipeable row component with touch gesture support that reveals edit and delete action buttons on left swipe.",
  "frontend/src/components/UnifiedProgressBar.tsx": "Fixed progress bar component that displays upload progress for active file, link, and note uploads with percentage and item counts.",
  "frontend/src/components/UploadQueueRunner.tsx": "Background service that restores and resumes pending uploads from persisted queue on app load, with concurrency limiting (3 parallel uploads) and progress tracking.",
  "frontend/src/components/WelcomeIntroScreen.tsx": "Welcome screen with animated mission target icon and introductory text explaining the app's purpose, including a login button.",
  "frontend/src/contexts/ActorContext.tsx": "Provides React context for managing backend actor lifecycle with authentication, retry logic with exponential backoff for stopped canisters, and admin token initialization. Handles actor status states (idle, initializing, ready, unavailable, error) and provides sign-out functionality.",
  "frontend/src/contexts/UploadContext.tsx": "Manages upload state and progress tracking for files, links, and notes with batch support. Provides methods to start uploads, update progress, complete uploads, restore items, and manage completed upload history.",
  "frontend/src/hooks/useActor.ts": "React Query-based hook that creates and manages backend actor instances based on Internet Identity authentication state. Invalidates and refetches dependent queries when actor changes.",
  "frontend/src/hooks/useHomePrefetch.ts": "Prefetches core data (folders, files, missions, notes) once when actor becomes ready and user is authenticated. Resets prefetch flag on logout to allow re-prefetch on next login.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks with login/logout functionality, identity persistence, and status tracking. Configures AuthClient with custom options including derivation origin and idle behavior.",
  "frontend/src/hooks/useIntroOnAppResume.ts": "Detects when the app returns to foreground (visibility change or window focus) and triggers a callback only when user is authenticated and Internet Identity initialization is complete.",
  "frontend/src/hooks/useIsCoarsePointer.ts": "Detects if the device has a coarse pointer (touch device) using CSS media query '(pointer: coarse)' and updates state on pointer type changes.",
  "frontend/src/hooks/useMissionAutosave.ts": "Provides debounced autosave functionality for mission title and tasks with change detection, queuing of pending updates during active saves, and mission switch handling. Tracks hydrated state to avoid saving unchanged data.",
  "frontend/src/hooks/useMissionsQueries.ts": "React Query hooks for mission CRUD operations (list, get, create, update, delete) with optimistic updates, targeted cache invalidation, and task status updates. Includes diagnostic logging and BigInt-safe sorting.",
  "frontend/src/hooks/useNotesQueries.ts": "React Query hooks for note operations across root, folders, and missions with concurrency-limited mutations (3 concurrent). Provides CRUD operations with targeted cache invalidation based on note location.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for file and folder operations including paginated file fetching, folder management, and file uploads with 3-concurrent upload limiting. Includes performance diagnostics and targeted cache invalidation.",
  "frontend/src/hooks/useSpeechToText.ts": "Custom hook wrapping Web Speech API for continuous speech recognition with interim and final transcript callbacks. Handles browser compatibility, error states, and prevents duplicate result processing.",
  "frontend/src/hooks/useStackedFiles.ts": "Zustand store for managing a stack of selected files with add, remove, and clear operations. Used for bulk file operations across the application.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light/dark themes including color schemes for notes (green), missions (purple), and sidebar. Defines OKLCH color space values and mobile-specific layout constraints.",
  "frontend/src/lib/utils.ts": "Utility function combining clsx and tailwind-merge for conditional CSS class name composition with proper Tailwind class conflict resolution.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient and InternetIdentityProvider context wrappers around the main App component.",
  "frontend/src/pages/HomePage.tsx": "Main home page component that orchestrates file uploads, gallery display, folders, missions, and authentication state. Manages multiple full-screen views (folders, missions, stack) with transition animations and handles newly uploaded file tracking.",
  "frontend/src/utils/actorInitializationMessaging.ts": "Provides error classification and user-facing messages for actor initialization failures, including detection of stopped canisters (IC0508), invalid admin tokens, and actor readiness errors.",
  "frontend/src/utils/externalOpen.ts": "Utilities for opening URLs externally, downloading files, and sharing via Web Share API. Includes popup-blocker detection using visibility/blur events.",
  "frontend/src/utils/fileBytesWorkerSingleton.ts": "Singleton wrapper for a Web Worker that reads file bytes with concurrency limiting (max 3 concurrent requests) and request queuing.",
  "frontend/src/utils/fileOpenRules.ts": "Determines how files should open (in-app viewer vs. download-only) based on file category (image, video, PDF, Office, or unsupported).",
  "frontend/src/utils/filePreview.ts": "Categorizes files by MIME type (image, video, PDF, Office, unsupported) and provides human-readable labels and preview capability checks.",
  "frontend/src/utils/missionCompletion.ts": "Calculates mission progress percentage, determines completion status (100% with at least 1 task), and splits missions into incomplete/completed lists.",
  "frontend/src/utils/missionTaskCompare.ts": "Provides BigInt-safe equality comparison for Task arrays by comparing taskId, task text, and completed status without JSON.stringify.",
  "frontend/src/utils/notesTime.ts": "Empty utility file, likely a placeholder for future notes-related time functionality.",
  "frontend/src/utils/performanceDiagnostics.ts": "Opt-in performance diagnostics utility (via localStorage or URL param) that tracks operation timings and logs them to console for debugging.",
  "frontend/src/utils/persistedUploadQueue.ts": "IndexedDB-based upload queue that persists file uploads (up to 50MB) with progress tracking, allowing enqueue, progress updates, completion marking, and retrieval of incomplete uploads.",
  "frontend/src/utils/reactQueryDiagnostics.ts": "Development-only logging utility for React Query mutation lifecycle phases (start, success, error, settled) with timestamps.",
  "frontend/src/utils/smokeTestCoreFlows.ts": "Development smoke test utility that validates core flows (folder, mission, link, note creation) via backend actor and formats results with pass/fail status.",
  "frontend/src/utils/uploadConcurrency.ts": "Provides concurrency limiters for upload tasks with queue management, including a cancellable variant with stats tracking.",
  "frontend/src/utils/urlParams.ts": "URL parameter utilities supporting hash-based and query-string routing, with sessionStorage persistence and parameter cleanup from URL.",
  "frontend/src/workers/fileBytes.worker.ts": "Web Worker that reads file bytes off the main thread, converting File objects to Uint8Array with error handling and transferable buffer optimization.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom OKLCH color system, sidebar/notes/missions theme colors, accordion animations, and typography plugin.",
  "frontend/V114_BASELINE_FRONTEND_FILES.txt": "Canonical list of all frontend files defining the v114 baseline, organized by category (core, pages, components, contexts, hooks, utilities, styling, PWA, configuration) for repeatable validation.",
  "project_state.json": "Project state tracking file management app features including gallery uploads, floating file stack with animations, mission/folder organization, and file operations."
}