{
  "backend/main.mo": "Motoko canister defining file, folder, user profile, and mission data models with health/diagnostic queries and access‑controlled user profile operations, plus storage and authorization mixins.",
  "feature_evidence.json": "Feature evidence report listing mission task‑toggle persistence features, associated frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Collection of short summaries describing the purpose and behavior of key frontend components, hooks, utilities, and styles.",
  "frontend/DRAFT_BASELINE_V114.md": "Documentation describing the creation and verification of a Draft baseline synced 1:1 with Live version 114, including validation steps and change‑control rules.",
  "frontend/index.css": "Defines Tailwind layers and CSS variables for light and dark themes plus base element styling.",
  "frontend/index.html": "HTML entrypoint configuring PWA metadata, icons, and loading the main React script.",
  "frontend/PAUSE_AFTER_RESTORE.md": "Change‑control notice declaring a post‑restore freeze on frontend modifications until explicit user approval.",
  "frontend/public/manifest.json": "PWA manifest describing app metadata, icons, and display behavior.",
  "frontend/public/sw.js": "Service worker implementing minimal precaching, runtime caching, and network‑first fetch handling.",
  "frontend/RESTORE_LIVE_V114_CHECKLIST.md": "Checklist verifying that the frontend fully matches Live version 114 across authentication, UI, components, hooks, styling, and behavior.",
  "frontend/src/App.tsx": "Main React app wrapper handling theming, context providers, and intro-screen logic based on authentication.",
  "frontend/src/components/ActorInitErrorState.tsx": "UI component showing error details and actions when actor initialization fails.",
  "frontend/src/components/AnimatedGalleryIcon.tsx": "Renders an animated SVG target-like gallery icon with hover effects.",
  "frontend/src/components/ConnectivityIndicator.tsx": "Empty component file with no implementation.",
  "frontend/src/components/DecorativeBottomLine.tsx": "Renders a fixed decorative bottom line for UI styling.",
  "frontend/src/components/ExternalOpenFallbackDialog.tsx": "Dialog prompting users to retry opening or download a file when browser pop‑ups are blocked.",
  "frontend/src/components/FilePreviewDialog.tsx": "Dialog for previewing files with support for images, videos, PDFs, and Office docs plus actions like download, open, delete, and moving files.",
  "frontend/src/components/FileUploadSection.tsx": "Handles file and link uploads, progress tracking, validation, and triggering backend upload mutations.",
  "frontend/src/components/FoldersButton.tsx": "Floating button that opens the folders UI, with optional disabled and overlay states.",
  "frontend/src/components/FoldersDialog.tsx": "Deprecated modal for listing, creating, renaming, and deleting folders using swipe actions and confirmation dialogs.",
  "frontend/src/components/FoldersFullScreenView.tsx": "Full‑screen folders view allowing creation, rename, deletion, and selection of folders with swipe actions.",
  "frontend/src/components/Footer.tsx": "Simple footer showing attribution and a link to caffeine.ai.",
  "frontend/src/components/FullScreenViewer.tsx": "Full‑screen file viewer with navigation, touch swiping, delete, download, sharing, and move actions.",
  "frontend/src/components/GallerySection.tsx": "Renders a file gallery with selection, long‑press, file-type detection, and viewer or external open behavior.",
  "frontend/src/components/Header.tsx": "Displays the app header with theme toggle, auth menu, and a progress bar.",
  "frontend/src/components/IntroScreen.tsx": "Shows a short animated splash screen and fades out before invoking a completion callback.",
  "frontend/src/components/LinkOpenFallbackDialog.tsx": "Dialog shown when external link opening fails, offering retry or copy-to-clipboard options.",
  "frontend/src/components/LoginButton.tsx": "Button triggering Internet Identity login with loading feedback.",
  "frontend/src/components/MissionDetailFullScreenView.tsx": "Full-screen mission view handling title editing, task management, autosave, and file viewing.",
  "frontend/src/components/MissionEditorDialog.tsx": "Dialog for creating missions with title input and task list editing.",
  "frontend/src/components/MissionsButton.tsx": "Floating button that opens the missions interface, with hover animation and disabled state.",
  "frontend/src/components/MissionsFullScreenView.tsx": "Full-screen mission list UI handling selection, creation, swipe actions, and deletion with progress tracking.",
  "frontend/src/components/MobileOnlyLayout.tsx": "Wrapper layout that restricts content to a mobile-only container.",
  "frontend/src/components/MoveToMissionDialog.tsx": "Dialog for selecting a mission and moving files into it, with loading and success handling.",
  "frontend/src/components/NotesButton.tsx": "Empty placeholder file.",
  "frontend/src/components/NotesDialog.tsx": "Empty placeholder file.",
  "frontend/src/components/NotesFullScreenView.tsx": "Empty placeholder file.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Empty placeholder file.",
  "frontend/src/components/SendToFolderDialog.tsx": "Dialog allowing files to be moved into folders or returned to the main collection with async operations.",
  "frontend/src/components/SwipeActionsRow.tsx": "Swipeable row component that reveals edit/delete actions with gesture handling.",
  "frontend/src/components/UnifiedProgressBar.tsx": "Global upload progress bar showing aggregate upload status.",
  "frontend/src/components/WelcomeIntroScreen.tsx": "Intro screen with branding graphics and login entry point.",
  "frontend/src/contexts/ActorContext.tsx": "No summary available.",
  "frontend/src/contexts/UploadContext.tsx": "No summary available.",
  "frontend/src/hooks/useActor.ts": "No summary available.",
  "frontend/src/hooks/useInternetIdentity.ts": "No summary available.",
  "frontend/src/hooks/useIsCoarsePointer.ts": "No summary available.",
  "frontend/src/hooks/useMissionAutosave.ts": "No summary available.",
  "frontend/src/hooks/useMissionsQueries.ts": "No summary available.",
  "frontend/src/hooks/useNotesQueries.ts": "No summary available.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching and mutating files and folders, including pagination and actor readiness checks.",
  "frontend/src/index.css": "Tailwind CSS setup defining theme variables for light and dark modes and global styles.",
  "frontend/src/lib/utils.ts": "Utility merging class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Entrypoint that renders the app with React Query and Internet Identity providers.",
  "frontend/src/pages/HomePage.tsx": "Main UI page managing folder, mission, and file views with authentication and optional smoke tests.",
  "frontend/src/utils/actorInitializationMessaging.ts": "Helpers for detecting and classifying actor initialization errors and generating standardized messages.",
  "frontend/src/utils/externalOpen.ts": "Utilities to open external URLs safely and download files via blob URLs.",
  "frontend/src/utils/fileOpenRules.ts": "Determines how files should be opened based on MIME type, including viewer, preview, or download-only modes.",
  "frontend/src/utils/filePreview.ts": "Categorizes file MIME types and provides previewability checks and human-readable labels.",
  "frontend/src/utils/notesTime.ts": "Empty file with no implemented logic.",
  "frontend/src/utils/performanceDiagnostics.ts": "Enables optional performance timing logs using localStorage or URL flags and provides helpers to time async operations.",
  "frontend/src/utils/reactQueryDiagnostics.ts": "Provides utilities to inspect React Query cache state for missions and log mutation lifecycle details.",
  "frontend/src/utils/smokeTestCoreFlows.ts": "Runs a multi‑step backend smoke test covering folder creation, mission creation, file upload, and list verification.",
  "frontend/src/utils/uploadConcurrency.ts": "Implements a simple promise concurrency limiter for controlled parallel task execution.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL parameters and session‑stored values.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, radius, animations, and plugins for the frontend.",
  "frontend/V114_BASELINE_FRONTEND_FILES.txt": "Canonical file list defining all frontend files included in the Live version 114 baseline for drift detection.",
  "project_state.json": "Describes project requirements focused on immediate background persistence of mission task toggles and related state handling."
}