{
  "backend/main.mo": "Motoko canister defining storage, authorization, user profiles, notes, missions, and file/blob management with pagination and health/diagnostic queries.",
  "feature_evidence.json": "Feature evidence report linking a swipe‑actions UI change to affected frontend components and associated metadata.",
  "frontend-file-summaries.txt": "List of summarized descriptions for all major frontend components and their behaviors.",
  "frontend/DRAFT_BASELINE_V114.md": "Documentation describing the creation of a new Draft fully synced with Live v114 and verifying 1:1 behavioral parity.",
  "frontend/index.css": "Global Tailwind and OKLCH theme variables with light/dark mode definitions and base styling rules.",
  "frontend/index.html": "HTML entry point configuring PWA metadata, icons, and loads the React app.",
  "frontend/PAUSE_AFTER_RESTORE.md": "Post‑restoration freeze notice outlining strict change‑control rules until explicit user approval.",
  "frontend/public/manifest.json": "PWA manifest defining app metadata, start behavior, and icon set.",
  "frontend/public/sw.js": "Service worker implementing minimal precaching and network‑first caching with runtime fallback.",
  "frontend/RESTORE_LIVE_V114_CHECKLIST.md": "Checklist verifying that the frontend was restored exactly to Live v114, covering authentication, UI, initialization, and configuration.",
  "frontend/src/App.tsx": "Main app wrapper handling theme, providers, and showing intro screen on fresh login.",
  "frontend/src/components/ActorInitErrorState.tsx": "UI component showing detailed actor initialization errors with retry and logout actions.",
  "frontend/src/components/AnimatedGalleryIcon.tsx": "SVG camera icon with hover animations and decorative effects.",
  "frontend/src/components/ConnectivityIndicator.tsx": "Empty placeholder component file.",
  "frontend/src/components/DecorativeBottomLine.tsx": "Renders a fixed subtle bottom border line for visual decoration.",
  "frontend/src/components/ExternalOpenFallbackDialog.tsx": "Dialog shown when a file cannot be opened externally, offering retry or download.",
  "frontend/src/components/FilePreviewDialog.tsx": "Dialog for previewing files with type‑specific rendering and actions like open, download, move, and delete.",
  "frontend/src/components/FileUploadSection.tsx": "Handles file selection and uploads with progress tracking, using backend actor readiness and toast notifications.",
  "frontend/src/components/FoldersButton.tsx": "Renders a fixed-position button that opens the folders UI, with disabled and hover states.",
  "frontend/src/components/FoldersDialog.tsx": "Provides a dialog to view, create, rename, and delete folders, including swipe actions and backend mutation handling.",
  "frontend/src/components/Footer.tsx": "Displays a footer with branding and a link to caffeine.ai.",
  "frontend/src/components/FullScreenViewer.tsx": "Full-screen file viewer with swipe navigation, delete, download, share, send-to-folder, and external open support.",
  "frontend/src/components/GallerySection.tsx": "Shows a gallery of files with selection, long‑press detection, previews, and integration with the full‑screen viewer.",
  "frontend/src/components/Header.tsx": "Top navigation bar with theme toggle, authentication menu, and a unified upload progress bar.",
  "frontend/src/components/IntroScreen.tsx": "Animated intro screen that plays a welcome animation before transitioning to the main app.",
  "frontend/src/components/LoginButton.tsx": "Login button that triggers Internet Identity authentication and shows a loading state during login.",
  "frontend/src/components/MissionDetailFullScreenView.tsx": "Full-screen mission detail editor allowing title edits, task management, progress calculation, and mission save/delete actions.",
  "frontend/src/components/MissionEditorDialog.tsx": "Dialog for creating new missions with title input and task list assembly, including task toggling and removal.",
  "frontend/src/components/MissionsButton.tsx": "Floating button that opens the missions interface with animated Target icon and disabled state handling.",
  "frontend/src/components/MissionsFullScreenView.tsx": "Top-level full-screen missions manager that lists missions, handles selection, creation, deletion, and opens detail views.",
  "frontend/src/components/NotesButton.tsx": "Floating button that opens the notes interface with animated FileText icon and disabled handling.",
  "frontend/src/components/NotesDialog.tsx": "Empty placeholder file for a notes dialog component.",
  "frontend/src/components/NotesFullScreenView.tsx": "Full-screen notes manager enabling listing, creation, editing, saving, and deleting notes with mobile-friendly editor behavior.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Empty placeholder file for a profile setup dialog component.",
  "frontend/src/components/SendToFolderDialog.tsx": "Dialog for moving files between folders or back to the main collection using folder list and mutation hooks.",
  "frontend/src/components/SwipeActionsRow.tsx": "Implements a swipeable row with drag gestures to reveal edit/delete actions and manages open state with touch and mouse events.",
  "frontend/src/components/UnifiedProgressBar.tsx": "Displays a global upload progress bar showing total percent and file count when uploads are active.",
  "frontend/src/components/WelcomeIntroScreen.tsx": "Renders a welcome screen with branding, description text, and a login button for Internet Identity.",
  "frontend/src/contexts/ActorContext.tsx": "Provides actor initialization with retry logic, error handling, and sign-out support based on Internet Identity.",
  "frontend/src/contexts/UploadContext.tsx": "Manages multiple upload batches, tracks per-file and aggregate progress, and exposes functions to start and update uploads.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor via React Query, reinitializing on identity changes and invalidating dependent queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity auth state, login, logout, and identity loading using DFINITY AuthClient.",
  "frontend/src/hooks/useIsCoarsePointer.ts": "Detects whether the device uses a coarse pointer such as touch input via a media query.",
  "frontend/src/hooks/useMissionsQueries.ts": "Wraps mission CRUD operations with React Query using the backend actor and handles cache invalidation and sorting.",
  "frontend/src/hooks/useNotesQueries.ts": "React Query hooks for listing, retrieving, creating, updating, and deleting notes using the backend actor with cache invalidation and diagnostics.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching and mutating files and folders, including pagination, folder management, and optimistic updates.",
  "frontend/src/index.css": "Tailwind CSS setup defining light/dark theme variables, component styles, and touch interaction optimizations.",
  "frontend/src/lib/utils.ts": "Utility function combining clsx and tailwind-merge to merge class names.",
  "frontend/src/main.tsx": "Application entry point that initializes React, React Query, Internet Identity, and global styles.",
  "frontend/src/pages/HomePage.tsx": "Main home page that manages authentication state, actor readiness, and displays file uploads, folders, notes, and missions views.",
  "frontend/src/utils/actorInitializationMessaging.ts": "Helpers to classify actor initialization errors and extract standardized messaging and error details.",
  "frontend/src/utils/externalOpen.ts": "Utilities to open URLs externally and download files via browser APIs.",
  "frontend/src/utils/fileOpenRules.ts": "Logic determining how files should open based on MIME category, including viewer, preview, or download behavior.",
  "frontend/src/utils/filePreview.ts": "Classifies files by MIME type, determines previewability, and returns human-readable type labels.",
  "frontend/src/utils/notesTime.ts": "Formats timestamps into relative time strings or short dates.",
  "frontend/src/utils/reactQueryDiagnostics.ts": "Provides React Query cache diagnostics for notes and missions plus delete-mutation lifecycle logging.",
  "frontend/src/utils/urlParams.ts": "Handles URL parameter extraction, session persistence, and cleanup for both query and hash routing.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, color tokens, animations, and plugins.",
  "frontend/V114_BASELINE_FRONTEND_FILES.txt": "Canonical file list defining the exact frontend contents of Live version 114 for drift detection and baseline validation.",
  "project_state.json": "Defines project metadata, feature descriptions, and state/version information for the app."
}