{
  "backend/main.mo": "Motoko canister defining data types and state for files, notes, folders, missions, tasks, and authorization, including health/diagnostic queries and storage mixins.",
  "feature_evidence.json": "Feature evidence report mapping three mission-related bug-fix requirements to affected frontend files and components with high-confidence validation.",
  "frontend-file-summaries.txt": "Reference file listing concise summaries for numerous frontend components, hooks, utils, and styling files describing their responsibilities and behaviors.",
  "frontend/DRAFT_BASELINE_V114.md": "Documentation establishing a 1:1 baseline with Live version 114, detailing verification steps, parity guarantees, and change-control rules.",
  "frontend/index.css": "Defines Tailwind layers and extensive CSS variables for light/dark themes plus base styling.",
  "frontend/index.html": "Sets up the main HTML entry with PWA metadata, icons, and loads the React app.",
  "frontend/PAUSE_AFTER_RESTORE.md": "Notice declaring a post-restore freeze prohibiting any code changes until explicit user approval, outlining allowed actions and change-control policy.",
  "frontend/public/manifest.json": "PWA manifest defining app metadata, icons, and display settings.",
  "frontend/public/sw.js": "Service worker handling minimal precaching, runtime caching, and network-first fetch logic.",
  "frontend/RESTORE_LIVE_V114_CHECKLIST.md": "Checklist confirming full restoration of frontend behavior to Live version 114, including authentication, initialization, UI, file management, styling, and utilities.",
  "frontend/src/App.tsx": "Main app wrapper handling theming, providers, and conditional intro screen based on authentication state.",
  "frontend/src/components/ActorInitErrorState.tsx": "UI component showing error details and actions when actor initialization fails.",
  "frontend/src/components/AnimatedGalleryIcon.tsx": "SVG-based animated gallery target icon with hover effects.",
  "frontend/src/components/ConnectivityIndicator.tsx": "Empty component file with no implementation.",
  "frontend/src/components/DecorativeBottomLine.tsx": "Renders a fixed decorative bottom line separator.",
  "frontend/src/components/ExternalOpenFallbackDialog.tsx": "Dialog prompting users to retry opening or download a file when blocked by the browser.",
  "frontend/src/components/FilePreviewDialog.tsx": "Provides a dialog to preview files of various types and includes actions like download, open in new tab, move, and delete.",
  "frontend/src/components/FileUploadSection.tsx": "Handles uploading files, creating links, and creating notes with progress tracking and validation.",
  "frontend/src/components/FoldersButton.tsx": "Renders a floating button that opens the folders view when clicked.",
  "frontend/src/components/FoldersDialog.tsx": "Deprecated folders management dialog supporting folder creation, renaming, deletion, and selection.",
  "frontend/src/components/FoldersFullScreenView.tsx": "Full‑screen interface for browsing, selecting, and managing folders including create, rename, and delete actions.",
  "frontend/src/components/Footer.tsx": "Displays the site footer with attribution and a link to caffeine.ai.",
  "frontend/src/components/FullScreenViewer.tsx": "Full‑screen file viewer with swipe navigation and actions like download, delete, share, and folder assignment.",
  "frontend/src/components/GallerySection.tsx": "Renders a gallery of files and notes with selection, long‑press actions, and viewers for images, videos, and notes.",
  "frontend/src/components/Header.tsx": "Displays the app header with theme toggle, auth menu, and a progress bar.",
  "frontend/src/components/IntroScreen.tsx": "Shows a brief splash animation and fades out before continuing.",
  "frontend/src/components/LinkOpenFallbackDialog.tsx": "Dialog shown when a link can't open, offering retry or copy-to-clipboard options.",
  "frontend/src/components/LoginButton.tsx": "Login button that initiates Internet Identity authentication and shows loading state.",
  "frontend/src/components/MissionDetailFullScreenView.tsx": "Full‑screen mission view with autosave, task management, and file/note attachments with viewers.",
  "frontend/src/components/MissionEditorDialog.tsx": "Dialog for creating missions with title input and task list management.",
  "frontend/src/components/MissionsButton.tsx": "Floating button that opens missions, with hover animations and disabled handling.",
  "frontend/src/components/MissionsFullScreenView.tsx": "Full-screen mission list with selection, creation, swipe actions, and deletion handling using mission queries.",
  "frontend/src/components/MobileOnlyLayout.tsx": "Wrapper layout that constrains children to a mobile-only container.",
  "frontend/src/components/MoveToMissionDialog.tsx": "Dialog for moving selected files or notes into a mission with mutation handling and success feedback.",
  "frontend/src/components/NotesButton.tsx": "Empty file.",
  "frontend/src/components/NotesDialog.tsx": "Empty file.",
  "frontend/src/components/NotesFullScreenView.tsx": "Empty file.",
  "frontend/src/components/NoteViewerDialog.tsx": "Dialog for viewing a note with actions to download, share, send, or delete it.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Empty file.",
  "frontend/src/components/SendToFolderDialog.tsx": "Dialog for moving files or notes to folders or back to the main collection with performance diagnostics.",
  "frontend/src/components/SwipeActionsRow.tsx": "Component enabling left-swipe actions (edit/delete) with pointer gesture handling and open-state control.",
  "frontend/src/components/UnifiedProgressBar.tsx": "Displays a unified upload progress bar when uploads are active.",
  "frontend/src/components/WelcomeIntroScreen.tsx": "Renders an introductory screen with a target-themed SVG icon, descriptive text, and a login button.",
  "frontend/src/contexts/ActorContext.tsx": "Provides a React context that initializes and manages a backend actor with retry, error handling, and admin token support.",
  "frontend/src/contexts/UploadContext.tsx": "Manages upload batches, progress updates, and completion using a React context with batched animation-frame updates.",
  "frontend/src/hooks/useActor.ts": "Fetches and maintains a backend actor instance via react-query, recreating it when identity changes.",
  "frontend/src/hooks/useHomePrefetch.ts": "Prefetches folders, files, missions, and notes once when the backend actor becomes ready.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity provider and hook for login, logout, stored identity loading, and authentication state management.",
  "frontend/src/hooks/useIsCoarsePointer.ts": "Detects whether the device uses a coarse pointer such as touch and updates on changes.",
  "frontend/src/hooks/useMissionAutosave.ts": "Implements debounced autosaving for missions with change detection, mission switching resets, and queued saves during in‑flight updates.",
  "frontend/src/hooks/useMissionsQueries.ts": "Provides React Query hooks for listing, fetching, creating, and updating missions using a backend actor with cache management.",
  "frontend/src/hooks/useNotesQueries.ts": "Defines React Query hooks for creating, retrieving, moving, and deleting notes, with cache invalidation for related note lists.",
  "frontend/src/hooks/useQueries.ts": "Supplies React Query hooks for files and folders, including fetching by folder/mission and creating folders with concurrency‑limited uploads.",
  "frontend/src/index.css": "Sets Tailwind layers and theme variables for light and dark modes, including color schemes for notes and missions.",
  "frontend/src/lib/utils.ts": "Exports a utility function that merges class names using clsx and tailwind‑merge.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and loads global styles.",
  "frontend/src/pages/HomePage.tsx": "Main homepage component handling authentication, data prefetching, folder/mission views, and optional dev smoke tests.",
  "frontend/src/utils/actorInitializationMessaging.ts": "Utilities for classifying actor initialization errors and producing standardized user-facing messages.",
  "frontend/src/utils/externalOpen.ts": "Provides helpers for opening URLs, downloading files or notes, and sharing via Web Share API.",
  "frontend/src/utils/fileOpenRules.ts": "Defines rules for how files should open based on MIME type, determining viewer, download, or office preview behavior.",
  "frontend/src/utils/filePreview.ts": "Categorizes MIME types and provides helpers for determining previewability and generating human-readable file labels.",
  "frontend/src/utils/missionTaskCompare.ts": "Compares two task arrays safely with BigInt support to determine equality.",
  "frontend/src/utils/notesTime.ts": "Empty placeholder file with no implemented logic.",
  "frontend/src/utils/performanceDiagnostics.ts": "Lightweight opt-in timing utility for logging performance metrics and wrapping async operations.",
  "frontend/src/utils/reactQueryDiagnostics.ts": "Tools for inspecting React Query cache state and logging mission delete lifecycle events for debugging.",
  "frontend/src/utils/smokeTestCoreFlows.ts": "Implements a smoke test that exercises folder creation, mission creation, file upload, and list verification using backend APIs.",
  "frontend/src/utils/uploadConcurrency.ts": "Provides a simple concurrency limiter class to control the number of parallel promise executions.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL and session-based parameters, including hash routing support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, radii, animations, and loading required plugins.",
  "frontend/V114_BASELINE_FRONTEND_FILES.txt": "Canonical list of all frontend files defining the Live v114 baseline used for parity verification and drift detection.",
  "project_state.json": "Holds project metadata, architectural notes, and known issues, including the mission task toggle bug to be fixed."
}