{
  "backend/main.mo": "Motoko canister implementing file, folder, mission, and user‑profile management with access control, storage mixins, and diagnostic/health queries.",
  "feature_evidence.json": "Feature evidence report mapping two splash‑screen related features to their affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "Collection of autogenerated summaries describing the functionality and purpose of key frontend React components, hooks, utilities, and styles.",
  "frontend/DRAFT_BASELINE_V114.md": "Documentation establishing a v114 frontend baseline, detailing verification steps, parity checks, and change‑control rules.",
  "frontend/index.css": "Sets Tailwind layers and defines extensive CSS variables for light and dark themes with global base styles.",
  "frontend/index.html": "Defines the base HTML document with PWA meta tags, icons, and mounts the app entrypoint.",
  "frontend/PAUSE_AFTER_RESTORE.md": "Change‑freeze notice stating no frontend modifications are permitted post‑restoration until explicit user approval.",
  "frontend/public/manifest.json": "PWA manifest configuring app metadata, theme colors, startup behavior, and icons.",
  "frontend/public/sw.js": "Implements a service worker with minimal precaching, network-first fetch strategy, and runtime caching.",
  "frontend/RESTORE_LIVE_V114_CHECKLIST.md": "Checklist confirming the frontend was restored to match Live v114, covering authentication, components, styling, and behavior validation.",
  "frontend/src/App.tsx": "Root React component managing theme, providers, authentication state, and an intro screen flow.",
  "frontend/src/components/ActorInitErrorState.tsx": "Renders a detailed error UI for failed actor initialization with retry, logout, and expandable technical info.",
  "frontend/src/components/AnimatedGalleryIcon.tsx": "Displays an animated SVG target-style icon with hover effects.",
  "frontend/src/components/ConnectivityIndicator.tsx": "Empty component placeholder.",
  "frontend/src/components/DecorativeBottomLine.tsx": "Renders a fixed decorative bottom line for UI styling.",
  "frontend/src/components/ExternalOpenFallbackDialog.tsx": "Dialog shown when a file cannot open externally, offering retry or download actions.",
  "frontend/src/components/FilePreviewDialog.tsx": "Modal for previewing files with support for images, video, PDFs, Office docs, and actions like download, delete, send to folder, and move to mission.",
  "frontend/src/components/FileUploadSection.tsx": "UI for uploading files or adding links, handling progress, validation, and backend mutations.",
  "frontend/src/components/FoldersButton.tsx": "Floating button that opens the folders dialog when clicked.",
  "frontend/src/components/FoldersDialog.tsx": "Dialog for listing, creating, renaming, selecting, and deleting folders with swipe actions and backend integration.",
  "frontend/src/components/Footer.tsx": "Simple footer with attribution and external link.",
  "frontend/src/components/FullScreenViewer.tsx": "Full-screen file viewer with navigation, swipe support, file operations, and external open/download handling.",
  "frontend/src/components/GallerySection.tsx": "Gallery listing files with icons, previews, long-press selection mode, bulk actions, and integration with the full-screen viewer.",
  "frontend/src/components/Header.tsx": "Renders the top app header with theme toggle, auth icon menu, app title, and a progress bar.",
  "frontend/src/components/IntroScreen.tsx": "Displays an animated splash screen that plays once and then triggers completion.",
  "frontend/src/components/LinkOpenFallbackDialog.tsx": "Shows a dialog when external links fail to open, offering retry or copy options.",
  "frontend/src/components/LoginButton.tsx": "Provides a button to trigger Internet Identity login with loading state.",
  "frontend/src/components/MissionDetailFullScreenView.tsx": "Full‑screen mission editor displaying mission data, tasks, file previews, and save/delete actions.",
  "frontend/src/components/MissionEditorDialog.tsx": "Dialog for creating missions with title input and task management.",
  "frontend/src/components/MissionsButton.tsx": "Floating button that opens the missions interface with animated styling.",
  "frontend/src/components/MissionsFullScreenView.tsx": "Full‑screen view listing missions with create, delete, selection, and swipe actions.",
  "frontend/src/components/MobileOnlyLayout.tsx": "Wrapper enforcing a mobile-only layout container for its children.",
  "frontend/src/components/MoveToMissionDialog.tsx": "Dialog for selecting a mission and moving selected file IDs into it, with loading states and success/error toasts.",
  "frontend/src/components/NotesButton.tsx": "Empty file.",
  "frontend/src/components/NotesDialog.tsx": "Empty file.",
  "frontend/src/components/NotesFullScreenView.tsx": "Empty file.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Empty file.",
  "frontend/src/components/SendToFolderDialog.tsx": "Dialog for moving files into folders or back to the main collection, showing available folders and handling mutations.",
  "frontend/src/components/SwipeActionsRow.tsx": "Swipeable row component enabling edit/delete actions using pointer events with gesture handling.",
  "frontend/src/components/UnifiedProgressBar.tsx": "Global upload progress bar displaying total progress and item count from the upload context.",
  "frontend/src/components/WelcomeIntroScreen.tsx": "Intro screen with branding graphics and messaging, prompting users to log in.",
  "frontend/src/contexts/ActorContext.tsx": "Context managing backend actor initialization, retries, error states, and authentication linkage.",
  "frontend/src/contexts/UploadContext.tsx": "Context tracking upload batches, progress, and helper methods for starting, updating, and completing uploads.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor via react-query, recreating it on identity changes and invalidating related queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity context with login, logout, status management, and persisted identity loading.",
  "frontend/src/hooks/useIsCoarsePointer.ts": "Detects whether the device uses a coarse pointer (touch) and updates on pointer type changes.",
  "frontend/src/hooks/useMissionsQueries.ts": "Defines react-query hooks to list, fetch, create, and update missions using the backend actor.",
  "frontend/src/hooks/useNotesQueries.ts": "Empty placeholder file for future notes-related queries.",
  "frontend/src/hooks/useQueries.ts": "React-query hooks for fetching and mutating files and folders, including pagination and folder management.",
  "frontend/src/index.css": "Tailwind CSS setup defining light/dark theme tokens, layout rules, and custom design variables.",
  "frontend/src/lib/utils.ts": "Utility helper merging class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "App entry point initializing React, query client provider, and Internet Identity provider.",
  "frontend/src/pages/HomePage.tsx": "Main UI page handling authentication state, data fetching, smoke tests, and folder/mission UI flows.",
  "frontend/src/utils/actorInitializationMessaging.ts": "Defines standardized messages and helper functions to classify and serialize actor initialization and canister-related errors.",
  "frontend/src/utils/externalOpen.ts": "Provides utilities to open external URLs with popup-block detection and to download files via blob links.",
  "frontend/src/utils/fileOpenRules.ts": "Determines how files should open based on MIME type, deciding between in-app viewing, office preview, or direct download.",
  "frontend/src/utils/filePreview.ts": "Categorizes files by MIME type and provides helpers to determine previewability and user-facing type labels.",
  "frontend/src/utils/notesTime.ts": "Empty file with no implemented logic.",
  "frontend/src/utils/reactQueryDiagnostics.ts": "Offers diagnostics for React Query mission caches and logs delete mutation lifecycle events.",
  "frontend/src/utils/smokeTestCoreFlows.ts": "Runs a backend smoke test covering folder creation, mission creation, file upload, and verification via list APIs.",
  "frontend/src/utils/urlParams.ts": "Utilities to read, persist, and clear URL parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, radius, animations, and plugin setup.",
  "frontend/V114_BASELINE_FRONTEND_FILES.txt": "Canonical file list enumerating all frontend files included in the Live v114 baseline for drift detection.",
  "project_state.json": "Defines the project’s current state, listing splash screen update requirements and pending fixes for uploads, folders, missions, and post-login splash behavior. Stores feature metadata, versions, and project configuration."
}