{
  "backend/main.mo": "Defines the backend actor with data types, authorization mixins, storage integration, and state variables for files, folders, notes, missions, and upload tracking.",
  "feature_evidence.json": "Feature evidence report documenting the removal of the 'MyGallery' header text and listing involved files, components, tests, and confidence.",
  "frontend-file-summaries.txt": "Contains summarized descriptions of major frontend components, hooks, and utilities covering app structure, UI behavior, and file management workflows.",
  "frontend/DRAFT_BASELINE_V114.md": "Documents creation of a Draft baseline identical to Live version 114, including verification steps, parity checks, and change‑control rules.",
  "frontend/index.css": "Defines Tailwind base styles and CSS variables for light and dark themes.",
  "frontend/index.html": "HTML entry point setting up PWA metadata, icons, root div, and service worker registration.",
  "frontend/PAUSE_AFTER_RESTORE.md": "Defines a post‑restoration change freeze, listing prohibited modifications and requiring explicit user approval for any further changes.",
  "frontend/public/manifest.json": "PWA manifest describing app metadata, start URL, icons, and display configuration.",
  "frontend/public/sw.js": "Service worker implementing precaching, runtime caching, cache cleanup, and offline fallback logic.",
  "frontend/PWA_INSTALLABILITY_NOTES.md": "Provides a checklist and troubleshooting guide for verifying PWA installability requirements, including manifest, service worker, and icon validation.",
  "frontend/RESTORE_LIVE_V114_CHECKLIST.md": "Checklist confirming the frontend was restored to match Live version 114, verifying app structure, authentication flows, components, styling, and utilities.",
  "frontend/src/App.tsx": "Main application wrapper configuring themes, React Query, providers, and rendering HomePage with intro and upload runner.",
  "frontend/src/components/ActorInitErrorState.tsx": "Displays a detailed error screen for actor initialization failures with retry, logout, and expandable technical details.",
  "frontend/src/components/AnimatedGalleryIcon.tsx": "SVG-based animated gallery icon with hover effects and target-style graphics.",
  "frontend/src/components/ConnectivityIndicator.tsx": "Empty placeholder file with no implementation.",
  "frontend/src/components/DecorativeBottomLine.tsx": "Renders a fixed bottom horizontal decorative line across the screen.",
  "frontend/src/components/ExternalOpenFallbackDialog.tsx": "Dialog shown when a browser blocks opening a file, offering retry and download actions.",
  "frontend/src/components/FilePreviewDialog.tsx": "Dialog for previewing files with support for multiple media types and actions like open, download, move, and delete.",
  "frontend/src/components/FileUploadSection.tsx": "Component handling file, link, and note uploads with concurrency control and speech-to-text integration.",
  "frontend/src/components/FoldersButton.tsx": "Floating button that opens the folders view with optional pulse and overlay behavior.",
  "frontend/src/components/FoldersDialog.tsx": "Deprecated folder management dialog for creating, renaming, selecting, and deleting folders.",
  "frontend/src/components/FoldersFullScreenView.tsx": "Full-screen folders interface enabling creation, editing, deletion, and selection of folders.",
  "frontend/src/components/Footer.tsx": "Footer displaying copyright text and link attribution.",
  "frontend/src/components/FullScreenViewer.tsx": "Provides a full-screen file viewer with swipe navigation, download, delete, share, move, and external-open handling.",
  "frontend/src/components/GallerySection.tsx": "Displays files and notes in a gallery with selection, preview, actions, and folder/mission management.",
  "frontend/src/components/Header.tsx": "Renders the top navigation bar with theme toggle, auth menu, and progress bar.",
  "frontend/src/components/HomeSharedElementTransitionLayer.tsx": "Implements shared-element transition animations between home sections using DOMRects.",
  "frontend/src/components/IntroScreen.tsx": "Shows a timed splash screen with a fading animated icon before main UI loads.",
  "frontend/src/components/LinkOpenFallbackDialog.tsx": "Dialog shown when a link cannot be opened, offering retry and copy-to-clipboard options.",
  "frontend/src/components/LoginButton.tsx": "Button triggering Internet Identity login with loading feedback.",
  "frontend/src/components/MissionDetailFullScreenView.tsx": "Full-screen mission detail view handling tasks, autosave, attached files/notes, and viewer dialogs.",
  "frontend/src/components/MissionEditorDialog.tsx": "Dialog for creating missions with title and tasks, including task add/remove/toggle and mission submission.",
  "frontend/src/components/MissionsButton.tsx": "Floating button that opens the missions view, with optional disabled and pulse states.",
  "frontend/src/components/MissionsFullScreenView.tsx": "Full‑screen missions view with tabs, mission list, delete confirmation, and navigation to mission details or creation.",
  "frontend/src/components/MobileOnlyLayout.tsx": "Wrapper layout that restricts content to mobile‑only containers.",
  "frontend/src/components/MoveToMissionDialog.tsx": "Dialog for moving selected files or notes into a chosen mission, with loading and success handling.",
  "frontend/src/components/NotesButton.tsx": "Empty file.",
  "frontend/src/components/NotesDialog.tsx": "Empty file.",
  "frontend/src/components/NotesFullScreenView.tsx": "Empty file.",
  "frontend/src/components/NoteViewerDialog.tsx": "Dialog showing a note’s title and body with actions to download, share, move, or delete the note.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Empty file.",
  "frontend/src/components/SendToFolderDialog.tsx": "Dialog for moving or removing files and notes to or from folders, including performance diagnostics.",
  "frontend/src/components/SwipeActionsRow.tsx": "Interactive swipeable row component that reveals edit/delete actions and handles drag gestures.",
  "frontend/src/components/UnifiedProgressBar.tsx": "Displays a global progress bar summarizing all active uploads with item counts and total percentage.",
  "frontend/src/components/UploadQueueRunner.tsx": "Restores persisted uploads and processes them with concurrency limits, updating progress and completion state.",
  "frontend/src/components/WelcomeIntroScreen.tsx": "Intro screen with a target-themed graphic and text, prompting users to sign in via a login button.",
  "frontend/src/contexts/ActorContext.tsx": "Manages backend actor initialization, retries, error handling, and exposes actor state and sign-out logic.",
  "frontend/src/contexts/UploadContext.tsx": "Tracks file, link, and note uploads, providing progress updates, completion handling, and item restoration.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an actor tied to the user identity, initializing access control and refreshing dependent queries.",
  "frontend/src/hooks/useHomePrefetch.ts": "Prefetches folders, files, missions, and notes once when the backend actor and identity are ready. Resets prefetch state on logout.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context with login, logout, identity loading, and status tracking. Wraps AuthClient setup and exposes a hook for consuming identity state.",
  "frontend/src/hooks/useIntroOnAppResume.ts": "Calls a callback when the app regains focus or becomes visible, but only after identity is initialized and authenticated.",
  "frontend/src/hooks/useIsCoarsePointer.ts": "Detects whether the device uses a coarse pointer such as touch and updates on media query changes.",
  "frontend/src/hooks/useMissionAutosave.ts": "Debounces and queues mission title/task updates, performing autosaves only when data changes and handling mission switching. Manages pending saves and mutation coordination.",
  "frontend/src/hooks/useMissionsQueries.ts": "Provides React Query hooks for listing, fetching, creating, and updating missions with sorting, invalidation, and actor readiness checks.",
  "frontend/src/hooks/useNotesQueries.ts": "Supplies React Query hooks for fetching and mutating notes in folders, missions, or root with concurrency‑limited creation and targeted cache invalidation.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating files and folders through a backend actor with readiness checks and caching settings.",
  "frontend/src/hooks/useSpeechToText.ts": "Implements a speech-to-text hook using the browser SpeechRecognition API with real-time transcripts and error handling.",
  "frontend/src/index.css": "Sets up Tailwind layers and defines extensive light/dark mode CSS variables for colors, themes, and layout styling.",
  "frontend/src/lib/utils.ts": "Provides a utility function that merges class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Initializes the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/pages/HomePage.tsx": "Implements the main home page with authentication checks, data prefetching, UI state for folders/missions, and optional dev smoke tests.",
  "frontend/src/utils/actorInitializationMessaging.ts": "Defines standardized actor initialization error messages and helper functions for classifying backend initialization errors.",
  "frontend/src/utils/externalOpen.ts": "Provides utilities for opening external URLs, downloading files or notes, and sharing files via Web Share API with visibility-based popup detection.",
  "frontend/src/utils/fileBytesWorkerSingleton.ts": "Manages a singleton web worker to read file bytes with concurrency control, request queuing, and error handling.",
  "frontend/src/utils/fileOpenRules.ts": "Determines how files should open based on MIME type, including viewer, download, or office preview behaviors.",
  "frontend/src/utils/filePreview.ts": "Classifies files by MIME type for preview support and provides human-readable type labels.",
  "frontend/src/utils/missionCompletion.ts": "Calculates mission progress, checks mission completion, and splits missions into incomplete and completed groups.",
  "frontend/src/utils/missionTaskCompare.ts": "Compares two task arrays safely with BigInt task IDs for equality.",
  "frontend/src/utils/notesTime.ts": "Empty file with no implementation.",
  "frontend/src/utils/performanceDiagnostics.ts": "Implements optional performance diagnostics with timing, logging, and async operation measurement.",
  "frontend/src/utils/persistedUploadQueue.ts": "Implements an IndexedDB-backed upload queue storing file bytes, metadata, progress, and completion state.",
  "frontend/src/utils/reactQueryDiagnostics.ts": "Logs React Query mutation phases in development for debugging.",
  "frontend/src/utils/smokeTestCoreFlows.ts": "Runs development smoke tests for folder, mission, link, and note creation via backend calls and formats results.",
  "frontend/src/utils/uploadConcurrency.ts": "Provides concurrency limiters for async tasks, including a cancellable version with stats and queue management.",
  "frontend/src/utils/urlParams.ts": "Utility for reading, persisting, and clearing URL and sessionStorage parameters, including hash-based routing support.",
  "frontend/src/workers/fileBytes.worker.ts": "Web worker that reads file bytes off-thread and returns metadata or an error response.",
  "frontend/tailwind.config.js": "TailwindCSS configuration extending colors, radius, animations, and theme settings with custom CSS variables.",
  "frontend/V114_BASELINE_FRONTEND_FILES.txt": "Lists all frontend files that define the canonical v114 baseline structure for verification.",
  "project_state.json": "Project state file defining metadata, existing features, and a pending request to remove the 'MyGallery' header text."
}