{
  "backend/main.mo": "Motoko backend defining types and state for files, folders, notes, missions, authorization, and health/diagnostic queries with storage mixins.",
  "feature_evidence.json": "Feature evidence report mapping mission-related UI features to frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Text file listing concise summaries of key frontend components, hooks, utilities, and styles.",
  "frontend/DRAFT_BASELINE_V114.md": "Documentation describing creation of a draft baseline synced exactly to Live version 114 and validation steps.",
  "frontend/index.css": "Defines Tailwind base layers and extensive light/dark theme CSS variables for global styling.",
  "frontend/index.html": "Main HTML entry point configuring PWA metadata, icons, and loading the React app root.",
  "frontend/PAUSE_AFTER_RESTORE.md": "Change-freeze notice prohibiting code changes after restoring Live v114 until explicit user approval.",
  "frontend/public/manifest.json": "PWA manifest declaring app metadata, icons, display behavior, and related settings.",
  "frontend/public/sw.js": "Implements a lightweight service worker with minimal precaching, network-first fetch logic, and cache cleanup.",
  "frontend/RESTORE_LIVE_V114_CHECKLIST.md": "Checklist verifying that the restored frontend matches Live v114 across authentication, UI, components, and behavior.",
  "frontend/src/App.tsx": "Root React application wiring theme providers and contexts, showing HomePage and optional intro overlay based on identity state.",
  "frontend/src/components/ActorInitErrorState.tsx": "UI component displaying detailed actor initialization errors with retry, logout, and expandable technical info.",
  "frontend/src/components/AnimatedGalleryIcon.tsx": "Renders an animated SVG gallery icon with hover effects and pulse animation.",
  "frontend/src/components/ConnectivityIndicator.tsx": "Empty file placeholder for a future connectivity indicator component.",
  "frontend/src/components/DecorativeBottomLine.tsx": "Adds a fixed subtle bottom line element for UI decoration.",
  "frontend/src/components/ExternalOpenFallbackDialog.tsx": "Dialog prompting users to retry opening a blocked file or download it instead.",
  "frontend/src/components/FilePreviewDialog.tsx": "Dialog showing previews for various file types with actions like open, download, move, and delete.",
  "frontend/src/components/FileUploadSection.tsx": "Component handling file uploads, link creation, and note creation with progress tracking and validation.",
  "frontend/src/components/FoldersButton.tsx": "Floating button that opens the folders interface, with optional disabled and overlay states.",
  "frontend/src/components/FoldersDialog.tsx": "Deprecated folder management dialog allowing creation, renaming, deleting, and selecting folders.",
  "frontend/src/components/FoldersFullScreenView.tsx": "Full-screen folder manager supporting creation, editing, deletion, and selection of folders.",
  "frontend/src/components/Footer.tsx": "Footer displaying copyright info and a link to caffeine.ai.",
  "frontend/src/components/FullScreenViewer.tsx": "Full-screen file viewer with navigation, swipe support, external open, sharing, moving, and deletion features.",
  "frontend/src/components/GallerySection.tsx": "Displays files and notes in a gallery with selection, long‑press actions, and viewer dialogs.",
  "frontend/src/components/Header.tsx": "Renders the top app header with theme toggle, authentication menu, and progress bar.",
  "frontend/src/components/IntroScreen.tsx": "Shows a brief animated splash screen and fades out before signaling completion.",
  "frontend/src/components/LinkOpenFallbackDialog.tsx": "Dialog shown when a link fails to open, offering retry and copy‑to‑clipboard options.",
  "frontend/src/components/LoginButton.tsx": "Button that triggers Internet Identity login and shows loading state.",
  "frontend/src/components/MissionDetailFullScreenView.tsx": "Full‑screen mission view with tasks, autosave, attached files/notes, and viewer dialogs.",
  "frontend/src/components/MissionEditorDialog.tsx": "Dialog for creating missions with title and task list management.",
  "frontend/src/components/MissionsButton.tsx": "Floating button that opens the missions section.",
  "frontend/src/components/MissionsFullScreenView.tsx": "Full-screen mission list UI handling mission creation, editing, deletion, swipe actions, and switching between incomplete and completed missions.",
  "frontend/src/components/MobileOnlyLayout.tsx": "Layout wrapper that restricts content to a mobile-only container.",
  "frontend/src/components/MoveToMissionDialog.tsx": "Dialog for moving selected files or notes into a mission, listing missions and executing move mutations.",
  "frontend/src/components/NotesButton.tsx": "Empty placeholder component file.",
  "frontend/src/components/NotesDialog.tsx": "Empty placeholder component file.",
  "frontend/src/components/NotesFullScreenView.tsx": "Empty placeholder component file.",
  "frontend/src/components/NoteViewerDialog.tsx": "Dialog for viewing a note with actions for sending, downloading, sharing, or deleting the note.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Empty placeholder component file.",
  "frontend/src/components/SendToFolderDialog.tsx": "Dialog for moving or removing files and notes to or from folders, with performance diagnostics.",
  "frontend/src/components/SwipeActionsRow.tsx": "Swipeable row component exposing edit and delete actions with drag handling and animations.",
  "frontend/src/components/UnifiedProgressBar.tsx": "Global upload progress bar showing aggregate upload progress and item count.",
  "frontend/src/components/WelcomeIntroScreen.tsx": "Renders a full‑screen welcome intro with animated text, a target‑style SVG icon, and a login button.",
  "frontend/src/contexts/ActorContext.tsx": "Provides a context managing backend actor initialization, retries, errors, and sign‑out logic with exponential backoff.",
  "frontend/src/contexts/UploadContext.tsx": "Manages upload batches, progress updates, and completion tracking with aggregated animation‑frame progress flushing.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor via React Query, reinitializing on identity changes and invalidating dependent queries.",
  "frontend/src/hooks/useHomePrefetch.ts": "Prefetches folders, files, missions, and notes once when the actor becomes ready to speed up home screen loading.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity auth context with login, logout, persistence, and identity state management.",
  "frontend/src/hooks/useIsCoarsePointer.ts": "Detects whether the device uses a coarse (touch) pointer via a media query and updates on changes.",
  "frontend/src/hooks/useMissionAutosave.ts": "Provides debounced mission autosave logic with change detection, pending save queuing, and mission-switch resets.",
  "frontend/src/hooks/useMissionsQueries.ts": "React Query hooks for listing, fetching, creating, and updating missions with backend actor integration and cache management.",
  "frontend/src/hooks/useNotesQueries.ts": "React Query hooks for creating, retrieving, deleting, and moving notes, with targeted cache invalidation.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for managing files and folders, including listing, mission-specific queries, and folder creation with concurrency-limited uploads.",
  "frontend/src/index.css": "Tailwind CSS configuration defining light/dark theme variables and shared UI styles.",
  "frontend/src/lib/utils.ts": "Utility function for merging class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Application entry point setting up React Query, Internet Identity, global styles, and rendering the app.",
  "frontend/src/pages/HomePage.tsx": "Main home screen component managing auth state, data prefetching, and lazy-loaded folder/mission views with optional dev smoke testing.",
  "frontend/src/utils/actorInitializationMessaging.ts": "Defines error messages and helpers for classifying actor initialization, token, and canister-state errors.",
  "frontend/src/utils/externalOpen.ts": "Provides utilities for opening external URLs, downloading files or notes, and sharing files via Web Share API.",
  "frontend/src/utils/fileOpenRules.ts": "Determines how files should open based on MIME type, including viewer vs download vs office preview logic.",
  "frontend/src/utils/filePreview.ts": "Categorizes files by MIME type and provides previewability and human-readable type labels.",
  "frontend/src/utils/missionCompletion.ts": "Calculates mission progress, checks completion, and splits missions into completed and incomplete groups.",
  "frontend/src/utils/missionTaskCompare.ts": "Compares task arrays safely with BigInt-aware equality checks.",
  "frontend/src/utils/notesTime.ts": "Empty file with no implemented logic.",
  "frontend/src/utils/performanceDiagnostics.ts": "Implements an opt-in performance timing utility with start/end measurements and async operation timing helpers.",
  "frontend/src/utils/reactQueryDiagnostics.ts": "Provides diagnostics for React Query mission caches and logs delete mutation lifecycle details.",
  "frontend/src/utils/smokeTestCoreFlows.ts": "Implements a multi‑step smoke test that creates folders, missions, uploads a file, creates a link, and verifies each via list APIs.",
  "frontend/src/utils/uploadConcurrency.ts": "Provides a simple promise‑based concurrency limiter to control the number of parallel async operations.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading URL parameters, persisting them in sessionStorage, and manipulating hash-based query params.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, radii, animations, and registering plugins.",
  "frontend/V114_BASELINE_FRONTEND_FILES.txt": "Lists all frontend files that define the canonical v114 baseline for validation and drift detection.",
  "project_state.json": "Describes project state and requirements for mission archiving, swipe navigation, deletion, and reclassification behaviors."
}