{
  "backend/main.mo": "Motoko backend defining file, folder, mission, and user profile types with authorization, storage mixins, and basic query/mutation methods including health checks and mission creation.",
  "feature_evidence.json": "Feature evidence report mapping two features to affected frontend files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "JSON-like mapping of frontend file paths to short functional summaries for each component, hook, and utility.",
  "frontend/DRAFT_BASELINE_V114.md": "Documentation describing creation and validation of Draft baseline synced exactly to Live version 114 with detailed parity checks.",
  "frontend/index.css": "Defines Tailwind layers and theme CSS variables for light and dark modes, applying global background, text, and border styles.",
  "frontend/index.html": "HTML entry point setting up metadata, favicons, PWA config, and loading the main React app.",
  "frontend/PAUSE_AFTER_RESTORE.md": "Change-control notice declaring a code freeze after restoring Live version 114 until explicit user approval is given.",
  "frontend/public/manifest.json": "PWA manifest defining app name, theme, icons, and display settings for MyGallery.",
  "frontend/public/sw.js": "Service worker implementing minimal precaching, network-first fetch handling, and cache cleanup for the PWA.",
  "frontend/RESTORE_LIVE_V114_CHECKLIST.md": "Checklist verifying that all frontend files and behaviors match Live version 114, covering authentication, actor initialization, UI, styling, and utilities.",
  "frontend/src/App.tsx": "Root React component configuring theme and context providers and showing an intro screen after login.",
  "frontend/src/components/ActorInitErrorState.tsx": "UI component showing detailed error states for actor initialization with retry and logout actions.",
  "frontend/src/components/AnimatedGalleryIcon.tsx": "React component rendering an animated target-style SVG icon with hover effects.",
  "frontend/src/components/ConnectivityIndicator.tsx": "Compact indicator showing backend connection or initialization status based on actor context.",
  "frontend/src/components/DecorativeBottomLine.tsx": "Renders a fixed subtle bottom line used as a decorative UI element.",
  "frontend/src/components/ExternalOpenFallbackDialog.tsx": "Dialog prompting users to retry opening or download a file when a popup is blocked.",
  "frontend/src/components/FilePreviewDialog.tsx": "Displays a dialog for previewing files with support for images, video, PDFs, and Office docs, and provides actions like download, open externally, move, and delete.",
  "frontend/src/components/FileUploadSection.tsx": "Handles file and link uploads with progress tracking, validation, and backend mutation calls.",
  "frontend/src/components/FoldersButton.tsx": "Renders a floating button that opens the folders dialog, with disabled and hover states.",
  "frontend/src/components/FoldersDialog.tsx": "Displays a dialog for listing, creating, renaming, and deleting folders with swipe actions and backend mutations.",
  "frontend/src/components/Footer.tsx": "Simple footer showing copyright info and a link to caffeine.ai.",
  "frontend/src/components/FullScreenViewer.tsx": "Full‑screen viewer for navigating files with swipe gestures and actions like delete, download, share, move, and open externally.",
  "frontend/src/components/GallerySection.tsx": "Displays a gallery of files with selection, long‑press behavior, file actions, and integration with the full‑screen viewer.",
  "frontend/src/components/Header.tsx": "Header with theme toggle, authentication dropdown, connectivity indicator, and progress bar.",
  "frontend/src/components/InternetIdentityInitFallbackScreen.tsx": "Fallback screen offering retry, login, and reload actions when Internet Identity initialization times out.",
  "frontend/src/components/IntroScreen.tsx": "Intro animation screen displaying a welcome message and transitioning to the app after animation completes.",
  "frontend/src/components/LinkOpenFallbackDialog.tsx": "Dialog shown when a link cannot open, offering retry and copy-to-clipboard options.",
  "frontend/src/components/LoginButton.tsx": "Button triggering Internet Identity login with loading feedback.",
  "frontend/src/components/MissionDetailFullScreenView.tsx": "Full-screen mission detail editor supporting task editing, file viewing, progress tracking, and deletion.",
  "frontend/src/components/MissionEditorDialog.tsx": "Dialog for creating missions with title entry and task management.",
  "frontend/src/components/MissionsButton.tsx": "Floating button that opens the missions interface.",
  "frontend/src/components/MissionsFullScreenView.tsx": "Full-screen mission list with creation, deletion, and selection navigation to mission details.",
  "frontend/src/components/MobileOnlyLayout.tsx": "Layout wrapper that displays content only in mobile-oriented view.",
  "frontend/src/components/MoveToMissionDialog.tsx": "Dialog for selecting a mission and moving selected file IDs into it, with loading states and success/error toasts.",
  "frontend/src/components/NotesButton.tsx": "Empty file.",
  "frontend/src/components/NotesDialog.tsx": "Empty file.",
  "frontend/src/components/NotesFullScreenView.tsx": "Empty file.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Empty file.",
  "frontend/src/components/SendToFolderDialog.tsx": "Dialog that lets users move files into folders or back to the main collection, handling loading and mutations.",
  "frontend/src/components/SwipeActionsRow.tsx": "Swipeable row component that reveals edit/delete actions using pointer gesture handling and controlled open state.",
  "frontend/src/components/UnifiedProgressBar.tsx": "Global upload progress bar that shows total progress and item count when uploads are active.",
  "frontend/src/components/WelcomeIntroScreen.tsx": "Intro screen with branding graphics and login entry point for the app.",
  "frontend/src/contexts/ActorContext.tsx": "Context managing backend actor initialization with retries, error handling, and identity changes.",
  "frontend/src/contexts/UploadContext.tsx": "Context tracking upload batches, progress updates, and completion for file and link uploads.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the current identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInitializationTimeout.ts": "Tracks whether an initialization process exceeds a timeout and provides a reset function.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication state, login/logout helpers, and loads stored identities.",
  "frontend/src/hooks/useIsCoarsePointer.ts": "Detects whether the device uses a coarse pointer like touch input.",
  "frontend/src/hooks/useMissionsQueries.ts": "Defines React Query hooks for listing, fetching, creating, and updating missions using the backend actor.",
  "frontend/src/hooks/useNotesQueries.ts": "Empty file with no implemented logic.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching and mutating files and folders through the backend actor.",
  "frontend/src/index.css": "Defines global Tailwind styles and CSS variables for light and dark themes.",
  "frontend/src/lib/utils.ts": "Exports a helper for merging class names with Tailwind utilities.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/HomePage.tsx": "Main app page controlling authentication state, folder and mission dialogs, data fetching, and optional dev smoke tests.",
  "frontend/src/utils/actorInitializationMessaging.ts": "Defines actor initialization error messages and helpers for classifying backend and token-related errors.",
  "frontend/src/utils/externalOpen.ts": "Provides utilities for opening URLs in new tabs with popup-block detection and downloading files via blob URLs.",
  "frontend/src/utils/fileOpenRules.ts": "Determines how files should open based on MIME type, including viewer support, downloads, and Office previews.",
  "frontend/src/utils/filePreview.ts": "Classifies MIME types into preview categories and returns human-readable file type labels.",
  "frontend/src/utils/notesTime.ts": "Empty placeholder file.",
  "frontend/src/utils/reactQueryDiagnostics.ts": "Developer utilities for inspecting React Query cache state and logging mutation lifecycles for debugging.",
  "frontend/src/utils/smokeTestCoreFlows.ts": "Implements an automated smoke test that creates folders, missions, uploads files, and verifies results via backend APIs.",
  "frontend/src/utils/urlParams.ts": "Helper functions to read URL parameters (including hash routing) and persist them in sessionStorage, plus utilities to clear stored or hash parameters.",
  "frontend/tailwind.config.js": "Tailwind config extending theme colors, radius, animations, and enabling plugins for typography and animations.",
  "frontend/V114_BASELINE_FRONTEND_FILES.txt": "Canonical file list enumerating all frontend files that define the Live version 114 baseline for parity validation.",
  "project_state.json": "Project metadata describing the current fix request, known issues, and existing feature requirements for resolving an indefinite loading state."
}