{
  "backend/main.mo": "Defines the backend actor, data types, mission/files/notes structures, and storage plus authorization state with various counters and maps initialized.",
  "feature_evidence.json": "Lists feature evidence entries linking specific frontend components to feature requirements for folder and mission swipe‑to‑delete fixes.",
  "frontend-file-summaries.txt": "Contains short descriptive summaries for many frontend files detailing their roles and behaviors.",
  "frontend/DRAFT_BASELINE_V114.md": "Documentation of creating a Draft baseline identical to Live v114 with verification steps and change‑control rules.",
  "frontend/index.css": "Defines Tailwind base styles and theme variables for light and dark modes.",
  "frontend/index.html": "Main HTML entry defining meta tags, PWA settings, icons, and service worker registration.",
  "frontend/PAUSE_AFTER_RESTORE.md": "Freeze notice prohibiting code changes after restoring Live v114 until explicit user approval.",
  "frontend/public/manifest.json": "PWA manifest specifying app metadata, icons, and configuration.",
  "frontend/public/sw.js": "Service worker handling precaching, caching strategy, and updates for the PWA.",
  "frontend/PWA_INSTALLABILITY_NOTES.md": "Checklist and guidance for verifying PWA installability on Chrome for Android including manifest, service worker, and icon requirements.",
  "frontend/RESTORE_LIVE_V114_CHECKLIST.md": "Restoration checklist confirming frontend parity with Live v114 across authentication, initialization, components, styling, and utilities.",
  "frontend/src/App.tsx": "Wraps the app in providers and renders HomePage with intro and upload queue behaviors.",
  "frontend/src/components/ActorInitErrorState.tsx": "UI component displaying error details and actions when actor initialization fails.",
  "frontend/src/components/AnimatedGalleryIcon.tsx": "Renders an animated target-style SVG icon with hover effects.",
  "frontend/src/components/ConnectivityIndicator.tsx": "Empty file placeholder for a connectivity indicator component.",
  "frontend/src/components/DecorativeBottomLine.tsx": "Renders a fixed bottom decorative line for UI styling.",
  "frontend/src/components/ExternalOpenFallbackDialog.tsx": "Dialog warning that a file couldn't open in a new window, offering retry and download actions.",
  "frontend/src/components/FilePreviewDialog.tsx": "Displays a file preview with actions like open, download, move, and delete, supporting multiple file types.",
  "frontend/src/components/FileUploadSection.tsx": "Handles file, link, and note uploads with concurrency control, speech-to-text, and progress tracking.",
  "frontend/src/components/FoldersButton.tsx": "Floating button that opens the folders view, with optional disabled and pulse states.",
  "frontend/src/components/FoldersDialog.tsx": "Deprecated folder management dialog enabling creation, rename, selection, and deletion of folders.",
  "frontend/src/components/FoldersFullScreenView.tsx": "Full‑screen interface for browsing and managing folders with create, rename, and delete actions.",
  "frontend/src/components/Footer.tsx": "Simple footer showing ©2025 attribution and a link to caffeine.ai.",
  "frontend/src/components/FullScreenViewer.tsx": "Full-screen viewer for navigating, sharing, deleting, and managing files with swipe gestures and fallback dialogs.",
  "frontend/src/components/GallerySection.tsx": "Displays files and notes in a gallery with selection, preview, bulk actions, and folder/mission operations.",
  "frontend/src/components/Header.tsx": "Top navigation bar with theme toggle, auth menu, and global progress bar.",
  "frontend/src/components/HomeSharedElementTransitionLayer.tsx": "Handles shared‑element transition animations between home UI sections using DOMRect measurements.",
  "frontend/src/components/IntroScreen.tsx": "Splash intro screen showing an animated icon and fading out after 2 seconds.",
  "frontend/src/components/LinkOpenFallbackDialog.tsx": "Dialog shown when a link fails to open, offering retry and copy‑link options.",
  "frontend/src/components/LoginButton.tsx": "Internet Identity login button with loading state feedback.",
  "frontend/src/components/MissionDetailFullScreenView.tsx": "Full‑screen mission view for editing title, tasks, attached files/notes, and opening viewers with autosave support.",
  "frontend/src/components/MissionEditorDialog.tsx": "Dialog for creating missions with title input and task management before submitting to backend.",
  "frontend/src/components/MissionsButton.tsx": "Floating mission launcher button with hover and pulse animations.",
  "frontend/src/components/MissionsFullScreenView.tsx": "Full-screen mission list with tabs, swipe actions, deletion, and detail navigation.",
  "frontend/src/components/MobileOnlyLayout.tsx": "Wrapper component that restricts content to a mobile-only layout container.",
  "frontend/src/components/MoveToMissionDialog.tsx": "Dialog for moving selected files or notes into an existing mission.",
  "frontend/src/components/NotesButton.tsx": "File is empty.",
  "frontend/src/components/NotesDialog.tsx": "File is empty.",
  "frontend/src/components/NotesFullScreenView.tsx": "File is empty.",
  "frontend/src/components/NoteViewerDialog.tsx": "Viewer dialog for a note with actions to download, share, move, or delete it.",
  "frontend/src/components/ProfileSetupDialog.tsx": "File is empty.",
  "frontend/src/components/SendToFolderDialog.tsx": "Dialog for moving files or notes to folders or returning them to the main collection.",
  "frontend/src/components/SwipeActionsRow.tsx": "Swipeable row component that reveals edit and delete actions, handling drag gestures and open state.",
  "frontend/src/components/UnifiedProgressBar.tsx": "Displays a fixed progress bar summarizing active uploads with type counts and overall progress.",
  "frontend/src/components/UploadQueueRunner.tsx": "Restores and resumes persisted uploads with concurrency control and progress tracking when the backend actor becomes ready.",
  "frontend/src/components/WelcomeIntroScreen.tsx": "Intro screen with a stylized target graphic and onboarding text plus a login button.",
  "frontend/src/contexts/ActorContext.tsx": "Context managing backend actor initialization with retry logic, admin token handling, and error reporting.",
  "frontend/src/contexts/UploadContext.tsx": "Context tracking file, link, and note upload items with progress updates, completion cleanup, and item restoration.",
  "frontend/src/hooks/useActor.ts": "Hook creating and caching an actor via react-query, initializing access control and invalidating dependent queries when identity changes.",
  "frontend/src/hooks/useHomePrefetch.ts": "Prefetches folders, gallery files, missions, and notes once when the backend actor and identity are ready. Resets the prefetch flag on logout.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context with login, logout, and identity state management using AuthClient. Loads stored identities and exposes status flags for authentication flow.",
  "frontend/src/hooks/useIntroOnAppResume.ts": "Runs a callback when the app regains focus or visibility, but only after identity initialization and authentication. Sets and cleans event listeners based on identity state.",
  "frontend/src/hooks/useIsCoarsePointer.ts": "Detects whether the device uses a coarse pointer via a media query and updates on changes. Returns true for touch devices.",
  "frontend/src/hooks/useMissionAutosave.ts": "Debounces mission updates and autosaves changes using updateMutation, handling queued saves and mission switching. Tracks last saved state to avoid unnecessary updates.",
  "frontend/src/hooks/useMissionsQueries.ts": "Provides mission list, detail, create, and update hooks using react-query, with sorting, cache invalidation, and actor readiness checks. Handles mission mutations with optimistic updates and error logging.",
  "frontend/src/hooks/useNotesQueries.ts": "Defines hooks for listing, creating, and deleting notes across root, folder, and mission contexts using react-query. Uses a concurrency limiter and targeted cache invalidations based on note location.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating files and folders via a backend actor with concurrency limits and readiness checks.",
  "frontend/src/hooks/useSpeechToText.ts": "Implements a speech-to-text hook using Web Speech API, handling interim/final results, errors, and microphone permissions.",
  "frontend/src/index.css": "Configures Tailwind layers and extensive light/dark theme CSS variables, including color systems and mobile layout rules.",
  "frontend/src/lib/utils.ts": "Provides a utility function to merge and normalize class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and loads global styles.",
  "frontend/src/pages/HomePage.tsx": "Home page component handling layout, authentication state, data prefetching, and lazy-loaded folder/mission views with UI transitions.",
  "frontend/src/utils/actorInitializationMessaging.ts": "Contains standardized messages and utilities for classifying and handling backend actor initialization and connectivity errors.",
  "frontend/src/utils/externalOpen.ts": "Provides utilities for opening URLs, downloading files or notes, and sharing files via Web Share API with popup-block detection.",
  "frontend/src/utils/fileBytesWorkerSingleton.ts": "Manages a singleton worker for reading file bytes with concurrency control and queued requests.",
  "frontend/src/utils/fileOpenRules.ts": "Defines rules for determining how files should open based on MIME type, including viewer, office preview, or download behavior.",
  "frontend/src/utils/filePreview.ts": "Classifies file MIME types into categories and provides labels and previewability checks.",
  "frontend/src/utils/missionCompletion.ts": "Calculates mission progress, checks completion, and splits missions into completed and incomplete groups.",
  "frontend/src/utils/missionTaskCompare.ts": "Compares arrays of tasks safely with BigInt IDs by checking IDs, text, and completion flags.",
  "frontend/src/utils/notesTime.ts": "Empty file with no implemented functionality.",
  "frontend/src/utils/performanceDiagnostics.ts": "Implements optional performance timing utilities controlled by flags, with async operation timing helpers.",
  "frontend/src/utils/persistedUploadQueue.ts": "Persists upload queue items in IndexedDB with size limits, progress updates, and completion tracking.",
  "frontend/src/utils/reactQueryDiagnostics.ts": "Logs React Query mission mutation phases for debugging in development mode.",
  "frontend/src/utils/smokeTestCoreFlows.ts": "Runs development-only smoke tests for creating folders, missions, links, and notes via backend APIs and formats test results.",
  "frontend/src/utils/uploadConcurrency.ts": "Provides concurrency limiters for async tasks, including a cancellable version with queue and stats.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, storing, and clearing URL and session parameters, supporting hash and query routing.",
  "frontend/src/workers/fileBytes.worker.ts": "Web worker that reads file bytes off the main thread and returns metadata or errors.",
  "frontend/tailwind.config.js": "Tailwind config extending colors, radius, animations, and enabling dark mode with plugins.",
  "frontend/V114_BASELINE_FRONTEND_FILES.txt": "Lists all frontend files defining the v114 baseline for consistency and drift detection.",
  "project_state.json": "Describes project state, issues, and feature requests focused on fixing swipe-to-delete for folders and missions."
}