{
  "backend/main.mo": "Motoko canister implementing file, folder, mission, and user profile management with authorization, metadata storage, and diagnostic/health queries.",
  "feature_evidence.json": "Feature evidence report describing a UI layering requirement for multi‑select mode and listing related frontend files and components.",
  "frontend-file-summaries.txt": "Collection of concise summaries for major frontend TypeScript/React files, describing their roles and behaviors.",
  "frontend/DRAFT_BASELINE_V114.md": "Documentation establishing Draft baseline v114 with verification steps, parity checks, and core behavior validation.",
  "frontend/index.css": "Sets Tailwind layers and defines extensive CSS variables for light and dark themes with base styling.",
  "frontend/index.html": "Defines the main HTML shell with PWA metadata, icons, and bootstraps the React app.",
  "frontend/PAUSE_AFTER_RESTORE.md": "Change‑freeze notice after restoring Live v114, outlining prohibited actions and required user approval for modifications.",
  "frontend/public/manifest.json": "PWA manifest defining app metadata, icons, colors, and behavior for MyGallery.",
  "frontend/public/sw.js": "Service worker implementing minimal precaching, runtime caching, and network‑first strategies.",
  "frontend/RESTORE_LIVE_V114_CHECKLIST.md": "Checklist verifying that the frontend matches Live v114, covering authentication, UI components, styling, and utilities.",
  "frontend/src/App.tsx": "Main React app wrapper setting up theming, context providers, and intro‑screen logic based on authentication.",
  "frontend/src/components/ActorInitErrorState.tsx": "UI component showing detailed actor initialization errors with retry, logout, and collapsible technical info.",
  "frontend/src/components/AnimatedGalleryIcon.tsx": "Renders an animated SVG gallery icon with hover effects and layered rings.",
  "frontend/src/components/ConnectivityIndicator.tsx": "Empty placeholder component file.",
  "frontend/src/components/DecorativeBottomLine.tsx": "Displays a fixed subtle horizontal decorative line near the bottom of the screen.",
  "frontend/src/components/ExternalOpenFallbackDialog.tsx": "Dialog shown when a file cannot open in a new window, offering retry or download options.",
  "frontend/src/components/FilePreviewDialog.tsx": "Dialog for previewing files with support for images, videos, PDFs, Office docs, downloads, external open, and deletion.",
  "frontend/src/components/FileUploadSection.tsx": "Handles file and link uploads with progress tracking, validation, and backend mutations.",
  "frontend/src/components/FoldersButton.tsx": "Floating button that opens the folders UI with a styled folder icon.",
  "frontend/src/components/FoldersDialog.tsx": "Deprecated folder management dialog supporting creation, renaming, deletion, and selection.",
  "frontend/src/components/FoldersFullScreenView.tsx": "Full‑screen folder manager enabling creation, editing, deletion, and folder selection.",
  "frontend/src/components/Footer.tsx": "Simple footer showing copyright and a link to caffeine.ai.",
  "frontend/src/components/FullScreenViewer.tsx": "Full‑screen file viewer with swipe navigation, deletion, download, sharing, and folder/mission actions.",
  "frontend/src/components/GallerySection.tsx": "Implements a gallery view with file cards, touch long‑press selection, previews, and dialogs for moving, sending, or opening files.",
  "frontend/src/components/Header.tsx": "Renders the top app header with theme toggle, auth menu, progress bar, and app title.",
  "frontend/src/components/IntroScreen.tsx": "Displays a short animated splash screen that fades out and triggers a completion callback.",
  "frontend/src/components/LinkOpenFallbackDialog.tsx": "Shows a dialog when a link cannot be opened, offering retry or copy-to-clipboard options.",
  "frontend/src/components/LoginButton.tsx": "Login button for Internet Identity showing loading state during authentication.",
  "frontend/src/components/MissionDetailFullScreenView.tsx": "Full‑screen mission editor with tasks, file viewer, progress calculation, and mission update/delete actions.",
  "frontend/src/components/MissionEditorDialog.tsx": "Dialog for creating new missions, allowing title entry and task management.",
  "frontend/src/components/MissionsButton.tsx": "Floating button that opens the missions view, with hover animations and optional disabled state.",
  "frontend/src/components/MissionsFullScreenView.tsx": "Full-screen view for listing missions, handling selection, creation, deletion, and navigation to mission details with swipe actions.",
  "frontend/src/components/MobileOnlyLayout.tsx": "Wrapper layout that displays children inside a mobile-only container.",
  "frontend/src/components/MoveToMissionDialog.tsx": "Dialog for moving selected files to a mission, listing missions and executing the move with feedback.",
  "frontend/src/components/NotesButton.tsx": "Empty placeholder component file.",
  "frontend/src/components/NotesDialog.tsx": "Empty placeholder component file.",
  "frontend/src/components/NotesFullScreenView.tsx": "Empty placeholder component file.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Empty placeholder component file.",
  "frontend/src/components/SendToFolderDialog.tsx": "Dialog for moving files to folders or returning them to the main collection, handling folder list and mutations.",
  "frontend/src/components/SwipeActionsRow.tsx": "Component enabling swipe-to-reveal edit and delete actions with gesture handling and controlled open state.",
  "frontend/src/components/UnifiedProgressBar.tsx": "Shows a unified upload progress bar when uploads are active.",
  "frontend/src/components/WelcomeIntroScreen.tsx": "Intro screen with target graphic and login button for onboarding.",
  "frontend/src/contexts/ActorContext.tsx": "Manages backend actor initialization with retry logic, error handling, and identity changes via context.",
  "frontend/src/contexts/UploadContext.tsx": "Tracks upload batches, progress updates, and completion with throttled rendering through context.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the current identity and invalidates dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth state, login, logout, and persistence using Dfinity AuthClient.",
  "frontend/src/hooks/useIsCoarsePointer.ts": "Detects whether the device uses a coarse pointer like touch input.",
  "frontend/src/hooks/useMissionsQueries.ts": "Defines mission-related React Query hooks for listing, fetching, creating, updating, and deleting missions using the backend actor.",
  "frontend/src/hooks/useNotesQueries.ts": "Empty placeholder file for future notes-related queries.",
  "frontend/src/hooks/useQueries.ts": "Contains React Query hooks for files and folders, including fetch, create, and upload-related operations with concurrency limiting.",
  "frontend/src/index.css": "Tailwind setup defining extensive light and dark mode CSS variables and base styles.",
  "frontend/src/lib/utils.ts": "Utility to merge class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "App entry point initializing React, React Query, Internet Identity, and global styles.",
  "frontend/src/pages/HomePage.tsx": "Home page managing authentication state, folders, missions UI, and optional dev smoke tests.",
  "frontend/src/utils/actorInitializationMessaging.ts": "Helpers and constants for classifying and messaging actor initialization and canister errors.",
  "frontend/src/utils/externalOpen.ts": "Functions to safely open external URLs and download files with popup-block detection.",
  "frontend/src/utils/fileOpenRules.ts": "Rules determining whether files open in-app, preview, or download based on MIME type.",
  "frontend/src/utils/filePreview.ts": "Utilities to categorize files by MIME type and provide previewability and human-readable labels.",
  "frontend/src/utils/notesTime.ts": "Empty placeholder file for notes time utilities.",
  "frontend/src/utils/performanceDiagnostics.ts": "Lightweight opt-in performance diagnostics with timing helpers for async operations.",
  "frontend/src/utils/reactQueryDiagnostics.ts": "Developer tools for inspecting React Query cache and logging mission deletion lifecycle.",
  "frontend/src/utils/smokeTestCoreFlows.ts": "Runs a multi-step smoke test that creates and verifies folders, missions, and file uploads using backend APIs.",
  "frontend/src/utils/uploadConcurrency.ts": "Implements a simple promise concurrency limiter with a queue and a factory function.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading, storing, and clearing URL and session parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, radii, animations, and enabling plugins.",
  "frontend/V114_BASELINE_FRONTEND_FILES.txt": "Canonical file list representing the complete verified frontend structure for Live version 114.",
  "project_state.json": "Metadata describing project state, features, and pending requests for gallery bulk action bar behavior."
}