{
  "kind": "build_request",
  "title": "Fix app stuck on loading so the UI becomes usable and core flows are available",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Fix the indefinite loading state by ensuring the app never stays on the \"Loading...\" screen forever when Internet Identity initialization does not complete (e.g., stuck in `isInitializing`). Add a deterministic timeout and a clear fallback UI that lets the user proceed to the welcome/login screen and/or retry initialization (e.g., reload the page).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Διόρθωσε το bug που κάνει την εγαρμογη να φορτώνει / loading ώστε να είναι λειτουργικό το app και όλες οι λειτουργίες να είναι άμεσα διαθέσιμες και λειτουργικές"
        ]
      },
      "acceptanceCriteria": [
        "If `useInternetIdentity().isInitializing` remains true longer than a defined threshold (e.g., 8–15 seconds), the UI exits the spinner-only screen and shows a usable fallback screen with clear actions (Retry / Reload / Sign in).",
        "Users can always reach a screen where they can click the login button; they are not trapped on a spinner-only view.",
        "User-facing copy for the fallback and actions is in English."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Make actor/backend availability explicit in the UI during startup so the app is usable while initialization/retries are happening: when authenticated but the backend actor is not `ready` (e.g., `initializing` or `unavailable`), render the main layout but clearly indicate \"Connecting…\" and disable actions that require the actor until it becomes ready; once `status === 'ready'`, all core actions (upload, list gallery, folders, missions) become enabled without requiring a manual refresh.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "...ώστε να είναι λειτουργικό το app και όλες οι λειτουργίες να είναι άμεσα διαθέσιμες και λειτουργικές"
        ]
      },
      "acceptanceCriteria": [
        "When authenticated and `status !== 'ready'`, the app does not show a full-screen blocking loader; it shows the normal shell and a clear connection state indicator, and interactive features that require the actor are disabled consistently.",
        "When actor status transitions to `ready`, disabled controls become enabled automatically and queries load data without user intervention.",
        "When actor initialization ultimately fails (final error state), the existing error UI is shown and provides working Retry and Sign out actions."
      ]
    }
  ],
  "constraints": [
    "Do not modify files under `frontend/src/hooks/useInternetIdentity.ts` or other paths listed in `frontend.immutablePaths` in SYSTEM_CONTEXT.",
    "Keep the backend architecture as a single Motoko actor (no new backend services)."
  ],
  "nonGoals": [
    "Do not implement new product features unrelated to the loading/initialization bug.",
    "Do not address the separate, already-tracked issue about the erroneous \"Unable to Open Link\" fallback dialog when returning from an external link (handled by an existing feature)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}