{
  "kind": "build_request",
  "title": "Fix freeze/blank-screen bug when completing all tasks in a mission",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Fix the bug where the app freezes and/or renders a blank screen when the user marks all tasks as completed inside a mission (including rapid toggling). The fix must not change any other app behavior or features.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "Διόρθωσε το bug που κάνει την εφαρμογή να κολαει και να δείχνει καινή οθωνη όταν μαρκάρω όλα τα task σε mission Διόρθωσε το . Μην αλλαξεις τίποτα άλλο στην εφαρμογή και στις λειτουργίες της ."
        ]
      },
      "acceptanceCriteria": [
        "From Mission detail view, toggling tasks to complete (including completing the last remaining incomplete task) does not freeze the UI and does not show a blank/empty screen.",
        "No runtime exception occurs during task toggling and autosave checks (specifically ensure there is no error related to serializing BigInt values).",
        "Task completion state still persists as before: after closing/reopening the mission, all toggled completion states remain correct.",
        "No other UI/feature behavior changes outside this bug fix (missions list, mission editor, folders, files, uploads)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Update mission autosave change-detection logic so it can safely compare mission tasks that include BigInt identifiers without using JSON.stringify directly on BigInt-containing objects.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "Διόρθωσε το bug που κάνει την εφαρμογή να κολαει και να δείχνει καινή οθωνη όταν μαρκάρω όλα τα task σε mission"
        ]
      },
      "acceptanceCriteria": [
        "Autosave change detection and flush logic correctly determines whether tasks changed when taskId fields are BigInt.",
        "The autosave hook does not throw when tasks are updated (toggle, add, remove) and remains debounced as before.",
        "Marking tasks complete/incomplete continues to trigger background persistence without blocking the UI."
      ]
    }
  ],
  "constraints": [
    "Do not change any app functionality beyond fixing the freeze/blank-screen bug related to marking all tasks in a mission.",
    "Do not edit any files under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or any files in frontend/src/components/ui.",
    "Maintain single-actor backend architecture; backend changes are not required unless strictly necessary to fix the described bug."
  ],
  "nonGoals": [
    "UI redesign or new UX flows.",
    "Adding new mission features (e.g., bulk-complete button, new progress behavior).",
    "Changing backend mission/task schemas or adding new persistence mechanisms."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}