{
  "kind": "build_request",
  "title": "Improve startup/login responsiveness (reduce blocking loading and delays)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-2",
      "text": "Remove or significantly reduce any UI that blocks the app for a fixed time on startup when the user is already authenticated (restored session), so the main Home screen becomes usable immediately.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Όταν συνδέομαι στην εφαρμογή ή όταν την ανοίγω συνδεδεμένος να λειτουργει άμεσα ομαλά χωρίς καθυστερήσεις loading"
        ]
      },
      "acceptanceCriteria": [
        "When the app is opened with an already-authenticated Internet Identity session, the Home screen renders immediately without a forced full-screen splash/intro delay.",
        "Any remaining intro/splash experience (if kept) must not block interaction with the main screen for a fixed duration."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Make authenticated startup feel smooth by using progressive rendering for initial data (folders/files/missions): keep the UI responsive while data loads and avoid showing a full-page loading spinner during normal authenticated startup.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "...να λειτουργει άμεσα ομαλά χωρίς καθυστερήσεις loading"
        ]
      },
      "acceptanceCriteria": [
        "On authenticated startup, the app shows the main layout immediately and displays lightweight skeleton/placeholder states within sections that are still loading (instead of a full-page blocking loader).",
        "Floating action buttons and primary navigation do not appear ‘stuck’ in a loading state during normal actor initialization; if temporarily disabled, the UI clearly remains responsive."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Add opt-in performance timing logs for the startup path (identity restoration, actor initialization, and first successful data fetches) using the existing performance diagnostics utility, to help verify improvements and detect regressions.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ]
      },
      "acceptanceCriteria": [
        "When performance diagnostics are enabled (via the existing localStorage/URL flag), console timings are emitted for: identity initialization, actor initialization to ready, and the first completion of initial folders/files/missions queries.",
        "When diagnostics are not enabled, there is no additional console noise and negligible runtime overhead."
      ]
    }
  ],
  "constraints": [
    "Do not modify files under frontend/src/components/ui (read-only).",
    "Do not modify any frontend paths listed as immutable in SYSTEM_CONTEXT.",
    "Backend must remain a single Motoko actor; only add backend changes if strictly necessary for perceived startup speed."
  ],
  "nonGoals": [
    "Adding real-time features (websockets) or external caching services.",
    "Changing authentication provider (must remain Internet Identity).",
    "Large redesign of the app’s feature set beyond startup/loading responsiveness."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}