{
  "kind": "build_request",
  "title": "Replace blue suitcase icon with minimal purple mission target icon",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Replace the existing “blue suitcase” icon with a minimal purple target/mission icon in all requested UI locations: (1) the top-left icon on the yellow page of the app, and (2) the icon shown in the welcome intro/onboarding screen. Implement the icon using the existing missions purple theme (e.g., Tailwind `text-missions-accent`) so it reads as a mission-related app element.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "να αντικατασταθει το εικονιδιο της μπλε βαλιτσας που βρισκεται στην κετρινκη σελιδα της εφαρμογης πανω αριστερα και στο welome intro της εφαρμογης με ενα εικονιδιο minimal mission. Το εικονιδιο να ειναι ενας στοχος χρωματος μωβ για να καταλαβαινει ο χρηστης οτι η εφαρμογη εχει να κανει με δημιουργια mission"
        ]
      },
      "acceptanceCriteria": [
        "On the welcome intro screen, the current icon is replaced by a minimal target icon rendered in purple (missions accent).",
        "On the yellow page’s top-left area, the current suitcase icon is replaced by the same minimal purple target icon.",
        "No other UI text is changed as part of this request.",
        "The replacement uses existing styling/theme tokens (missions accent) and remains legible in both light and dark mode."
      ]
    }
  ],
  "constraints": [
    "Frontend files in `frontend/src/components/ui` and paths listed in `frontend.immutablePaths` must not be edited."
  ],
  "nonGoals": [
    "Do not change mission functionality, data models, or backend logic.",
    "Do not redesign the onboarding copy or flows beyond swapping the requested icon(s)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}