{
  "kind": "build_request",
  "title": "Targeted performance optimizations (bundle, lazy loading, caching, render smoothness) without UI/logic changes",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Improve overall app responsiveness (navigation, page open, settings changes, core flows) using targeted performance optimizations only: reduce bundle size, add/expand lazy loading where appropriate, optimize service worker caching strategy, reduce unnecessary React re-renders/updates, remove dead/unused code, and improve state/update efficiency—without changing any UI appearance/layout or application logic/behavior.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Βελτίωσε συνολικά την ταχύτητα και ομαλότητα της εφαρμογής... Κάνε μόνο στοχευμένες βελτιστοποιήσεις performance... Μην αλλάξεις ΚΑΘΟΛΟΥ την εμφάνιση... Μην πειράξεις τη λογική της εφαρμογής."
        ]
      },
      "acceptanceCriteria": [
        "No visual/layout changes: the rendered UI structure, styling, spacing, component placement, and user-visible copy remain identical (aside from faster load/render).",
        "No behavior/logic changes: existing flows (auth, uploads, gallery, folders, missions, notes, settings/theme toggles) behave the same, with no regressions.",
        "Navigation between major views (Home ↔ Folders full-screen ↔ Missions full-screen, opening dialogs/viewers) feels immediate and does not introduce new jank/stutters under typical usage.",
        "No new runtime errors in the console during normal usage flows."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Reduce initial JavaScript bundle cost by expanding route-/feature-level code splitting and lazy-loading for heavy, non-critical components that are not needed for first paint (e.g., dialogs/viewers/secondary full-screen subviews), while keeping the current UI/UX identical once loaded.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "μείωση bundle size • lazy loading όπου χρειάζεται"
        ]
      },
      "acceptanceCriteria": [
        "Production build shows a reduced initial JS payload compared to the current baseline (verify via build output/analyzer).",
        "Lazy-loaded components render exactly as before once opened; no UI/layout changes and no missing styles.",
        "No new waterfalls that slow down initial Home render when authenticated."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Optimize React rendering and state updates to minimize unnecessary re-renders in top-level screens and frequently updating areas (e.g., HomePage view switching, upload progress updates, large lists/grids) using memoization, stable callbacks, and targeted state updates—without altering UI or functionality.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "πιο γρήγορο render και update των components • καλύτερη διαχείριση state"
        ]
      },
      "acceptanceCriteria": [
        "React render profiling shows fewer redundant renders for top-level containers during common interactions (opening/closing overlays, toggling selections, upload progress updates).",
        "Upload progress updates remain smooth under multiple simultaneous uploads, with no UI glitches and no increased CPU spikes from state churn.",
        "All interactions remain functionally identical (same clicks/taps lead to the same outcomes)."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Tune React Query configuration and query behaviors to reduce redundant refetching and improve perceived speed (e.g., sensible defaultOptions for staleTime/gcTime/refetch triggers, controlled retries), while preserving data correctness and existing query invalidation semantics.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "καλύτερη διαχείριση state"
        ]
      },
      "acceptanceCriteria": [
        "No increase in unnecessary network calls during normal navigation (e.g., repeatedly opening/closing views does not trigger extra refetches beyond current behavior).",
        "Data remains correct after mutations (create/rename/delete/move operations still update UI as before).",
        "Authentication changes (login/logout) still properly reset or refetch data as currently intended."
      ]
    },
    {
      "id": "REQ-5",
      "text": "Optimize the service worker caching strategy in frontend/public/sw.js to improve load and navigation smoothness while maintaining PWA installability: keep navigation handling reliable, avoid caching canister/API traffic, and implement a more appropriate strategy for static build assets (e.g., cache-first or stale-while-revalidate for immutable hashed assets) with safe cache versioning and cleanup.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "βελτιστοποίηση service worker και caching"
        ]
      },
      "acceptanceCriteria": [
        "PWA remains installable and continues to register a controlling service worker in secure contexts (https/localhost).",
        "App navigation continues to work online and has a reliable offline fallback (no blank screens).",
        "Service worker does not cache or interfere with backend/canister/API calls (still always network).",
        "Cache growth is bounded via explicit cache management rules (versioning/cleanup) and does not indiscriminately store large/unsafe responses."
      ]
    },
    {
      "id": "REQ-6",
      "text": "Remove or gate performance-costly development-only code paths and diagnostics from production bundles (e.g., ensure dev smoke tests and verbose logging remain dev-only), and delete clearly unused code that contributes to bundle size—without changing runtime behavior in production.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "αφαίρεση περιττού κώδικα • μείωση bundle size"
        ]
      },
      "acceptanceCriteria": [
        "Production build does not include dev-only smoke test utilities or dev-only dependencies unless required elsewhere.",
        "No change to production behavior other than improved performance; dev tooling still works in development mode as before.",
        "Dead/unused code removal does not break builds or introduce runtime errors."
      ]
    }
  ],
  "constraints": [
    "Do not change the app’s appearance in any way (no changes to layout, menus, buttons, forms, spacing, styling, themes, or user-visible text).",
    "Do not change application logic/behavior; only performance optimizations are allowed.",
    "Do not modify frontend files under immutable paths: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui/*.",
    "Respect the single-actor backend architecture; no new backend services.",
    "Do not change manifest/icon paths or PWA metadata in a way that would break installability."
  ],
  "nonGoals": [
    "Fixing functional bugs unrelated to performance (e.g., the existing mission creation/tasks persistence issue noted in project state).",
    "Adding new features, new UI, new routes, or redesigning any screens.",
    "Backend logic changes, schema changes, or data model refactors."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}