{
  "kind": "build_request",
  "title": "Adjust post-login splash screen to show only icon and appear on every app open while signed in",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the splash/intro screen UI so it displays only the gallery icon animation and does not render any welcome text (e.g., remove the \"Welcome to MyGallery\" heading).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "After Internet Identity login, the splash should show only the icon (no 'welcome to gallery' text)"
        ]
      },
      "acceptanceCriteria": [
        "When the splash screen is visible, no welcome/title text is shown anywhere on the splash screen.",
        "The animated gallery icon remains visible and centered on the splash screen."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Change the splash/intro triggering logic so that when a user opens/refreshes the app while already authenticated (existing Internet Identity session/delegation), the splash screen is shown once on that app load before navigating to the main Home page.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "The splash should appear every time I enter the app while signed in."
        ]
      },
      "acceptanceCriteria": [
        "If the user is already authenticated and reloads/opens the app, the splash screen appears once before the Home page renders.",
        "If the user is not authenticated, the app does not show this post-login splash and instead shows the unauthenticated welcome/login screen flow.",
        "Within a single app load, the splash screen does not reappear again after it completes unless the page is reloaded/reopened or the user logs out and authenticates again."
      ]
    }
  ],
  "constraints": [
    "Frontend immutable paths must not be edited: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui.",
    "Keep all changes confined to the existing splash/intro behavior and UI; do not introduce new authentication providers or flows."
  ],
  "nonGoals": [
    "Fixing upload/gallery display issues.",
    "Fixing folders creation flows.",
    "Fixing missions creation flows.",
    "Changing the unauthenticated WelcomeIntroScreen content or layout beyond what is required for the splash behavior."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}