{
  "kind": "build_request",
  "title": "Make the app installable as a fully recognized PWA across major browsers (no UI/feature changes)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Ensure the PWA manifest is valid and meets installability requirements: keep a correct `frontend/public/manifest.json` containing at minimum `name`, `short_name`, `start_url` (within scope), `display` set to `\"standalone\"`, and an `icons` array that includes working 192x192 and 512x512 PNG entries.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Make the app fully recognizable by all browsers as an installable PWA... Ensure that: there is a correct manifest.json with name, short_name, start_url, display=\"standalone\" • there are icons 192x192 and 512x512 • ... the app meets all installability criteria of browsers."
        ]
      },
      "acceptanceCriteria": [
        "`/manifest.json` is fetchable from the deployed app and parses as valid JSON.",
        "Manifest contains `name`, `short_name`, `start_url`, `display: \"standalone\"`, and `scope` that includes `start_url`.",
        "Manifest `icons` includes at least one `sizes: \"192x192\"` PNG and one `sizes: \"512x512\"` PNG, and both URLs resolve with HTTP 200 when requested from the app origin."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Ensure the manifest is linked correctly so it is discoverable on the app entry HTML (and therefore all client-side routes): keep/add `<link rel=\"manifest\" href=\"/manifest.json\">` in `frontend/index.html` and ensure it is not conditionally omitted.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "the manifest is correctly linked on all pages"
        ]
      },
      "acceptanceCriteria": [
        "`frontend/index.html` contains a single, correct `<link rel=\"manifest\" href=\"/manifest.json\">`.",
        "In Chrome/Edge DevTools (Application tab) the manifest is detected when loading the app root and when reloading on any client-side route."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Register the service worker correctly without modifying application UI/flows: add minimal service worker registration for `/sw.js` from `frontend/index.html` (not from immutable React entry files), ensuring it runs only in secure contexts and does not introduce unrelated app logic.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "the service worker registers correctly and does not rewrite unrelated code"
        ]
      },
      "acceptanceCriteria": [
        "On supported browsers, `navigator.serviceWorker.register('/sw.js')` successfully registers with an appropriate scope covering the app.",
        "Registration code is limited to service worker registration and basic update handling; it does not modify UI, routing, authentication, or app business logic.",
        "No service-worker registration attempt occurs when `navigator.serviceWorker` is unavailable (e.g., unsupported environments)."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Make `frontend/public/sw.js` satisfy browser installability expectations while remaining minimal: keep a fetch handler, avoid intercepting cross-origin requests and canister/API calls, and ensure navigation requests have a working fallback (without introducing new user-facing behavior).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "the app meets all installability criteria of browsers"
        ]
      },
      "acceptanceCriteria": [
        "`/sw.js` is served from the app origin, installs, activates, and controls the page (DevTools shows the page is controlled by a service worker).",
        "`sw.js` includes a `fetch` event handler (required for installability in some browser checks).",
        "Navigation requests have a reliable fallback path if the network is unavailable (no infinite errors/loops), and non-navigation requests do not break normal network behavior."
      ]
    },
    {
      "id": "REQ-5",
      "text": "Verify and fix any remaining installability criteria issues (without changing app UI/behavior): ensure the app is served over a secure context, the start URL is reachable, and there are no manifest/service-worker console errors that would prevent the “Install app” prompt across major browsers (Chrome, Edge, Firefox, and Safari iOS where applicable).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "the app meets all installability criteria of browsers"
        ]
      },
      "acceptanceCriteria": [
        "Chrome/Edge DevTools Lighthouse (or Application > Manifest) reports the app as installable with no blocking manifest or service worker errors.",
        "Install prompt (or browser install UI) becomes available in Chrome/Edge when criteria are met.",
        "No new UI elements, screens, or styling changes are introduced as part of this work."
      ]
    }
  ],
  "constraints": [
    "Do not change any other application functionality or visual appearance.",
    "Do not edit files marked immutable by the platform (including `frontend/src/main.tsx` and other immutable paths).",
    "No backend changes unless strictly required for PWA installability (prefer frontend-only changes).",
    "Do not add unrelated refactors or feature work; keep changes limited to PWA installability."
  ],
  "nonGoals": [
    "Adding new offline-first features or changing caching strategy beyond what is required for installability.",
    "Changing app name/branding, theme, layout, or any user-facing copy unrelated to PWA metadata.",
    "Introducing new routes/pages solely for PWA purposes."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}