{
  "kind": "build_request",
  "title": "Fix deletion bugs for first folder/mission and prevent erroneous 'Unable to Open Link' after opening mission links",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Fix the Folders delete flow so the first folder a user creates (folder id 0) can be deleted, and ensure deletion works for all subsequent folders as well.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-8"
        ],
        "quotes": [
          "Τον πρώτο φάκελο που δημιουργει ο χρήστης στην λειτουργία folders υπάρχει bug και δεν μπορει να τον διαγράψει , να διορθωθεί ώστε να μπορώλει να τον διαγράψει καθώς και όλους τους επόμενους φακέλους"
        ]
      },
      "acceptanceCriteria": [
        "Create a first folder (the first created folder for a user) and delete it successfully via the UI confirmation dialog.",
        "Create multiple folders and delete any of them successfully via the same UI flow.",
        "Deleting a folder with id 0 does not get blocked by truthy/falsy checks in UI event handlers."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Fix the Missions delete flow so the first mission a user creates (mission id 0) can be deleted, and ensure deletion works for all subsequent missions as well (from both the missions list and mission detail views if applicable).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-8"
        ],
        "quotes": [
          "Το ίδιο συμβαίνει και με την δημιουργία mission , να μπορςι να διαγράψει το πρώτο mission που δημιουργεί ο χρήστης καθώς και τα επόμενα mission ."
        ]
      },
      "acceptanceCriteria": [
        "Create a first mission (the first created mission for a user) and delete it successfully via the UI confirmation dialog in the missions list.",
        "Create multiple missions and delete any of them successfully via the same UI flow.",
        "Deleting a mission with id 0 does not get blocked by truthy/falsy checks in UI event handlers."
      ]
    },
    {
      "id": "REQ-3",
      "text": "When opening a link attachment inside a Mission (a link that was sent/moved from the Gallery to a Mission), do not show the 'Unable to Open Link' fallback message after the user closes/returns from the link if the link actually opened successfully.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-8"
        ],
        "quotes": [
          "Τέλος τα link που στέλνονται από την gallery σε mission όταν πατάει ο χρήστης για να ανοίξει το link να μην εμφανίζεται όταν κλείνει το link ότι το μήνυμα \"unable to open link \""
        ]
      },
      "acceptanceCriteria": [
        "Clicking a mission link attachment opens the URL externally; when the user returns to the app, the link fallback dialog/message is not shown.",
        "The fallback dialog is shown only when the browser actually blocks opening the link (e.g., window.open returns null or throws), not due to unreliable window state checks.",
        "User-facing dialog text remains in English (e.g., 'Unable to Open Link')."
      ]
    }
  ],
  "constraints": [
    "Do not modify files under frontend/src/components/ui (shadcn components); compose them instead.",
    "Do not edit frontend immutable hook/entry files listed in SYSTEM_CONTEXT (e.g., frontend/src/hooks/useInternetIdentity.ts(x), frontend/src/hooks/useActor.ts, frontend/src/main.tsx).",
    "Backend must remain a single Motoko actor in backend/main.mo; add backend/migration.mo changes only if persistent state schema changes are required."
  ],
  "nonGoals": [
    "Changing folder/mission data models or IDs in the backend.",
    "Adding new features beyond fixing deletion and link-opening fallback behavior.",
    "Implementing real-time updates or external integrations."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}