{
  "kind": "build_request",
  "title": "Fix Mission task toggle bug after re-entering a mission and adding a new task",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Fix the Mission task completion toggle bug that occurs after a user re-enters an existing mission and then adds a new task: checking/unchecking any task must update immediately in the UI, must only affect the intended task, and must immediately update mission progress, without requiring navigation or refresh.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Διόρθωσε το bug στην λειτουργία mission όταν ο χρήστης μετά από επιστροφή σε mission προσθέτει νέα task. Το τικ για ολοκληρωμένο task ή το τικ σε ολοκληρωμένο task για να γίνει μη ολοκληρωμένο να λειτουργεί άμεσα χωρίς να επηρεάζει αλλά task του mission και με άμεση ενημέρωση του mission ."
        ]
      },
      "acceptanceCriteria": [
        "Given an existing mission with multiple tasks, when the user opens the mission detail screen, adds a new task, and immediately toggles completion on any task (old or newly added), the checkbox state and styling update instantly.",
        "Toggling one task does not change completion state or styling of any other task.",
        "The progress percentage and progress bar update immediately after each toggle.",
        "The updated completion state persists after leaving the mission screen and re-opening the same mission (no delayed correction needed)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Ensure React Query mission caches remain consistent after add-task and toggle-task mutations, including the mission detail cache (['missions','detail', missionId]) and the mission list cache (['missions','list']), so the mission view reflects the latest task states immediately and reliably.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "...με άμεση ενημέρωση του mission ."
        ]
      },
      "acceptanceCriteria": [
        "After add-task completes, the mission detail cache contains the new backend task ID and does not regress any task completion states.",
        "After toggle-task completes, both mission detail and mission list caches reflect the toggled state for the specific task without altering other tasks.",
        "The UI does not require a refetch triggered by navigation to reflect the latest task state (the view stays correct in-place)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Prevent Mission autosave (useMissionAutosave) from overwriting or reverting task completion state during/after add-task and toggle-task flows, especially around the transition from an optimistic newly-added task to the real backend task, so no task states are lost or applied to the wrong task.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "...να λειτουργεί άμεσα χωρίς να επηρεάζει αλλά task του mission... Μην αλλαξεις τίποτα άλλο..."
        ]
      },
      "acceptanceCriteria": [
        "If a user adds a task and toggles that new task (or any other task) before/around mutation settlement, the final persisted mission state matches the user’s latest toggles after all mutations settle.",
        "Autosave does not persist temporary optimistic task IDs to the backend, and does not introduce duplicated tasks.",
        "No additional behavior changes occur outside the Mission task add/toggle/update flows."
      ]
    }
  ],
  "constraints": [
    "Do not change any other application features or behaviors outside the Mission task add/toggle/update flow.",
    "Do not edit files under frontend/immutablePaths (e.g., frontend/src/hooks/useActor.ts, frontend/src/hooks/useInternetIdentity.ts, frontend/src/main.tsx, frontend/src/components/ui/*).",
    "Backend must remain a single Motoko actor in backend/main.mo; add backend migration only if a state schema change is strictly required (avoid if possible)."
  ],
  "nonGoals": [
    "Adding new mission features (sorting/grouping changes, new task fields, bulk actions, analytics, etc.).",
    "Changing UI copy/text, layout, styling, or interactions beyond what is required to fix the described Mission bug.",
    "Introducing new authentication mechanisms or external services."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}