{
  "kind": "build_request",
  "title": "Fix Mission task add/toggle responsiveness and swipe-to-delete immediacy",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "In the Mission detail screen, make adding a task feel immediate and remain reliable even when the user navigates away in the app and later returns to the same mission to add tasks again (i.e., the mission detail view should always show the latest tasks and allow instant task creation).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "User"
        ],
        "quotes": [
          "Στην λειτουργία mission η πρόσθεση task σε mission να γίνεται πιο άμεσα ακόμα και αν ο χρήστης επιστρέψει σε mission για να προσθέσει task μετά από πλοήγηση στην εγαρμογη."
        ]
      },
      "acceptanceCriteria": [
        "When a user adds a task in MissionDetailFullScreenView, the new task appears in the list immediately (optimistic UI) and remains after the backend call completes.",
        "If the user leaves the mission detail view (navigate elsewhere) and later re-enters the same mission, the task list is refreshed from the latest backend/cached data (no missing or duplicated tasks).",
        "After re-entering a mission, adding a task works without requiring a manual refresh and without UI glitches (e.g., input not re-populating unexpectedly, task list not reverting)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "In the Mission detail screen, make toggling a task between completed and not completed smooth and bug-free, without causing incorrect changes to other tasks, and with immediate mission progress updates.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "User"
        ],
        "quotes": [
          "Επίσης σε mission το κλικ σε task ως ολοκληρωμένο ή το κλικ σε task για να βγει από ολοκληρωμένο να γίνεται ομαλά χωρίς σφάλματα στα υπολοιπα ολοκληρωμένα task ή μη ολοκληρωμένα  με άμεση ενημέρωση της προόδου του mission."
        ]
      },
      "acceptanceCriteria": [
        "Toggling a task’s completion updates the task UI and the mission progress percentage/bar immediately.",
        "Toggling one task does not change the completion state of any other task (no cross-task corruption).",
        "If the backend toggle fails, the UI rolls back only the toggled task to its prior state without disturbing other tasks, and the progress recalculates correctly.",
        "No React key/ordering issues or flicker occur during rapid repeated toggles."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Make swipe-to-delete in the Missions list respond immediately: deleting a mission via swipe should remove it from the list right away and refresh the missions list state reliably.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "User"
        ],
        "quotes": [
          "Τέλος η διαγραφή mission με swipe να λειτουργεί άμεσα με ενημέρωση των mission."
        ]
      },
      "acceptanceCriteria": [
        "On coarse-pointer devices, after triggering delete from SwipeActionsRow, the mission row is removed from the missions list immediately (optimistic update) without needing to wait for an artificial delay.",
        "After deletion settles (success), the missions list stays consistent with the backend (no deleted mission reappearing).",
        "If deletion fails, the mission reappears in the list (rollback) and the app shows an error toast, with the rest of the list unaffected.",
        "The swipe row state is closed/reset appropriately so the UI does not get stuck with an open actions state for a removed row."
      ]
    }
  ],
  "constraints": [
    "Do not change any other application features outside Mission flows (mission list, mission detail, task add/toggle, and mission swipe-to-delete).",
    "Do not edit frontend immutable paths: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, and anything under frontend/src/components/ui.",
    "Use English for any user-facing text that must be added/changed."
  ],
  "nonGoals": [
    "Do not add new mission features (e.g., reordering tasks, task deletion API, recurring missions).",
    "Do not redesign non-mission screens or change global navigation.",
    "Do not change backend mission data structures unless strictly required to fix the specified Mission responsiveness issues."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}