{
  "kind": "build_request",
  "title": "Archive 100%-completed missions and add swipe navigation between incomplete and completed lists",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "In the Missions full-screen view, automatically classify missions as \"Completed\" (archived) when they are 100% complete (all tasks completed and task count > 0), and as \"Incomplete\" otherwise. Default the Missions view to show only the Incomplete list when the user opens Missions.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "Στην λειτουργία mission , τα ολοκληρωμένα 100% completed mission να αρχειοθετούνται. Ο χρήστης όταν ανοίγει την λειτουργία mission να βλέπει τα μη ολοκληρωμένα mission"
        ]
      },
      "acceptanceCriteria": [
        "A mission with at least 1 task and 100% progress is not shown in the default list when the Missions screen opens.",
        "A mission with 0 tasks is treated as Incomplete and remains visible in the default list.",
        "The existing mission progress calculation logic remains consistent with current UI behavior (no changes to task completion semantics)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Add horizontal swipe navigation in the Missions full-screen view: swiping right switches from the Incomplete list to the Completed (archived) list; swiping left switches from the Completed list back to the Incomplete list. Also provide a visible, tappable option to switch between Incomplete and Completed lists (English labels).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "να υπάρχει επιλογή να δει τα ολοκληρωμένα mission με swipe προς τα δεξιά . Όταν κάνει swipe προς τα δεξιά να βλέπει τα ολοκληρωμένα mission και κάνοντας swipe προς τα αριστερά να βλέπει τα μη ολοκληρωμένα mission."
        ]
      },
      "acceptanceCriteria": [
        "On touch devices, a right-swipe gesture on the Missions list view shows the Completed list; a left-swipe shows the Incomplete list.",
        "A user can switch lists without swiping via an on-screen control (e.g., segmented control/tabs) with English text (e.g., \"Incomplete\" / \"Completed\").",
        "Swipe navigation does not break existing per-row left-swipe actions (edit/delete); list navigation gestures must not trigger when the user is clearly swiping a row to reveal actions.",
        "When switching lists, any open swipe row actions are closed to prevent stuck/open states."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Ensure missions in the Completed (archived) list can be deleted via swipe actions (same behavior as the current swipe-delete in Missions list), and that deleting a completed mission updates the UI immediately and correctly.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "Τα ολοκληρωμένα mission να μπορεί και αυτά ο χρήστης να τα διαγράψει με swipe ."
        ]
      },
      "acceptanceCriteria": [
        "In the Completed list on touch devices, swiping a mission row reveals actions and allows delete.",
        "Deleting a mission from the Completed list removes it from the UI and does not reappear after refetch unless the delete failed.",
        "If the deleted mission was currently selected/open (edge case), the selection is cleared (consistent with current behavior)."
      ]
    },
    {
      "id": "REQ-4",
      "text": "When a mission is in the Completed (archived) state and the user marks any task as incomplete within the mission detail view, the mission must automatically move back to the Incomplete missions list (i.e., it should no longer appear in Completed once progress drops below 100%).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "Αν ο χρήστης σε ολοκλήρωμενο mission επιλέξει task ως μη ολοκληρωμένο να επιστρέφει το mission στην λίστα με τα mission μη ολοκληρωμένα"
        ]
      },
      "acceptanceCriteria": [
        "If a mission is currently 100% complete and the user unchecks any task in mission detail, the mission is no longer classified as Completed after the update settles.",
        "Returning to the Missions list shows the mission in the Incomplete list (and not in the Completed list).",
        "No new backend fields or schema changes are introduced for archiving; the archive/completed state is derived from tasks/progress."
      ]
    }
  ],
  "constraints": [
    "Do not change anything else in the application outside the Missions feature and its related UI flows.",
    "Keep all backend logic in the single existing actor (backend/main.mo); do not introduce additional backend services.",
    "Do not edit any frontend files under frontend/src/components/ui or any paths listed as immutable in SYSTEM_CONTEXT."
  ],
  "nonGoals": [
    "Adding a persistent \"archived\" flag or separate archive storage on the backend (the archive state should be derived from task completion as requested).",
    "Changing mission creation, autosave behavior, attachments, folders, files, notes, authentication, or any other non-mission features.",
    "Adding real-time syncing or cross-device live updates beyond existing React Query refetch behavior."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}