{
  "kind": "build_request",
  "title": "Fix erroneous 'Unable to Open Link' message after returning from opened gallery link",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Fix the link-opening flow so that the \"Unable to Open Link\" fallback dialog is not shown when a gallery link actually opened successfully and the user returns to the app after closing the link page/tab.\n\nThis includes adjusting the logic in the gallery link click handler so the fallback UI is only shown when the browser truly blocked opening the link (and not as a side-effect of leaving/returning to the app). If needed, incorporate page visibility/focus handling and/or a short delay before showing the fallback to confirm the app did not successfully navigate/open an external page.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Όταν ανεβάζω ένα link στο gallery και το ανοίξω και μετά το κλείσω ... εμφανίζεται ένα μύνημα unable to open link . Να μην εμφανίζεται το μήνυμα unable to open link μετά το κλείσιμο της σελίδας του link"
        ]
      },
      "acceptanceCriteria": [
        "Given a link item in the gallery, when the user taps it and the link opens in a new tab/window (or browser view) and the user later closes that page to return to the app, the app must not display the \"Unable to Open Link\" dialog/message.",
        "Given a link item in the gallery, when the browser truly blocks opening the link (e.g., window.open returns null and the page does not become hidden/navigate), the app must still show the existing \"Unable to Open Link\" fallback dialog with retry/copy options.",
        "Returning to the app after attempting to open a link must not automatically trigger the fallback dialog if it was not already shown at the time of the click.",
        "No regression: link items still open externally when possible, and the existing fallback dialog remains usable for real failures."
      ]
    }
  ],
  "constraints": [
    "Frontend immutable paths must not be modified: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui/*.",
    "Keep the backend as a single Motoko actor; no backend changes are required for this bug fix."
  ],
  "nonGoals": [
    "Redesigning the gallery UI/visual theme.",
    "Changing how links are stored or uploaded to the backend.",
    "Adding new authentication methods or external integrations."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}