{
  "kind": "build_request",
  "title": "Fix folder creation flow and show folder actions only after swipe",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-5",
      "text": "Fix the folder creation flow so a user can always create a new folder (both when they have zero folders and when they already have folders), and the newly created folder reliably appears in the folders list immediately after creation (without requiring app reload, navigation, or manual refresh).",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "Διόρθωσε την δημιουργία νέου φακέλου . Όταν δεν έχω δημιουργήσει ακόμα φάκελο στην εφαρμογη να μπορώ να δημιουργήσω νέο φάκελο και αν έχω ήδη δημιουηρφγιμενους φακέλους να μπορώ να δημιουργήσω νέους . Η δημιουργία φακέλου να λειτουργεί σωστά ώστε οπότε να να δημιουργήσω φάκελο να εμφανίζεται στην λίστα"
        ]
      },
      "acceptanceCriteria": [
        "When the folders list is empty, creating a folder succeeds and the new folder appears in the list immediately.",
        "When the folders list already contains folders, creating an additional folder succeeds and the new folder appears in the list immediately.",
        "Folder creation does not rely on the folder list query being previously populated (i.e., it works even on first-time use).",
        "If folder creation fails (backend error / actor not ready), the UI shows an error and does not add a phantom folder entry to the list."
      ]
    },
    {
      "id": "REQ-6",
      "text": "Update the folders list UI so the delete and rename (edit title) actions are only visible after a swipe gesture reveals them; the actions must not be visible by default before the swipe reveal.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "Η επιλογή διαγραφης φακέλου η επεξεργασιας τίτλου να εμφανίζεται μόνο μετά από swipe"
        ]
      },
      "acceptanceCriteria": [
        "In the folders list, rename and delete actions are hidden by default for each folder row.",
        "Swiping left on a folder row reveals the rename and delete actions for that row.",
        "Only one folder row’s swipe actions can be open at a time; opening one closes any previously open row.",
        "Tapping/clicking outside an open swipe row closes it.",
        "The swipe behavior works on touch devices; if pointer input is supported (mouse/trackpad), the same reveal interaction remains usable without showing actions by default."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (shadcn/ui); compose them instead.",
    "Do not modify any frontend files listed in frontend.immutablePaths.",
    "Keep all backend logic in the single Motoko actor (backend/main.mo); only add migration code if existing stable state requires it."
  ],
  "nonGoals": [
    "Do not add new folder features beyond creation, listing, rename, delete, and swipe-to-reveal behavior.",
    "Do not change unrelated file/gallery behaviors (uploads, viewer, notes, missions) except as needed to keep folder creation/listing consistent."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}