{
  "kind": "build_request",
  "title": "Make mission task completion toggle update immediately",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Fix the Mission view so that toggling a task checkbox (incomplete → complete and complete → incomplete) updates the mission UI immediately, without requiring a manual refresh or waiting for a later mission refetch.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "Στην λειτουργία mission η επιλογή τικ ολοκληρωμένου task ή η επιλογή τικ από ολοκληρωμένο σε ανολοκλήρωτο να γίνεται άμεσα με άμεση ενημέρωση του mission. Μην αλλάξεις απολύτως τίποτα άλλο στην εφαρμογή και στις λειτουργίες της."
        ]
      },
      "acceptanceCriteria": [
        "In MissionDetailFullScreenView, clicking a task checkbox immediately updates the checkbox state, the task text styling (line-through), and the progress counters/bar in the same screen.",
        "The immediate UI update works in both directions (complete ↔ incomplete).",
        "The UI state does not “snap back” to the previous completion state after the mutation resolves (i.e., no visible revert caused by stale cache/baseline).",
        "No other mission behaviors, screens, or features are changed."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Ensure the task-toggle flow does not depend on stale component state when syncing post-mutation mission/task data (e.g., do not use a stale `selectedMission` reference after `mutateAsync`). After a task toggle completes, any baseline/cache sync must use the latest mission tasks from the React Query cache for that mission so that subsequent autosave behavior cannot overwrite the toggled completion state.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "...να γίνεται άμεσα με άμεση ενημέρωση του mission. Μην αλλάξεις απολύτως τίποτα άλλο..."
        ]
      },
      "acceptanceCriteria": [
        "After toggling a task, the mission tasks stored in React Query for the mission detail reflect the new completion value immediately and remain consistent after the backend call completes.",
        "Autosave does not re-save an older tasks array that would undo the completion toggle.",
        "No changes are made to backend APIs or mission/task schema."
      ]
    }
  ],
  "constraints": [
    "Do not change any other functionality or UI beyond the minimum required to make mission task completion toggles update immediately.",
    "Do not edit files under frontend/src/components/ui (read-only).",
    "Keep backend as a single Motoko actor; do not introduce additional services or databases."
  ],
  "nonGoals": [
    "Redesigning the Missions UI or changing styling.",
    "Changing mission autosave debounce timing or introducing new autosave features beyond preventing the toggle from being overwritten.",
    "Adding new mission/task capabilities (reordering tasks, editing task text, bulk actions, etc.)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}