{
  "kind": "build_request",
  "title": "Reorder New Mission form so task entry is directly under the title",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "In the New Mission creation dialog (frontend/src/components/MissionEditorDialog.tsx), move the task entry UI (the \"Add a new task...\" input and its add button) to appear directly under the mission title input, and render the tasks list immediately below that so the user can continuously see the tasks they add while creating the mission.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "When the user creates a new mission, the form should have task entry under the title so the user can see the tasks they add more easily. Do not change anything else in the app or its functionality."
        ]
      },
      "acceptanceCriteria": [
        "When creating a new mission, the task input row is visually placed directly beneath the mission title input (above the scrollable task list).",
        "After adding tasks, the newly added tasks are visible in the task list directly below the task input, without requiring the user to scroll to the bottom area where the task input previously lived.",
        "The Create Mission and Cancel actions remain available and keep their current behavior (including disabled/loading states).",
        "No backend (Motoko) changes are made.",
        "No other screens, mission detail behavior, mission list behavior, or non-mission features are changed."
      ]
    }
  ],
  "constraints": [
    "Limit changes strictly to the New Mission creation form layout in frontend/src/components/MissionEditorDialog.tsx.",
    "Do not change backend behavior, data models, or canister APIs.",
    "Do not modify any files under frontend/src/components/ui or any other immutable frontend paths.",
    "Do not change any other application UI/UX beyond what is necessary to reposition the task entry section under the title in the New Mission dialog."
  ],
  "nonGoals": [
    "Redesigning Missions UI theme or styling outside the New Mission dialog",
    "Changing task creation logic, validation rules, task IDs, or persistence behavior",
    "Adding new mission features (e.g., due dates, priorities, task descriptions, reordering)"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}