{
  "kind": "build_request",
  "title": "Fix mission task completion clicks to update immediately and correctly",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Fix the mission task completion interaction so that when a user clicks a task checkbox in MissionDetailFullScreenView, the UI updates immediately and consistently reflects the new completion state without requiring extra clicks or waiting for a refetch.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Κάνε μια διόρθωση μονο στην λειτουργία mission ώστε τα κλικ που κάνει ο χρήστης για ολοκλήρωση task να λειτουργούν άμεσα και σωστά . Μην αλλαξεις τίποτα άλλο στην εφαρμογή και στις λειτουργίες της . Διόρθωσε μόνο στην λειτουργία mission τα κλικ του χρήστη σε mission να δουλεύουν σωστά με άμεση ενημέρωση ."
        ]
      },
      "acceptanceCriteria": [
        "In the mission detail screen, clicking a task checkbox updates the checkbox state (checked/unchecked) immediately (optimistic UI).",
        "After the backend mutation resolves, the task completion state remains correct (no reverting to the previous state).",
        "Rapid successive toggles of the same task do not result in incorrect final state (the final UI state matches the last click).",
        "No other screens/features are changed beyond what is necessary to make mission task completion clicks update immediately and correctly."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Ensure React Query cache updates for task completion are applied immediately and correctly for missions by updating the relevant mission caches in useToggleTaskCompletion (at minimum the mission detail cache, and also the missions list cache if it displays task completion/progress), so progress/task counts stay in sync without waiting for invalidation/refetch.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Διόρθωσε μόνο στην λειτουργία mission τα κλικ του χρήστη σε mission να δουλεύουν σωστά με άμεση ενημέρωση ."
        ]
      },
      "acceptanceCriteria": [
        "Toggling a task completion updates the React Query cache for ['missions','detail',<missionId>] immediately.",
        "If the missions list UI depends on task completion/progress, it reflects the change immediately via an optimistic update to ['missions','list'] (not only after a refetch).",
        "If the backend mutation fails, optimistic updates are rolled back and the UI returns to the prior correct state."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Adjust mission autosave baseline synchronization in MissionDetailFullScreenView so that after task add/toggle mutations, the autosave baseline is synced using the latest task state (from the React Query cache or mutation result), avoiding stale closures that can cause incorrect follow-up saves or inconsistent UI behavior.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "τα κλικ που κάνει ο χρήστης για ολοκλήρωση task να λειτουργούν άμεσα και σωστά"
        ]
      },
      "acceptanceCriteria": [
        "After a task toggle completes, the autosave baseline is aligned with the latest tasks state so no unintended extra save occurs that could overwrite the user’s last click.",
        "After adding a task completes, the autosave baseline is aligned with the latest tasks state.",
        "No changes are made to autosave behavior outside missions/task completion correctness."
      ]
    }
  ],
  "constraints": [
    "Do not change anything outside the mission feature needed to make mission task-completion clicks update immediately and correctly.",
    "Do not modify immutable frontend paths listed in SYSTEM_CONTEXT.",
    "Do not introduce new features or UI flows; apply a minimal, targeted fix.",
    "Backend logic should not be changed unless strictly required for this bug fix."
  ],
  "nonGoals": [
    "Redesigning the Missions UI.",
    "Changing mission creation/deletion behavior.",
    "Adding new mission/task fields or changing backend data models.",
    "Performance optimizations unrelated to the mission task completion click bug."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}