{
  "kind": "build_request",
  "title": "Disable automated in-app toast messages (e.g., “Mission created successfully”) without changing app functionality",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Disable all automated in-app toast/notification popups (e.g., “Mission created successfully”) so that no Sonner toast messages are shown anywhere in the app, while keeping all underlying app logic and flows unchanged.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-8"
        ],
        "quotes": [
          "Να μην εμφανίζονται αυτοματοποιημένα μηνύματα στην εφαρμογή , για παράδειγμα \"mission created successfully \" κλπ.\nΜην αλλάξεις απολύτως τίποτα άλλο στην εφαρμογή και στις λειτουργίες της"
        ]
      },
      "acceptanceCriteria": [
        "Creating a mission does not display a success toast (e.g., “Mission created successfully”).",
        "Deleting a mission does not display a success toast (e.g., “Mission deleted successfully”).",
        "No other toast popups appear for any app actions (success, info, or error toasts).",
        "All existing CRUD and upload flows continue to function as before (no behavior changes besides the absence of toast popups).",
        "The frontend builds cleanly without TypeScript errors (e.g., no unused imports after toast/Toaster removal)."
      ]
    }
  ],
  "constraints": [
    "Do not change any backend behavior, data models, or persistence.",
    "Do not change any app functionality or user flows other than removing automated in-app toast messages.",
    "Do not edit files under frontend/src/components/ui (compose existing UI components only)."
  ],
  "nonGoals": [
    "Redesigning dialogs, confirmations, or other non-toast UI.",
    "Changing copy/text elsewhere in the UI beyond removing toast messages.",
    "Adding new notification systems as a replacement for toasts."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}