{
  "kind": "build_request",
  "title": "Ensure gallery bulk action bar overlays Folder/Missions floating buttons during multi-select",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "When the Gallery is in multi-select mode (i.e., selectionMode is true and at least one item is selected), ensure the bulk action bar containing the actions \"Folder\", \"Mission\", \"Share\", \"Download\", and \"Delete\" is visually and interactively in front of (above) the floating \"Folders\" and \"Missions\" buttons/icons so the actions are always clearly visible and tappable.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Όταν επιλέγω μαζικα αρχεία ή links στην gallery , οι επιλογές folder , mission , share , download και delete να εμφανίζονται μπροστά από τα εικονίδια folder και mission ώστε να ειναι εμφανή στον χρήστη για επιλογή"
        ]
      },
      "acceptanceCriteria": [
        "Enter multi-select mode in the gallery and select at least 1 item: the bulk action bar overlaps the screen above the floating Folders/Missions buttons (i.e., higher stacking order) and is not obscured by them.",
        "While the bulk action bar is visible, tapping/clicking any of its actions (Folder, Mission, Share, Download, Delete) works reliably even if the bar visually overlaps the floating Folders/Missions buttons.",
        "Exit multi-select mode (Cancel or after completing an action): the floating Folders/Missions buttons return to their normal visibility/stacking behavior."
      ]
    }
  ],
  "constraints": [
    "Do not edit any files under frontend/src/components/ui (read-only).",
    "Do not edit frontend/src/hooks/useInternetIdentity.ts or .tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx (immutable paths).",
    "Keep changes limited to UI layering/visibility/interaction for the gallery bulk action controls; do not introduce new backend APIs."
  ],
  "nonGoals": [
    "Changing the set of available bulk actions (Folder, Mission, Share, Download, Delete).",
    "Redesigning the gallery layout or adding new gallery features beyond fixing the visibility/stacking of existing controls.",
    "Backend data model or storage changes."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}