{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix mission task-completion freeze caused by BigInt-unsafe autosave comparisons",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Prevent mission detail view freeze/blank-screen when completing tasks (including the last task and rapid toggling) by eliminating runtime errors during autosave change detection.",
      "acceptanceCriteria": [
        "From Mission detail view, toggling tasks to complete (including completing the last remaining incomplete task) does not freeze the UI and does not show a blank/empty screen.",
        "No runtime exception occurs during task toggling and autosave checks (specifically ensure there is no error related to serializing BigInt values).",
        "Task completion state still persists as before: after closing/reopening the mission, all toggled completion states remain correct.",
        "No other UI/feature behavior changes outside this bug fix (missions list, mission editor, folders, files, uploads)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useMissionAutosave.ts",
          "operation": "modify",
          "description": "Replace the current JSON.stringify-based task change detection (which throws on BigInt) with a BigInt-safe comparison, and ensure the hydrated baseline snapshot is stored in a way that won’t be mutated unexpectedly; keep existing debouncing, flush behavior, and persistence flow unchanged."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Update autosave change-detection so missions with BigInt task identifiers are compared safely without JSON.stringify.",
      "acceptanceCriteria": [
        "Autosave change detection and flush logic correctly determines whether tasks changed when taskId fields are BigInt.",
        "The autosave hook does not throw when tasks are updated (toggle, add, remove) and remains debounced as before.",
        "Marking tasks complete/incomplete continues to trigger background persistence without blocking the UI."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/missionTaskCompare.ts",
          "operation": "create",
          "description": "Add a small, focused BigInt-safe equality helper for comparing Task arrays (e.g., compare length and per-item taskId/completed/task fields using BigInt-safe checks) to support autosave change detection without serialization."
        },
        {
          "path": "frontend/src/hooks/useMissionAutosave.ts",
          "operation": "modify",
          "description": "Use the new BigInt-safe Task array comparison helper for both the debounced autosave effect and flushPendingSave change checks; remove any direct JSON.stringify usage on BigInt-containing structures while preserving existing debounce timing and save queue semantics."
        }
      ]
    }
  ]
}