{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix false 'Unable to Open Link' dialog after returning from successfully opened gallery links",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Make external link opening detection resilient so the fallback dialog only appears on true browser-blocked opens, not after returning to the app.",
      "acceptanceCriteria": [
        "Given a link item in the gallery, when the user taps it and the link opens in a new tab/window (or browser view) and the user later closes that page to return to the app, the app must not display the \"Unable to Open Link\" dialog/message.",
        "Given a link item in the gallery, when the browser truly blocks opening the link (e.g., window.open returns null and the page does not become hidden/navigate), the app must still show the existing \"Unable to Open Link\" fallback dialog with retry/copy options.",
        "Returning to the app after attempting to open a link must not automatically trigger the fallback dialog if it was not already shown at the time of the click.",
        "No regression: link items still open externally when possible, and the existing fallback dialog remains usable for real failures."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/externalOpen.ts",
          "operation": "modify",
          "description": "Adjust the external-open helper(s) to support a more reliable success/failure signal for window.open, incorporating a short delay and page visibility/focus signals (e.g., visibilitychange/blur/pagehide) so the app can distinguish true popup blocking from a successful external navigation and subsequent return."
        },
        {
          "path": "frontend/src/components/GallerySection.tsx",
          "operation": "modify",
          "description": "Update the gallery link click handler to use the improved external-open detection and only open the existing LinkOpenFallbackDialog when the open is confirmed blocked (not when the user returns from a successfully opened link). Ensure no delayed fallback is triggered on visibility/focus restoration."
        },
        {
          "path": "frontend/src/components/FullScreenViewer.tsx",
          "operation": "modify",
          "description": "Align the viewer's \"Open externally\" flow with the same improved external-open detection so its fallback dialog is also only shown for true blocked opens, preventing similar false-positive behavior."
        }
      ]
    }
  ]
}