{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Missions: derived Completed archive + swipe navigation between Incomplete/Completed",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Derive mission Completed vs Incomplete from tasks/progress and default Missions view to Incomplete only.",
      "acceptanceCriteria": [
        "A mission with at least 1 task and 100% progress is not shown in the default list when the Missions screen opens.",
        "A mission with 0 tasks is treated as Incomplete and remains visible in the default list.",
        "The existing mission progress calculation logic remains consistent with current UI behavior (no changes to task completion semantics)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/missionCompletion.ts",
          "operation": "create",
          "description": "Add a Missions-scoped helper to (1) compute progress using the same semantics as current UI and (2) classify a mission as Completed only when taskCount>0 and progress===100; otherwise Incomplete."
        },
        {
          "path": "frontend/src/components/MissionsFullScreenView.tsx",
          "operation": "modify",
          "description": "Update the Missions list rendering to use the derived classification helper and filter into two lists (Incomplete/Completed), with initial/default viewMode set to Incomplete whenever Missions opens."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Add horizontal swipe navigation and an on-screen Incomplete/Completed toggle without breaking per-row swipe actions.",
      "acceptanceCriteria": [
        "On touch devices, a right-swipe gesture on the Missions list view shows the Completed list; a left-swipe shows the Incomplete list.",
        "A user can switch lists without swiping via an on-screen control (e.g., segmented control/tabs) with English text (e.g., \"Incomplete\" / \"Completed\").",
        "Swipe navigation does not break existing per-row left-swipe actions (edit/delete); list navigation gestures must not trigger when the user is clearly swiping a row to reveal actions.",
        "When switching lists, any open swipe row actions are closed to prevent stuck/open states."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/SwipeActionsRow.tsx",
          "operation": "modify",
          "description": "Add lightweight DOM markers/attributes on the swipe-row container/content to allow the Missions list-level swipe handler to detect when a gesture started inside a row and avoid interpreting row-reveal swipes as list-navigation swipes."
        },
        {
          "path": "frontend/src/components/MissionsFullScreenView.tsx",
          "operation": "modify",
          "description": "Implement list-level horizontal swipe detection (right-swipe => Completed, left-swipe => Incomplete) on the Missions list area, with guardrails to ignore gestures originating inside swipeable rows and to require a clear horizontal intent; add a visible, tappable toggle control labeled \"Incomplete\" and \"Completed\"; ensure switching lists clears openSwipeRowId to close any open row actions."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Support swipe-delete for missions in the Completed list with immediate, correct UI updates.",
      "acceptanceCriteria": [
        "In the Completed list on touch devices, swiping a mission row reveals actions and allows delete.",
        "Deleting a mission from the Completed list removes it from the UI and does not reappear after refetch unless the delete failed.",
        "If the deleted mission was currently selected/open (edge case), the selection is cleared (consistent with current behavior)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/MissionsFullScreenView.tsx",
          "operation": "modify",
          "description": "Render Completed missions using the same SwipeActionsRow behavior as Incomplete (including delete wiring to the existing delete mutation), and ensure optimistic removal + selectedMissionId clearing continues to apply when deleting from either list."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "When a Completed mission drops below 100% (task unchecked), re-derive state and ensure it appears in Incomplete after returning to the Missions list.",
      "acceptanceCriteria": [
        "If a mission is currently 100% complete and the user unchecks any task in mission detail, the mission is no longer classified as Completed after the update settles.",
        "Returning to the Missions list shows the mission in the Incomplete list (and not in the Completed list).",
        "No new backend fields or schema changes are introduced for archiving; the archive/completed state is derived from tasks/progress."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/MissionsFullScreenView.tsx",
          "operation": "modify",
          "description": "Ensure derived classification reacts to task toggle cache updates (no persisted archive flag) and reset the list viewMode to Incomplete when navigating back from MissionDetailFullScreenView so a mission that became incomplete is visible immediately; also close any open swipe row actions on back."
        },
        {
          "path": "frontend/src/components/MissionDetailFullScreenView.tsx",
          "operation": "modify",
          "description": "Keep task toggle semantics unchanged while ensuring the existing toggle mutation updates the React Query caches used by the list; add any minimal UI-flow handling needed so back navigation returns to a list state where derived classification is re-evaluated (no new backend fields)."
        }
      ]
    }
  ]
}