{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "PWA installability compliance (manifest, service worker, registration) with no UI/flow changes",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Validate and complete the PWA manifest with required fields and working 192x192/512x512 PNG icons.",
      "acceptanceCriteria": [
        "`/manifest.json` is fetchable from the deployed app and parses as valid JSON.",
        "Manifest contains `name`, `short_name`, `start_url`, `display: \"standalone\"`, and `scope` that includes `start_url`.",
        "Manifest `icons` includes at least one `sizes: \"192x192\"` PNG and one `sizes: \"512x512\"` PNG, and both URLs resolve with HTTP 200 when requested from the app origin."
      ],
      "file_operations": [
        {
          "path": "frontend/public/manifest.json",
          "operation": "modify",
          "description": "Ensure required installability fields remain present and correct (including `name`, `short_name`, `start_url`, `display: \"standalone\"`, and `scope` containing `start_url`), and confirm `icons` includes working PNG entries for sizes 192x192 and 512x512 that match the actual asset paths under frontend/public."
        },
        {
          "path": "frontend/public/assets/generated/mygallery-mission-icon-192.dim_192x192.png",
          "operation": "create",
          "description": "Add the required 192x192 PNG icon asset to the public assets directory so the manifest icon URL resolves (source file available in workspace assets list)."
        },
        {
          "path": "frontend/public/assets/generated/mygallery-mission-icon-512.dim_512x512.png",
          "operation": "create",
          "description": "Add the required 512x512 PNG icon asset to the public assets directory so the manifest icon URL resolves (source file available in workspace assets list)."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Ensure the manifest link tag is present and discoverable from the app entry HTML for all client-side routes.",
      "acceptanceCriteria": [
        "`frontend/index.html` contains a single, correct `<link rel=\"manifest\" href=\"/manifest.json\">`.",
        "In Chrome/Edge DevTools (Application tab) the manifest is detected when loading the app root and when reloading on any client-side route."
      ],
      "file_operations": [
        {
          "path": "frontend/index.html",
          "operation": "modify",
          "description": "Verify the document head contains exactly one `<link rel=\"manifest\" href=\"/manifest.json\">` and that it is unconditional (not gated by runtime conditions) so the manifest remains discoverable across reloads and client-side routes."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Register the service worker from frontend/index.html with minimal, secure-context guarded logic and basic update handling only.",
      "acceptanceCriteria": [
        "On supported browsers, `navigator.serviceWorker.register('/sw.js')` successfully registers with an appropriate scope covering the app.",
        "Registration code is limited to service worker registration and basic update handling; it does not modify UI, routing, authentication, or app business logic.",
        "No service-worker registration attempt occurs when `navigator.serviceWorker` is unavailable (e.g., unsupported environments)."
      ],
      "file_operations": [
        {
          "path": "frontend/index.html",
          "operation": "modify",
          "description": "Add a minimal inline service worker registration snippet for `/sw.js` (placed in index.html), guarded to run only when `navigator.serviceWorker` exists and the context is secure (HTTPS or localhost). Include only basic update handling (e.g., listen for updates and optionally trigger `SKIP_WAITING` via postMessage) without any UI/business-logic changes."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Keep the service worker minimal while meeting installability checks: include fetch handler, avoid cross-origin/canister interception, and provide a navigation fallback.",
      "acceptanceCriteria": [
        "`/sw.js` is served from the app origin, installs, activates, and controls the page (DevTools shows the page is controlled by a service worker).",
        "`sw.js` includes a `fetch` event handler (required for installability in some browser checks).",
        "Navigation requests have a reliable fallback path if the network is unavailable (no infinite errors/loops), and non-navigation requests do not break normal network behavior."
      ],
      "file_operations": [
        {
          "path": "frontend/public/sw.js",
          "operation": "modify",
          "description": "Adjust the existing minimal service worker to ensure installability expectations: keep the `fetch` handler, continue skipping cross-origin and canister/API calls, and ensure navigation requests reliably fall back offline by guaranteeing the fallback document (e.g., `/index.html`) is available in cache (add it to minimal precache and/or cache on first successful navigation)."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Eliminate remaining installability blockers (manifest/SW errors) while keeping the app’s UI/behavior unchanged.",
      "acceptanceCriteria": [
        "Chrome/Edge DevTools Lighthouse (or Application > Manifest) reports the app as installable with no blocking manifest or service worker errors.",
        "Install prompt (or browser install UI) becomes available in Chrome/Edge when criteria are met.",
        "No new UI elements, screens, or styling changes are introduced as part of this work."
      ],
      "file_operations": [
        {
          "path": "frontend/public/manifest.json",
          "operation": "modify",
          "description": "Add any non-UI manifest fields needed to avoid installability warnings across major browsers (e.g., ensure `start_url` is reachable and within `scope`, and add a stable manifest `id` if needed by Chromium) while keeping existing app naming/branding and visuals unchanged."
        },
        {
          "path": "frontend/public/sw.js",
          "operation": "modify",
          "description": "Harden service worker behavior to avoid console errors that can block installability (e.g., ensure cache lookups used for navigation fallback cannot fail due to missing precached entries; keep behavior minimal and avoid introducing offline-first features beyond the required fallback)."
        },
        {
          "path": "frontend/index.html",
          "operation": "modify",
          "description": "Ensure service worker registration cannot throw in insecure/unsupported contexts (guard checks + error logging only) and keep PWA head metadata consistent so browser install UI is not blocked by manifest/service worker discovery issues."
        }
      ]
    }
  ]
}