{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Mission task toggle: immediate optimistic UI, correct React Query cache sync, and autosave baseline alignment",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Make task checkbox toggles in MissionDetailFullScreenView update immediately and remain consistent without extra clicks/refetch reliance, including rapid toggles.",
      "acceptanceCriteria": [
        "In the mission detail screen, clicking a task checkbox updates the checkbox state (checked/unchecked) immediately (optimistic UI).",
        "After the backend mutation resolves, the task completion state remains correct (no reverting to the previous state).",
        "Rapid successive toggles of the same task do not result in incorrect final state (the final UI state matches the last click).",
        "No other screens/features are changed beyond what is necessary to make mission task completion clicks update immediately and correctly."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/MissionDetailFullScreenView.tsx",
          "operation": "modify",
          "description": "Update task checkbox interaction to use the Checkbox's next checked value (from onCheckedChange) rather than inverting a potentially stale `task.completed` value; avoid globally disabling all task toggles while a toggle mutation is pending so rapid successive toggles are possible; keep behavior changes strictly scoped to mission task completion clicks."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Apply correct immediate React Query optimistic cache updates and robust rollback for mission task completion, syncing both mission detail and (if applicable) missions list caches.",
      "acceptanceCriteria": [
        "Toggling a task completion updates the React Query cache for ['missions','detail',<missionId>] immediately.",
        "If the missions list UI depends on task completion/progress, it reflects the change immediately via an optimistic update to ['missions','list'] (not only after a refetch).",
        "If the backend mutation fails, optimistic updates are rolled back and the UI returns to the prior correct state."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useMissionsQueries.ts",
          "operation": "modify",
          "description": "Enhance `useToggleTaskCompletion` optimistic updates to (1) update ['missions','detail', missionId] immediately, (2) also update ['missions','list'] entries for the same mission so progress/task counts stay in sync, and (3) implement rollback that does not clobber newer rapid toggles (e.g., rollback only if the cache still reflects the optimistic value for that mutation). Reduce reliance on invalidate/refetch for correctness (keep minimal invalidation only if needed), ensuring UI does not revert after success."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Sync mission autosave baseline after add/toggle mutations using the latest tasks state (from cache/mutation), avoiding stale closures and unintended follow-up saves.",
      "acceptanceCriteria": [
        "After a task toggle completes, the autosave baseline is aligned with the latest tasks state so no unintended extra save occurs that could overwrite the user’s last click.",
        "After adding a task completes, the autosave baseline is aligned with the latest tasks state.",
        "No changes are made to autosave behavior outside missions/task completion correctness."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/MissionDetailFullScreenView.tsx",
          "operation": "modify",
          "description": "After `addTaskMutation` and `toggleTaskMutation` resolve, sync autosave baseline using the latest mission/tasks from the React Query cache (or mutation result) rather than the potentially stale `selectedMission` reference captured in the handler; keep autosave behavior otherwise unchanged and scoped to mission task correctness."
        }
      ]
    }
  ]
}