{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix Missions list refresh after creation and reliable task toggle persistence",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "After creating a mission, update React Query caches safely so the new mission appears immediately in “Your Missions” without runtime errors and with correct sorting/progress.",
      "acceptanceCriteria": [
        "From Missions list, open the mission creation dialog, create a mission, and close the dialog: the new mission is visible immediately in \"Your Missions\".",
        "No runtime error is thrown during or after creation (including inside React Query mutation callbacks).",
        "The new mission row shows the correct title, task count, and progress based on its tasks.",
        "The list order remains consistent with existing sorting behavior (newest missions first, based on created timestamp)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useMissionsQueries.ts",
          "operation": "modify",
          "description": "Harden the create-mission mutation so it never throws from React Query lifecycle callbacks; ensure the missions list cache is updated with the persisted mission when available, and that any cache insertion preserves the existing newest-first ordering by created timestamp. Keep the final invalidate/refetch behavior consistent so the list remains correct without requiring manual refresh."
        },
        {
          "path": "frontend/src/components/MissionEditorDialog.tsx",
          "operation": "modify",
          "description": "Ensure the dialog close flow relies on mutation completion and does not mask/trigger runtime errors; keep create button disabled/loading behavior aligned with the mutation state so the user sees immediate success and the list can render the new mission row right away."
        },
        {
          "path": "frontend/src/components/MissionsFullScreenView.tsx",
          "operation": "modify",
          "description": "Verify the missions list view renders newly created missions from the React Query cache immediately and that row progress/task counts are derived from the mission’s tasks array consistently (no dependence on reopening the view). Keep existing rendering/sorting behavior intact."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Make task completion toggles persist reliably with immediate UI/progress updates and consistent cache hydration across navigation, including robust rollback/resync on backend failure.",
      "acceptanceCriteria": [
        "In Mission detail view, toggling a task updates the checkbox UI and the mission progress bar immediately.",
        "After toggling tasks, navigating back to \"Your Missions\" shows the correct completed task counts and progress bar for that mission.",
        "Re-opening the same mission shows the same tasks still completed (persisted), with the progress bar matching the persisted completion state.",
        "Task completion state is sourced consistently (no UI regressions where the mission detail re-hydrates from stale cached data and visually \"undoes\" recent toggles).",
        "If the backend update fails, the UI does not silently drift: the app either reverts the optimistic toggle to the previous state or clearly re-syncs from backend so that mission progress and task completion are consistent with persisted state."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useMissionsQueries.ts",
          "operation": "modify",
          "description": "Fix the task-toggle mutation to match the backend interface (toggle returns void) and implement React Query optimistic updates for both mission detail and missions list caches. Add onMutate snapshot/rollback, and onSettled invalidations to re-sync from backend so completion state/progress remain consistent across navigation and after failures."
        },
        {
          "path": "frontend/src/components/MissionDetailFullScreenView.tsx",
          "operation": "modify",
          "description": "Align the mission detail UI state with React Query cache updates so toggling a task immediately updates the checkbox state and progress bar without being overwritten by stale re-hydration. Ensure the detail view state re-syncs from cache after optimistic updates/rollbacks and that navigation back triggers consistent mission list progress rendering."
        },
        {
          "path": "frontend/src/components/MissionsFullScreenView.tsx",
          "operation": "modify",
          "description": "Ensure the missions list progress/task completion counts reflect the same cached mission task completion state updated by toggles (including after navigating back from detail). Confirm list rows update immediately after toggles via cache updates and are corrected by post-mutation re-sync if needed."
        }
      ]
    }
  ]
}