{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Swap suitcase branding icon to minimal purple mission target across onboarding and missions UI",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Replace the existing suitcase icon with a minimal purple target/mission icon on the welcome intro/onboarding screen and the yellow page’s top-left icon area, using the existing missions accent theme token for consistent light/dark legibility.",
      "acceptanceCriteria": [
        "On the welcome intro screen, the current icon is replaced by a minimal target icon rendered in purple (missions accent).",
        "On the yellow page’s top-left area, the current suitcase icon is replaced by the same minimal purple target icon.",
        "No other UI text is changed as part of this request.",
        "The replacement uses existing styling/theme tokens (missions accent) and remains legible in both light and dark mode."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/MissionTargetIcon.tsx",
          "operation": "create",
          "description": "Create a small shared React component that renders a minimal target/mission icon (e.g., lucide-react Target) styled with the existing missions purple theme token (Tailwind text-missions-accent) and supports a configurable size/className so it can be reused in multiple UI locations."
        },
        {
          "path": "frontend/src/components/WelcomeIntroScreen.tsx",
          "operation": "modify",
          "description": "Replace the current onboarding icon usage with the shared MissionTargetIcon component so the welcome intro/onboarding screen shows the minimal purple target icon using missions accent styling; keep all existing copy/text unchanged."
        },
        {
          "path": "frontend/src/components/MissionsFullScreenView.tsx",
          "operation": "modify",
          "description": "Update the top-left icon in the missions (yellow-themed) header area to use the same shared MissionTargetIcon component to ensure the suitcase icon (if present) is replaced consistently and the icon color uses text-missions-accent for light/dark legibility."
        }
      ]
    }
  ]
}