{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix gallery bulk action bar stacking above floating Folders/Missions buttons in multi-select",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Ensure the Gallery multi-select bulk action bar renders and receives input above the floating Folders/Missions buttons while multi-select is active, and restore normal button stacking when multi-select ends.",
      "acceptanceCriteria": [
        "Enter multi-select mode in the gallery and select at least 1 item: the bulk action bar overlaps the screen above the floating Folders/Missions buttons (i.e., higher stacking order) and is not obscured by them.",
        "While the bulk action bar is visible, tapping/clicking any of its actions (Folder, Mission, Share, Download, Delete) works reliably even if the bar visually overlaps the floating Folders/Missions buttons.",
        "Exit multi-select mode (Cancel or after completing an action): the floating Folders/Missions buttons return to their normal visibility/stacking behavior."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/GallerySection.tsx",
          "operation": "modify",
          "description": "Increase the bulk action bar stacking priority (e.g., higher z-index than the floating buttons) and add a small, explicit signal (callback prop) to inform the parent when the bulk action bar is visible (selectionMode true with at least one selected item), so other UI can adjust layering/interaction accordingly."
        },
        {
          "path": "frontend/src/pages/HomePage.tsx",
          "operation": "modify",
          "description": "Track whether the Gallery bulk action bar is currently visible via a callback from GallerySection, and wire that state into the floating Folders/Missions buttons so they do not sit above or steal interaction from the bulk action bar during multi-select; ensure normal behavior resumes when multi-select ends."
        },
        {
          "path": "frontend/src/components/FoldersButton.tsx",
          "operation": "modify",
          "description": "Add an optional prop (e.g., overlayMode/behindOverlay) to adjust layering and interaction when the Gallery bulk action bar is visible (e.g., lower z-index than the bulk bar and/or disable pointer events during overlay) without changing normal appearance when the overlay is not active."
        },
        {
          "path": "frontend/src/components/MissionsButton.tsx",
          "operation": "modify",
          "description": "Add an optional prop (e.g., overlayMode/behindOverlay) to adjust layering and interaction when the Gallery bulk action bar is visible (e.g., lower z-index than the bulk bar and/or disable pointer events during overlay) without changing normal appearance when the overlay is not active."
        }
      ]
    }
  ]
}