{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Hide swipe Edit/Delete actions until reveal threshold across Folders, Notes, and Missions",
  "requirements": [
    {
      "id": "REQ-7",
      "summary": "Update SwipeActionsRow so Edit/Rename and Delete are fully hidden by default and only become visible after a left-swipe reveal threshold, with no overlay when closed.",
      "acceptanceCriteria": [
        "In Folders, Notes (mobile/coarse pointer), and Missions (mobile/coarse pointer), when a list row is initially rendered and not swiped, no Edit/Rename/Delete buttons are visible on screen.",
        "After swiping a row to the left past the reveal threshold, the Edit/Rename and Delete buttons become visible for that row.",
        "When the row is swiped back (or otherwise closed), the action buttons are no longer visible and do not overlay the content.",
        "Tapping/clicking the row content when the row is closed behaves the same as before (e.g., select/open), with no accidental interaction with hidden action buttons."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/SwipeActionsRow.tsx",
          "operation": "modify",
          "description": "Change the layout and interaction model so action buttons render visually behind the row content when closed (content above actions via stacking), and make actions switch from fully hidden to visible only after the swipe passes the reveal threshold. Ensure hidden actions do not intercept pointer/touch events (e.g., disable pointer events when closed/hidden) to prevent accidental taps, while preserving current swipe open/close behavior."
        }
      ]
    },
    {
      "id": "REQ-8",
      "summary": "Apply the updated SwipeActionsRow reveal behavior consistently in all usages (Folders, Notes coarse pointer, Missions coarse pointer) without any backend changes.",
      "acceptanceCriteria": [
        "Folders list rows do not show swipe actions until a left swipe reveals them.",
        "Notes list rows (on coarse pointer devices) do not show swipe actions until a left swipe reveals them.",
        "Missions list rows (on coarse pointer devices) do not show swipe actions until a left swipe reveals them.",
        "No backend API changes are introduced as part of this work."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/FoldersDialog.tsx",
          "operation": "modify",
          "description": "Verify folder rows using SwipeActionsRow still behave correctly with the new hidden-by-default actions (no visible buttons until reveal; no overlap when closed), and adjust any row/container styling or interaction wiring if needed to match the updated SwipeActionsRow behavior."
        },
        {
          "path": "frontend/src/components/NotesFullScreenView.tsx",
          "operation": "modify",
          "description": "Verify Notes list coarse-pointer rendering via SwipeActionsRow matches the new hidden-by-default reveal behavior and that tapping the row content when closed continues to select/open the note without interference from hidden actions; make any minimal adjustments needed to align with the updated SwipeActionsRow behavior."
        },
        {
          "path": "frontend/src/components/MissionsFullScreenView.tsx",
          "operation": "modify",
          "description": "Verify Missions list coarse-pointer rendering via SwipeActionsRow matches the new hidden-by-default reveal behavior and that tapping the row content when closed continues to open the mission without interference from hidden actions; make any minimal adjustments needed to align with the updated SwipeActionsRow behavior."
        }
      ]
    }
  ]
}