{
  "schemaVersion": "1.0.0",
  "projectStateVersion": 28,
  "summary": "MyGallery is a PWA multimedia gallery app built for the Internet Computer. Authenticated users sign in with Internet Identity, upload multiple files (images/videos/documents) to an IC canister, browse a main “Collection” and per-folder views, preview content (including full-screen viewing with swipe/keyboard navigation), and organize files using folders (create/rename/delete, move files between folders or back to the main collection). The UI supports multi-select via long-press, batch actions (move/share/download/delete), and a global upload progress indicator. The backend is a Motoko canister that stores file metadata and blob references, enforces per-user ownership with an admin/user/guest access-control layer, and includes a blob-storage mixin for storage gateway authorization and garbage-collection workflows.",
  "existing_features": [
    {
      "id": "IF-1",
      "title": "Internet Identity authentication (login/logout)",
      "synonyms": [
        "II auth",
        "DFINITY AuthClient login"
      ],
      "description": "Provides an authentication context using Internet Identity. Supports initialization from stored sessions, login with a configurable identity provider, 30-day delegation TTL, and logout that clears identity state and errors.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-2",
      "title": "Backend actor creation and per-identity caching",
      "synonyms": [
        "IC actor initialization",
        "createActorWithConfig"
      ],
      "description": "Creates an IC backend actor configured with the current identity (or anonymous when unauthenticated). Actor instances are cached by principal via React Query, and switching identities invalidates/refetches dependent queries.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-3",
      "title": "Access control initialization via secret token",
      "synonyms": [
        "Admin token init",
        "_initializeAccessControlWithSecret"
      ],
      "description": "On actor creation for authenticated users, calls a canister method to initialize access control. If the provided user token matches the canister’s admin token env var and no admin is assigned yet, the caller becomes admin; otherwise the caller becomes a regular user.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-4",
      "title": "File upload with chunked parallelism and progress tracking",
      "synonyms": [
        "Multi-file upload",
        "Upload progress"
      ],
      "description": "Uploads multiple files to the backend using ExternalBlob. Uploads are chunked (3 files concurrently per batch) and can emit per-file progress updates that feed a global UploadContext and unified progress bar UI.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-5",
      "title": "Global upload state and unified progress bar",
      "synonyms": [
        "UploadContext",
        "UnifiedProgressBar"
      ],
      "description": "Tracks ongoing uploads across the app (per-file progress, total average progress, uploading count) and renders a compact progress bar beneath the header while uploads are active.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-6",
      "title": "Main collection file listing (files not in any folder)",
      "synonyms": [
        "Collection view",
        "Unfoldered files"
      ],
      "description": "Fetches and displays the user’s files that have no folder assignment using a paginated backend endpoint (currently fetched with offset 0 and limit 1000, sorted descending by created time).",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-7",
      "title": "Folder-scoped file listing",
      "synonyms": [
        "Folder view",
        "Files in folder"
      ],
      "description": "Fetches and displays files contained in a selected folder (offset 0, limit 1000). Used in both the main Gallery view and the folder content view within the folders dialog.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-8",
      "title": "Folder management (list, create, rename, delete)",
      "synonyms": [
        "FoldersDialog CRUD"
      ],
      "description": "Allows users to list folders, create new folders, rename folders with optimistic UI updates, and delete folders with optimistic removal and cache cleanup (including invalidation of affected file queries).",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-9",
      "title": "Move files between main collection and folders",
      "synonyms": [
        "Send to folder",
        "Move to folder"
      ],
      "description": "Supports moving one or many files into a chosen folder and returning files to the main collection by clearing folder assignment. Includes a dialog UI to choose destination and integrates with React Query cache updates.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-10",
      "title": "Single and batch file deletion with optimistic cache updates",
      "synonyms": [
        "Delete file",
        "Delete selected"
      ],
      "description": "Deletes files from the backend either singly or in batches. Batch deletes are chunked (50 IDs per call). The client applies optimistic removal across the main collection and all cached folder queries, with rollback on error and invalidation on success.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-11",
      "title": "Touch-first multi-select mode with long-press detection",
      "synonyms": [
        "Selection mode",
        "Long press select"
      ],
      "description": "Implements reliable long-press detection (with movement threshold and timers) for entering selection mode on mobile/touch devices. Supports selecting multiple items and shows a fixed bottom action bar for batch actions.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-12",
      "title": "Batch actions: Move, Share, Download, Delete",
      "synonyms": [
        "Selection action bar",
        "Multi-file actions"
      ],
      "description": "When selection mode is active, users can move selected files to folders, share via the Web Share API (where supported), download locally, or delete selected files.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-13",
      "title": "Full-screen viewer with swipe and keyboard navigation",
      "synonyms": [
        "FullScreenViewer",
        "Lightbox"
      ],
      "description": "Provides a full-screen overlay viewer for images, videos, and PDFs with swipe navigation on touch devices and arrow-key navigation on desktop. Includes actions to move/share/download/delete the current file.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-14",
      "title": "File preview dialog with type-aware rendering",
      "synonyms": [
        "FilePreviewDialog",
        "Document preview"
      ],
      "description": "Displays file metadata and previews for images, videos, PDFs, and Office docs (Word/Excel via Office Online embed). Provides open-in-new-tab, download, move-to-folder, and delete actions with a confirmation dialog.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-15",
      "title": "Download support for individual and selected files",
      "synonyms": [
        "Save file locally"
      ],
      "description": "Implements client-side downloads using either direct URLs or fetching bytes from the blob, creating an object URL, and triggering an anchor download for each selected file.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-16",
      "title": "Native sharing via Web Share API",
      "synonyms": [
        "navigator.share",
        "Share sheet"
      ],
      "description": "Uses the Web Share API to share one or multiple files by fetching each file URL, converting to Blob/File objects, and invoking navigator.share with files payload (when supported).",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-17",
      "title": "PWA support (manifest, icons, service worker)",
      "synonyms": [
        "Installable app",
        "Offline caching"
      ],
      "description": "Includes a PWA manifest with icons and metadata, and a service worker with minimal precaching and network-first runtime caching for fast startup. Registers SW and handles update messages (per project summary).",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-18",
      "title": "Theme toggle and Tailwind-based design system",
      "synonyms": [
        "Dark mode",
        "next-themes"
      ],
      "description": "Supports light/dark themes via next-themes and Tailwind CSS design tokens. UI includes animated iconography, intro screen animation, and decorative layout elements (header/footer/bottom line).",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-19",
      "title": "Backend file metadata and folder model with ownership checks",
      "synonyms": [
        "Motoko file store",
        "Per-user isolation"
      ],
      "description": "Motoko backend stores FileMetadata (id, name, mimeType, size, createdAt, blob reference, optional folderId, owner) and Folder records (id, name, createdAt, owner). Enforces that users can only access/modify their own resources (with admin role checks in some paths).",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-20",
      "title": "Backend access control roles and admin assignment",
      "synonyms": [
        "authorization/access-control",
        "Role-based permissions"
      ],
      "description": "Implements roles (#admin, #user, #guest) and permission checks. Initializes roles on first registration, allows admin-only role assignment, and exposes methods to query role and admin status.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-21",
      "title": "Backend blob-storage gateway authorization and GC tooling",
      "synonyms": [
        "caffeine storage mixin",
        "Dead blob pruning"
      ],
      "description": "Includes storage mixins to manage authorized gateway principals, query blob liveness, fetch dead blobs for deletion (authorized callers only), confirm deletions and trigger GC, and support cashier refill workflows using cycles.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "feature-eliminate-any-artificial-startup-delay-that-prevents-the-home-page-from-rendering-immediately-after-the-app-mounts-e-g-remove-the-timed-showcontent-gate-so-users-do-not-see-blank-blocked-ui-on-first-load",
      "title": "Eliminate any artificial startup delay that prevents the Home page from rendering immediately after the app mounts (e.g., remove the timed `showContent` gate) so users do not see blank/blocked UI on first load.",
      "reqIds": [
        "REQ-1"
      ],
      "version": 1
    },
    {
      "id": "feature-make-actor-initialization-fail-fast-and-non-blocking-ensure-that-backend-actor-creation-and-access-control-initialization-cannot-leave-the-ui-stuck-in-an-infinite-initializing-state-surface-actor-initialization-errors-to-the-ui-as-an-explicit-error-state-with-recovery-actions",
      "title": "Make actor initialization fail-fast and non-blocking: ensure that backend actor creation and access-control initialization cannot leave the UI stuck in an infinite 'Initializing…' state. Surface actor initialization errors to the UI as an explicit error state with recovery actions.",
      "reqIds": [
        "REQ-2"
      ],
      "version": 1
    },
    {
      "id": "feature-prevent-unnecessary-actor-initialization-work-during-unauthenticated-startup-to-improve-perceived-load-time-do-not-create-initialize-the-backend-actor-until-it-is-required-for-an-authenticated-session-or-an-authenticated-only-action",
      "title": "Prevent unnecessary actor initialization work during unauthenticated startup to improve perceived load time: do not create/initialize the backend actor until it is required for an authenticated session or an authenticated-only action.",
      "reqIds": [
        "REQ-3"
      ],
      "version": 1
    }
  ],
  "new_feature_requests": [],
  "architecturalNotes": [
    "Frontend is React + TypeScript with TanStack React Query for data fetching/caching, including optimistic updates for folder rename/delete and file move/delete flows.",
    "Authentication is handled via a custom InternetIdentityProvider using @dfinity/auth-client and DelegationIdentity validation; sessions are configured with a 30-day maxTimeToLive.",
    "IC canister integration is abstracted via a backend actor created by createActorWithConfig; actor instances are cached by principal and trigger global query invalidation/refetch on identity changes.",
    "Upload pipeline uses ExternalBlob from the generated backend bindings, supports per-file progress callbacks, and performs chunked parallel uploads (batch size 3).",
    "Batch deletion is chunked on the client (batch size 50) to avoid oversized calls; client cache is updated optimistically across multiple folder query caches.",
    "UI composition uses reusable dialogs/viewers (FoldersDialog, SendToFolderDialog, FullScreenViewer, FilePreviewDialog) with touch-first interaction patterns (long-press detection, swipe navigation, vibration feedback).",
    "Styling is Tailwind CSS with next-themes for dark/light mode; OKLCH-based design tokens and animated intro/icon components are used for a polished UI.",
    "PWA support includes manifest metadata and a custom service worker using a network-first strategy with minimal precaching for fast startup.",
    "Backend Motoko code uses mixins (MixinAuthorization, MixinStorage) to compose access control and storage/GC-related functionality into the main actor.",
    "Backend persistence uses in-memory Map structures keyed by numeric IDs; file IDs are exposed as Text (stringified numeric IDs), while folders are Nat IDs.",
    "Authorization model: first registered principal becomes admin only if they provide a token matching an env var; otherwise principals are registered as user. Role assignment is admin-only.",
    "Blob storage utilities rely on environment-provided principals (cashier) and a gateway principal allowlist updated from a cashier canister; dead-blob pruning and GC triggering are exposed to authorized callers.",
    "UI component foundation now includes shadcn/ui-style primitives (accordion, dialog, dropdown-menu, sheet, sidebar, etc.) integrated into the frontend build template.",
    "Frontend linting/tooling now includes custom ESLint rules to enforce safe React Query key usage (no BigInt in query keys) and to require use of the InternetIdentityProvider abstraction for auth integration."
  ],
  "knownIssues": [
    "Frontend likely nests QueryClientProvider twice (main.tsx wraps App, and App also wraps content with its own QueryClientProvider), which can lead to unexpected caching behavior and duplicated clients.",
    "There appear to be two different CSS entry files shown (frontend/src/index.css and frontend/index.css) with conflicting theme token definitions; build configuration should ensure only the intended stylesheet is used.",
    "Backend access control can trap for unregistered users: AccessControl.getUserRole traps if a principal hasn’t been initialized; anonymous actors (created when not authenticated) would not be initialized, so calling protected methods would trap (UI currently avoids this, but it’s a sharp edge).",
    "Backend admin checks are present in several endpoints, but queries that return lists (getPaginatedFiles/getFilesInFolder/getAllFolders) additionally filter by owner == caller, meaning admins cannot actually list other users’ files/folders despite earlier admin checks.",
    "Backend file lookup by Text id uses a linear scan over the Map (findFileByTextId via toArray().find), which may become a performance bottleneck as file counts grow.",
    "Backend folder deletion removes files in that folder for the caller, but does not explicitly address blob lifecycle; actual blob cleanup relies on IC storage/GC/dead-blob mechanisms and gateway workflows.",
    "Potential configuration typo risk: blob-storage env var key is spelled \"CAFFFEINE_STORAGE_CASHIER_PRINCIPAL\" (multiple 'F's), which may not match deployment expectations.",
    "createFolder returns ?Text (string id) while the primary folder identifier used elsewhere is Nat/bigint; the returned value is not used by the frontend beyond mutation success, but the API shape is inconsistent.",
    "Client-side file listings use fixed limits (0..1000) and staleTime 0 with frequent refetching; this may not scale well for large libraries.",
    "IntroScreen opacity logic makes the screen start at opacity-0 until animation begins; this may be intentional but can look like a flash/blank period depending on timing and rendering.",
    "App can get stuck showing an “initializing / please wait while the app initializes…” state on launch, causing continuous loading and preventing normal use until it resolves."
  ],
  "isFixRequest": true,
  "generatedImages": [],
  "gameProjectType": "none",
  "projectName": "MyGallery",
  "clarification_mode": "instant",
  "clarification_rounds": 0,
  "requiresBackendChanges": false,
  "requiresFrontendChanges": true
}