{
  "schemaVersion": "1.0.0",
  "projectStateVersion": 3,
  "summary": "MyGallery is an installable Progressive Web App (React + TypeScript + Tailwind + shadcn/ui) backed by a Motoko canister on the Internet Computer. Users authenticate with Internet Identity (persisted long-lived delegations). After login, the frontend initializes an identity-bound canister actor with an explicit lifecycle (idle/initializing/ready/unavailable/error), optional access-control bootstrap via a secret token, and retry/backoff behavior for stopped-canister scenarios. The app provides a personal file library: upload (with progress), browse a main Collection and folder views, preview supported formats (images, videos, PDFs, Office docs via Office Online embed), and manage files via move-to-folder, download, share (Web Share API), and delete (single/bulk). It also includes per-user Notes and Missions (checklist tasks with progress) persisted in the canister, plus backend diagnostics/health endpoints and blob-storage maintenance/cycles refill operations.",
  "existing_features": [
    {
      "id": "IF-1",
      "title": "Installable PWA configuration (manifest + icons + meta)",
      "synonyms": [
        "PWA installability",
        "manifest.json",
        "apple-touch-icon"
      ],
      "description": "Provides PWA install metadata (name, colors, start_url, display=standalone) and comprehensive favicon/iOS icon + meta tag configuration for MyGallery branding.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-2",
      "title": "Service worker with minimal precache and network-first runtime caching",
      "synonyms": [
        "sw.js",
        "runtime cache",
        "offline fallback"
      ],
      "description": "Implements a lightweight service worker that activates immediately, cleans old caches, and uses network-first fetch handling with cache fallback for navigations and GET assets (excluding canister/API paths).",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-3",
      "title": "Theme system (light/dark/system) with toggle and OKLCH tokens",
      "synonyms": [
        "next-themes",
        "ThemeProvider",
        "OKLCH CSS variables"
      ],
      "description": "App-wide theming using next-themes and Tailwind color tokens backed by OKLCH CSS variables, with a header toggle for light/dark switching.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-4",
      "title": "Internet Identity authentication with persisted delegations",
      "synonyms": [
        "AuthClient",
        "DelegationIdentity",
        "30-day session"
      ],
      "description": "Supports Internet Identity login/logout, restores stored identities on reload, and requests ~30-day delegations on login; exposes detailed login status flags for UI gating.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-5",
      "title": "Unauthenticated welcome screen with login CTA",
      "synonyms": [
        "WelcomeIntroScreen",
        "Sign In with Internet Identity"
      ],
      "description": "Shows a dedicated welcome screen for unauthenticated users, with English copy and a login button wired to Internet Identity.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-6",
      "title": "Post-login intro screen shown only after a fresh login event",
      "synonyms": [
        "IntroScreen",
        "one-time session intro"
      ],
      "description": "Displays a timed animated intro only immediately after a successful login event and only once per in-memory session; restored delegations skip the intro.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-7",
      "title": "Secret token handling via URL hash + session persistence + normalization",
      "synonyms": [
        "caffeineAdminToken",
        "sessionStorage",
        "hash cleanup",
        "normalizeAdminToken"
      ],
      "description": "Extracts sensitive parameters from the URL hash fragment, persists them in sessionStorage, clears them from the visible URL, and normalizes whitespace-only tokens to null.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-8",
      "title": "ActorContext: identity-bound backend actor initialization with lifecycle state and retry/backoff",
      "synonyms": [
        "ActorContext",
        "idle/initializing/ready/unavailable/error",
        "exponential backoff"
      ],
      "description": "Creates an identity-bound actor after authentication, optionally runs access-control bootstrap when a normalized token is present, silently retries stopped-canister failures with backoff under a retry budget, and exposes retry/sign-out actions with a final failure screen.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-9",
      "title": "Standardized actor initialization error classification and messaging",
      "synonyms": [
        "mapActorInitError",
        "IC0508 detection",
        "reject_code 5"
      ],
      "description": "Centralizes detection and mapping for stopped-canister, invalid admin token, actor-not-ready, and initialization failures into English summaries plus serialized technical details for UI display.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-10",
      "title": "Unified sign-out clears identity, actor state, and React Query cache",
      "synonyms": [
        "ActorContext.signOut",
        "queryClient.clear"
      ],
      "description": "Implements a single sign-out path that cancels init retries, logs out from Internet Identity, clears React Query cache, and resets actor lifecycle state.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-11",
      "title": "React Query data layer gated by actor readiness and authentication",
      "synonyms": [
        "@tanstack/react-query",
        "enabled gating"
      ],
      "description": "Queries and mutations for files, folders, notes, and missions only run when an authenticated identity exists and ActorContext reports status=ready, with cache invalidation and optimistic update patterns.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-12",
      "title": "Upload UI with readiness gating and toast feedback",
      "synonyms": [
        "FileUploadSection",
        "sonner toasts"
      ],
      "description": "Provides a multi-file upload input/dropzone, disables it until the actor is ready, tracks uploads via UploadContext, and shows success/failure toasts.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-13",
      "title": "Multi-file upload with chunked concurrency and per-file progress callbacks",
      "synonyms": [
        "useUploadFiles",
        "ExternalBlob.withUploadProgress"
      ],
      "description": "Uploads multiple files in small concurrent chunks, converts File objects to bytes, sends them to the canister, and optionally emits per-file progress callbacks.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-14",
      "title": "Global upload progress aggregation and unified progress bar",
      "synonyms": [
        "UploadContext",
        "UnifiedProgressBar"
      ],
      "description": "Tracks upload batches and per-file progress globally, computes aggregate progress, and displays a compact progress bar under the header while uploads are active.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-15",
      "title": "Main collection and folder-scoped file listing",
      "synonyms": [
        "getPaginatedFiles",
        "getFilesInFolder"
      ],
      "description": "Lists files not assigned to any folder as the main Collection and lists files within a selected folder using backend pagination parameters.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-16",
      "title": "Gallery grid UI with loading/empty/error states and MIME-aware tiles",
      "synonyms": [
        "GallerySection",
        "Skeleton loading",
        "MIME icons"
      ],
      "description": "Renders a file grid with skeleton loading, empty and error states; uses image thumbnails, video previews, and MIME-based icons for other file types.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-17",
      "title": "Touch long-press multi-select mode with bulk actions",
      "synonyms": [
        "selectionMode",
        "bulk toolbar",
        "vibration feedback"
      ],
      "description": "Supports touch long-press to enter selection mode, visually marks selections, and enables bulk move-to-folder, share, download, and delete actions via a fixed bottom action bar.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-18",
      "title": "Move files into folders and return files to main collection",
      "synonyms": [
        "moveFilesToFolder",
        "removeFromFolder",
        "SendToFolderDialog"
      ],
      "description": "Moves one or many files into a selected folder and supports returning foldered files back to the main collection by removing folder assignment.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-19",
      "title": "Folder management UI (list/create/rename/delete) with optimistic updates",
      "synonyms": [
        "FoldersDialog",
        "optimistic UI"
      ],
      "description": "Implements folder listing, creation, renaming, and deletion via React Query mutations, including optimistic cache updates with rollback for rename/delete.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-20",
      "title": "Single and bulk file deletion with chunking and optimistic cache updates",
      "synonyms": [
        "deleteFile",
        "deleteFiles",
        "CHUNK_SIZE=50"
      ],
      "description": "Deletes individual files and bulk deletes in backend-sized chunks, applying optimistic cache updates across main and folder queries with rollback on error.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-21",
      "title": "File preview dialog with metadata and actions",
      "synonyms": [
        "FilePreviewDialog",
        "preview modal"
      ],
      "description": "Shows a per-file modal preview (image/video/PDF/Office via iframe), displays MIME type, created date, size, and provides actions for open externally, download, move to folder, and delete with confirmation.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-22",
      "title": "Full-screen in-app viewer with navigation and action bar",
      "synonyms": [
        "FullScreenViewer",
        "swipe navigation",
        "keyboard navigation"
      ],
      "description": "Provides a full-screen viewer for supported formats with touch swipe + keyboard navigation and actions for move, share, download, delete, and Office ‘New Tab’ opening.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-23",
      "title": "External open + download utilities with popup-blocker fallback dialog",
      "synonyms": [
        "openExternally",
        "downloadFile",
        "ExternalOpenFallbackDialog"
      ],
      "description": "Attempts to open files in a new tab/window with popup-blocker detection; when blocked, shows a dialog offering retry or a reliable fetch+blob download fallback.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-24",
      "title": "Web Share API integration for sharing files",
      "synonyms": [
        "navigator.share",
        "share files"
      ],
      "description": "Shares single or multiple selected files by fetching direct URLs, creating File objects, and invoking the Web Share API when available.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-25",
      "title": "Notes: per-user multi-note CRUD with full-screen responsive UI",
      "synonyms": [
        "NotesFullScreenView",
        "list/create/update/delete notes"
      ],
      "description": "Implements per-user notes stored in the canister with React Query hooks for list/detail/create/update/delete and a full-screen UI optimized for mobile (list/editor switching) and desktop (split view), including relative time formatting.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-26",
      "title": "Missions: per-user missions with tasks and progress tracking",
      "synonyms": [
        "MissionsFullScreenView",
        "MissionDetailFullScreenView",
        "task checklist"
      ],
      "description": "Implements per-user missions stored in the canister with task checklists, progress calculation, and CRUD operations via React Query hooks, with full-screen list and detail editing views.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-27",
      "title": "Backend role-based access control with optional admin bootstrap",
      "synonyms": [
        "AccessControl",
        "MixinAuthorization",
        "CAFFEINE_ADMIN_TOKEN"
      ],
      "description": "Implements role tracking (admin/user/guest), admin bootstrap via an environment token plus user-provided secret, role queries, and admin-only role assignment; backend methods enforce permissions.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-28",
      "title": "Backend file storage with ownership enforcement and folder organization",
      "synonyms": [
        "uploadFile",
        "getFile",
        "getPaginatedFiles",
        "moveFilesToFolder",
        "deleteFiles"
      ],
      "description": "Stores file blobs and metadata, enforces per-owner access (admin override), supports listing (unfoldered and folder-scoped), moving to/from folders, and deletion (single/bulk).",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-29",
      "title": "Backend folder storage (per-user) with cascading cleanup on delete",
      "synonyms": [
        "createFolder",
        "getAllFolders",
        "renameFolder",
        "deleteFolder"
      ],
      "description": "Implements per-user folder CRUD with ownership checks; deleting a folder removes the caller’s files assigned to that folder.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-30",
      "title": "Backend notes storage (per-user)",
      "synonyms": [
        "createNote",
        "updateNote",
        "listNotes"
      ],
      "description": "Stores notes per principal with ownership enforced; supports create/get/update/delete/list operations.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-31",
      "title": "Backend missions storage (per-user)",
      "synonyms": [
        "createMission",
        "updateMission",
        "listMissions"
      ],
      "description": "Stores missions per principal with tasks, supports create/get/update/delete/list operations, and enforces ownership via access control.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-32",
      "title": "Backend user profile endpoints",
      "synonyms": [
        "getCallerUserProfile",
        "saveCallerUserProfile",
        "getUserProfile"
      ],
      "description": "Stores and retrieves a simple per-user profile record with access controls (users can access their own; admins can access others).",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-33",
      "title": "Backend health and diagnostics endpoints",
      "synonyms": [
        "getHealth",
        "getDiagnostics",
        "cycles balance"
      ],
      "description": "Exposes query endpoints returning build/version information and current cycles balance for operational visibility.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-34",
      "title": "Blob-storage maintenance and cycles refill endpoints (backend)",
      "synonyms": [
        "_caffeineStorageUpdateGatewayPrincipals",
        "_caffeineStorageBlobsToDelete",
        "_caffeineStorageConfirmBlobDeletion",
        "_caffeineStorageRefillCashier"
      ],
      "description": "Provides maintenance endpoints for updating authorized gateway principals, listing/confirming dead blob deletions (including GC trigger), and cashier-driven cycles top-ups.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-35",
      "title": "Baseline parity and change-control documentation (Live v114)",
      "synonyms": [
        "DRAFT_BASELINE_V114",
        "RESTORE_LIVE_V114_CHECKLIST",
        "V114_BASELINE_FRONTEND_FILES"
      ],
      "description": "Includes documentation and canonical file lists to validate and preserve 1:1 parity with Live version 114 and enforce post-restore change-control policies.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "feature-update-the-subtitle-intro-text-displayed-directly-under-the-welcome-to-mygallery-heading-on-the-unauthenticated-welcome-screen-frontend-src-components-welcomeintroscreen-tsx-to-exactly-this-english-copy-preserve-the-two-sentences-this-is-your-personal-space-for-organization-and-self-improvement-create-missions-break-them-into-tasks-and-complete-them-step-by-step",
      "title": "Update the subtitle/intro text displayed directly under the \"Welcome to MyGallery\" heading on the unauthenticated welcome screen (frontend/src/components/WelcomeIntroScreen.tsx) to exactly this English copy (preserve the two sentences):\n\n\"This is your personal space for organization and self-improvement.\nCreate missions, break them into tasks, and complete them step by step.\"",
      "reqIds": [
        "REQ-1"
      ],
      "version": 1
    }
  ],
  "new_feature_requests": [
    {
      "id": "AR-1",
      "summary": "Update the welcome/intro screen subtitle text (below 'Welcome to MyGallery') to the provided English copy about organization and self-improvement/missions.",
      "reqIds": [],
      "status": "pending"
    }
  ],
  "architectural_notes": [
    "Frontend is a React SPA using function components, TypeScript, TailwindCSS (OKLCH CSS variables), and shadcn/ui primitives (Dialog, AlertDialog, DropdownMenu, ScrollArea, Progress, Checkbox, Collapsible).",
    "Authentication is handled via an InternetIdentityProvider built on @dfinity/auth-client; it restores stored delegations and requests ~30-day maxTimeToLive delegations on login.",
    "Backend access is performed through an identity-bound canister actor created by createActorWithConfig; ActorContext owns actor lifecycle state and exposes retry/signOut actions.",
    "Actor initialization includes centralized error classification/messaging and implements silent exponential-backoff retries for stopped-canister errors before showing a final error screen.",
    "TanStack React Query is used as the server-state layer (files, folders, notes, missions), gated on (identity present && actor status === ready), with cache invalidation and optimistic update patterns in mutations.",
    "Uploads are coordinated via a global UploadContext; the upload mutation uses ExternalBlob progress callbacks to provide per-file progress and an aggregated progress bar.",
    "File UX is MIME-aware: thumbnails for images, video previews, in-app preview for PDFs, Office docs previewed via Office Online embed, and download-only for unsupported types; external open attempts handle popup-blocker failure with a fallback dialog.",
    "Backend is a Motoko canister composed via mixins (authorization/access-control and blob-storage maintenance). Access control and ownership checks are enforced in backend methods."
  ],
  "known_issues": [
    "frontend/src/hooks/useActor.ts is a legacy hook that always calls _initializeAccessControlWithSecret(getSecretParameter(...) || ''), which can reintroduce bootstrap/token pitfalls or traps (e.g., if CAFFEINE_ADMIN_TOKEN is not set) if used accidentally instead of ActorContext.",
    "Some component files are empty placeholders (frontend/src/components/NotesDialog.tsx, frontend/src/components/ConnectivityIndicator.tsx, frontend/src/components/ProfileSetupDialog.tsx), which can cause confusion and baseline-drift ambiguity.",
    "Notes sorting in useListNotes() uses Number(b.updatedAt - a.updatedAt) on bigint timestamps, which can lose precision for large values and cause unstable ordering.",
    "Multiple bigint-to-Date conversions use Number(bigint)/1_000_000; extremely large timestamps could overflow JS safe integer range (edge case).",
    "File/folder queries use fixed pagination windows (offset 0, limit 1000) with staleTime=0; this may not scale for large libraries and can cause frequent refetching.",
    "Uploads read entire files into memory via File.arrayBuffer(); large uploads may cause memory pressure and slowdowns (no streaming upload).",
    "SendToFolderDialog 'Return to main collection' removes files from folders by calling removeFromFolder sequentially per file; bulk operations could be slow for large selections.",
    "Service worker precaches only /manifest.json but navigation fallback tries caches.match('/index.html'); first-time offline navigation may fail unless /index.html has been cached at runtime.",
    "Backend stores most state in non-stable variables/Maps; canister upgrades may risk data loss without stable memory migration logic (migration.mo is effectively a no-op).",
    "Backend helper findFileByTextId does a linear scan over all stored files, which will degrade performance as file count grows.",
    "Backend createFolder returns ?Text while Folder.id is Nat; this API shape inconsistency complicates typing and client expectations.",
    "Environment variable CAFFFEINE_STORAGE_CASHIER_PRINCIPAL appears misspelled (extra 'F'), increasing deployment/configuration risk."
  ],
  "isFixRequest": false,
  "gameProjectType": "none",
  "projectName": "MyGallery",
  "clarification_mode": "instant",
  "clarification_rounds": 0
}