{
  "schemaVersion": "1.0.0",
  "projectStateVersion": 3,
  "summary": "MyGallery is an installable Progressive Web App (Vite + React + TypeScript + Tailwind + shadcn/ui) backed by a Motoko canister on the Internet Computer. Users authenticate via Internet Identity (with ~30-day persisted delegations). After authentication, the app initializes an identity-bound canister actor with explicit lifecycle state, silent retry/backoff for stopped-canister outages, and a final-failure error screen with retry/sign-out. The core product is a personal file library: upload multiple files with progress tracking, browse a main “Collection” and folder views, preview common formats (images/videos/PDFs/Office via Office Online embed), and perform actions such as move-to-folder, download, share (Web Share API), and single/bulk delete. The app also includes per-user Notes and Missions (task checklists with progress) with React Query caching, optimistic delete flows, and developer diagnostics logging. Backend operations are guarded by role-based access control bootstrapped via an admin token and include blob-storage maintenance and cycles refill endpoints plus health/diagnostics.",
  "existing_features": [
    {
      "id": "IF-1",
      "title": "Installable PWA metadata and icon set",
      "synonyms": [
        "PWA manifest",
        "favicons",
        "apple-touch-icon"
      ],
      "description": "Provides installable PWA configuration via manifest.json and extensive favicon/iOS icon + meta tags in index.html using MyGallery branding.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-2",
      "title": "Service worker with minimal precache and network-first runtime caching",
      "synonyms": [
        "sw.js",
        "runtime caching",
        "network-first"
      ],
      "description": "Implements a lightweight service worker that precaches minimal assets, activates quickly, and uses network-first fetching with cache fallback for navigations and GET requests (excluding canister/API paths).",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-3",
      "title": "Theme system (light/dark/system) with toggle",
      "synonyms": [
        "next-themes",
        "dark mode",
        "OKLCH tokens"
      ],
      "description": "App-wide theme handling via next-themes and Tailwind tokens backed by CSS variables; includes a header theme toggle and smooth transitions.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-4",
      "title": "Internet Identity authentication with persisted delegations",
      "synonyms": [
        "AuthClient",
        "DelegationIdentity",
        "30-day session"
      ],
      "description": "Supports Internet Identity login/logout, restores stored delegations on reload, and requests ~30-day delegations on login; exposes detailed login status flags for UI gating.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-5",
      "title": "Unauthenticated welcome screen and login CTA",
      "synonyms": [
        "WelcomeIntroScreen",
        "LoginButton"
      ],
      "description": "Shows a dedicated landing screen for unauthenticated users with intro copy and a “Sign In with Internet Identity” call-to-action.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-6",
      "title": "Post-login intro screen shown once per session",
      "synonyms": [
        "IntroScreen",
        "one-time intro"
      ],
      "description": "Displays a timed intro animation only immediately after a successful login event and only once per in-memory session; restored delegations skip the intro.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-7",
      "title": "Secret/admin token handling via URL hash with session persistence and cleanup",
      "synonyms": [
        "caffeineAdminToken",
        "hash secret",
        "sessionStorage"
      ],
      "description": "Extracts sensitive parameters from the URL hash, persists them in sessionStorage, normalizes whitespace-only tokens to absent, and removes secrets from the visible URL.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-8",
      "title": "ActorContext: identity-bound canister actor initialization with lifecycle and retry/backoff",
      "synonyms": [
        "ActorProvider",
        "idle/initializing/ready/unavailable/error",
        "exponential backoff"
      ],
      "description": "Creates an identity-bound actor after authentication, tracks readiness state, silently retries stopped-canister failures with exponential backoff under a retry budget, and exposes manual retry and sign-out that clears identity and React Query cache.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-9",
      "title": "Standardized actor initialization error classification and messaging",
      "synonyms": [
        "mapActorInitError",
        "IC0508 detection",
        "invalid admin token detection"
      ],
      "description": "Centralizes detection and mapping for stopped-canister, invalid admin token, actor-not-ready, and initialization failures into user-facing summaries plus serialized technical details.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-10",
      "title": "Final-failure actor init error screen with retry/sign-out and technical details",
      "synonyms": [
        "ActorInitErrorState",
        "technical details collapsible"
      ],
      "description": "Displays a dedicated error screen after retry budget exhaustion (or fatal errors), including contextual messaging, expandable technical details, and Retry/Sign Out actions.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-11",
      "title": "React Query data layer for files/folders gated by actor readiness",
      "synonyms": [
        "@tanstack/react-query",
        "enabled gating"
      ],
      "description": "Implements queries/mutations for file and folder operations that run only when identity exists and actor status is ready, with cache invalidation and optimistic updates for key mutations.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-12",
      "title": "Multi-file upload UI with readiness gating and toasts",
      "synonyms": [
        "FileUploadSection",
        "sonner toasts"
      ],
      "description": "Provides multi-file selection UI (click/drag area), disables interaction until the actor is ready, and shows success/failure toast notifications.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-13",
      "title": "Chunked concurrent multi-file upload with per-file progress callbacks",
      "synonyms": [
        "useUploadFiles",
        "ExternalBlob.withUploadProgress",
        "chunked concurrency"
      ],
      "description": "Uploads multiple files in small concurrent chunks, converts File objects to bytes, sends them to the canister, and emits per-file progress updates via ExternalBlob callbacks.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-14",
      "title": "Global upload progress aggregation and unified progress bar",
      "synonyms": [
        "UploadContext",
        "UnifiedProgressBar"
      ],
      "description": "Tracks upload batches and per-file progress globally, computes aggregate percentage across in-flight files, and renders a progress bar under the header with percent and file count.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-15",
      "title": "Main collection and folder-scoped file listing",
      "synonyms": [
        "Collection",
        "getPaginatedFiles",
        "getFilesInFolder"
      ],
      "description": "Lists files not assigned to any folder as the main Collection and lists files in a selected folder using backend pagination parameters.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-16",
      "title": "Folder management (list/create/rename/delete) with swipe-to-reveal actions and optimistic updates",
      "synonyms": [
        "FoldersDialog",
        "SwipeActionsRow",
        "optimistic rename/delete"
      ],
      "description": "Implements folder CRUD with optimistic cache updates/rollback and swipe-to-reveal Edit/Delete actions (hidden by default). Folder creation forces invalidation + refetch to ensure newly created folders appear immediately.",
      "reqIds": [
        "REQ-5",
        "REQ-6"
      ],
      "version": 1
    },
    {
      "id": "IF-17",
      "title": "Move files into folders and return files to main collection",
      "synonyms": [
        "moveFilesToFolder",
        "removeFromFolder",
        "SendToFolderDialog"
      ],
      "description": "Moves one or many files into a selected folder and supports returning files back to the main collection by removing folder assignment.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-18",
      "title": "Gallery grid UI with loading/empty/error states and MIME-aware tiles",
      "synonyms": [
        "GallerySection",
        "Skeleton loading",
        "MIME icons"
      ],
      "description": "Renders a responsive file grid with skeleton loading, empty and error states; shows image thumbnails, video previews, and MIME-based icons for other file types.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-19",
      "title": "Long-press multi-select mode with bulk action toolbar",
      "synonyms": [
        "selectionMode",
        "bulk toolbar",
        "vibration feedback"
      ],
      "description": "Supports long-press to enter selection mode, toggling selections on tap, and bulk actions (move/share/download/delete) via a fixed bottom action bar.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-20",
      "title": "Single and bulk file deletion with chunking and optimistic cache updates",
      "synonyms": [
        "deleteFile",
        "deleteFiles",
        "CHUNK_SIZE=50",
        "optimistic removal"
      ],
      "description": "Deletes individual files and bulk deletes in backend-sized chunks, applying optimistic cache updates across main and per-folder queries with rollback on error.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-21",
      "title": "Full-screen in-app viewer with navigation and file actions",
      "synonyms": [
        "FullScreenViewer",
        "swipe navigation",
        "keyboard navigation"
      ],
      "description": "Provides a full-screen modal viewer for images/videos/PDFs and Office docs (Office Online embed) with swipe and keyboard navigation plus actions for move/share/download/delete and Office “New Tab”.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-22",
      "title": "File preview dialog with type-specific rendering and actions",
      "synonyms": [
        "FilePreviewDialog",
        "iframe preview"
      ],
      "description": "Modal preview for a single file with MIME-specific rendering (image/video/PDF/Office embed) and actions including open in new tab, download, move to folder, and delete with confirmation.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-23",
      "title": "External open and download utilities with popup-blocker fallback dialog",
      "synonyms": [
        "openExternally",
        "downloadFile",
        "ExternalOpenFallbackDialog"
      ],
      "description": "Attempts to open files in a new tab/window and detects popup blocking; if blocked, shows a dialog offering retry or a fetch+blob download fallback.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-24",
      "title": "Web Share API integration for sharing files",
      "synonyms": [
        "navigator.share",
        "share files"
      ],
      "description": "Shares single or multiple files by fetching direct URLs, constructing File objects, and invoking the Web Share API when supported.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-25",
      "title": "Notes: per-user multi-note CRUD with full-screen responsive UI",
      "synonyms": [
        "NotesFullScreenView",
        "create/update/delete notes",
        "swipe delete"
      ],
      "description": "Implements per-user notes (list/detail/create/update/delete), responsive mobile/desktop split-view editing, delete confirmation, touch swipe actions on coarse pointers, and actor-readiness gating.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-26",
      "title": "Missions: per-user missions with tasks, progress, and full-screen detail editor",
      "synonyms": [
        "MissionsFullScreenView",
        "MissionDetailFullScreenView",
        "task checklist"
      ],
      "description": "Implements missions with task checklists and progress display, including mission list view, create dialog, mission detail editor with explicit title edit mode, update/save, and delete confirmation flows.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-27",
      "title": "Optimistic deletion and React Query cache diagnostics for Notes and Missions",
      "synonyms": [
        "reactQueryDiagnostics",
        "logDeleteMutationLifecycle",
        "optimistic delete rollback"
      ],
      "description": "Delete mutations for notes and missions apply optimistic list removal, remove detail caches, invalidate/refetch on settle, and log cache diagnostics across the mutation lifecycle.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-28",
      "title": "Backend role-based access control with admin bootstrap and role assignment APIs",
      "synonyms": [
        "AccessControl",
        "MixinAuthorization",
        "CAFFEINE_ADMIN_TOKEN"
      ],
      "description": "Implements user roles (admin/user/guest) with bootstrap initialization using an environment admin token and provides endpoints to query role/admin status and assign roles (admin-only).",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-29",
      "title": "Backend file storage with ownership enforcement, pagination, and folder assignment",
      "synonyms": [
        "uploadFile",
        "getPaginatedFiles",
        "getFilesInFolder",
        "moveFilesToFolder"
      ],
      "description": "Stores file blobs + metadata, supports upload, single/bulk delete, listing (collection and folder-scoped with pagination), and folder assignment/removal, enforcing ownership with admin override.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-30",
      "title": "Backend folder storage with ownership enforcement and caller-scoped listing",
      "synonyms": [
        "createFolder",
        "renameFolder",
        "deleteFolder",
        "getAllFolders"
      ],
      "description": "Creates/renames/deletes folders per owner, lists folders owned by the caller, and on folder deletion removes files in that folder owned by the caller.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-31",
      "title": "Backend per-user notes and missions persistence",
      "synonyms": [
        "createNote",
        "listNotes",
        "createMission",
        "listMissions"
      ],
      "description": "Stores notes and missions keyed by caller principal with CRUD endpoints and permission checks requiring user role.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-32",
      "title": "Backend health/diagnostics endpoints with cycles balance",
      "synonyms": [
        "getHealth",
        "getDiagnostics"
      ],
      "description": "Exposes build/version string and cycles balance for operational monitoring.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-33",
      "title": "Backend blob-storage maintenance and cycles refill endpoints",
      "synonyms": [
        "_caffeineStorageUpdateGatewayPrincipals",
        "_caffeineStorageBlobsToDelete",
        "cycles top-up"
      ],
      "description": "Includes blob-storage utilities for gateway authorization updates, dead blob listing/confirmation with GC trigger, blob liveness checks, and cashier-driven cycles top-ups.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-34",
      "title": "Baseline parity and change-control documentation (Live v114)",
      "synonyms": [
        "DRAFT_BASELINE_V114",
        "RESTORE_LIVE_V114_CHECKLIST",
        "PAUSE_AFTER_RESTORE"
      ],
      "description": "Includes checklists and canonical file lists documenting and enforcing 1:1 parity with Live version 114 and a post-restore freeze policy.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "feature-update-the-shared-swipe-actions-row-ui-so-the-edit-rename-and-delete-buttons-are-not-visible-by-default-and-only-become-visible-after-the-user-swipes-left-far-enough-to-reveal-them-when-the-row-is-closed-no-swipe-the-action-buttons-must-be-fully-hidden-behind-the-row-content-and-must-not-overlay-it",
      "title": "Update the shared swipe-actions row UI so the Edit/Rename and Delete buttons are not visible by default and only become visible after the user swipes left far enough to reveal them; when the row is closed (no swipe), the action buttons must be fully hidden behind the row content and must not overlay it.",
      "reqIds": [
        "REQ-7"
      ],
      "version": 1
    }
  ],
  "new_feature_requests": [
    {
      "id": "AR-1",
      "summary": "iOS-style swipe-left actions for Folders/Notes/Missions lists on mobile only; Edit/Rename and Delete buttons should appear only after swipe (not visible by default).",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-3",
      "summary": "Ensure the updated swipe-to-reveal behavior is consistently applied anywhere the shared SwipeActionsRow component is used (Folders list, Notes list on coarse pointer devices, Missions list on coarse pointer devices), without changing any backend behavior.",
      "reqIds": [
        "REQ-8"
      ],
      "status": "pending"
    }
  ],
  "architectural_notes": [
    "Frontend is a React SPA using function components, TypeScript, Tailwind CSS (CSS variable tokens using OKLCH), and shadcn/ui component primitives.",
    "Authentication uses Internet Identity via @dfinity/auth-client; delegations are loaded from storage on mount and login requests long-lived (~30-day) delegations.",
    "Backend access is via a generated canister actor created with the authenticated identity; ActorContext owns actor lifecycle state (idle/initializing/ready/unavailable/error) and sign-out behavior.",
    "Actor initialization errors are centrally classified/mapped (stopped canister, invalid admin token, not-ready, init failure) to drive UI and provide technical diagnostics.",
    "TanStack React Query is the server-state layer; queries and mutations are gated on (identity present && actor status === ready) with cache invalidation and targeted optimistic updates/rollbacks.",
    "Uploads use ExternalBlob progress callbacks; an UploadContext aggregates per-file progress into a unified progress bar rendered under the header.",
    "Mobile-first UX patterns include swipe-to-reveal action rows (edit/delete) for lists and long-press to enter multi-select mode for bulk file actions.",
    "File opening behavior is MIME-aware: in-app viewer for images/videos/PDFs and Office preview via Office Online iframe with optional new-tab open and popup-blocker fallback.",
    "Backend is a Motoko actor composed with mixins (authorization/access-control and blob-storage maintenance); most operations enforce per-owner permissions with optional admin override.",
    "PWA support includes a manifest + comprehensive icons and a minimal service worker with network-first runtime caching."
  ],
  "known_issues": [
    "Access-control registration risk: ActorContext only calls _initializeAccessControlWithSecret when a non-empty admin token is present; first-time users without a token may remain unregistered and hit backend traps (\"User is not registered\") during permission checks.",
    "Notes sorting uses Number(b.updatedAt - a.updatedAt) on bigint-like timestamps in useListNotes; Number conversion can overflow/lose precision and cause incorrect ordering for large values.",
    "File/folder queries use fixed pagination windows (offset 0, limit 1000) and staleTime=0; this will not scale well for large libraries and may refetch frequently.",
    "Uploads read entire files into memory via File.arrayBuffer(); large files may cause memory pressure (no streaming upload).",
    "Backend findFileByTextId performs a linear scan across the files map to map string IDs to numeric keys; performance degrades as file counts grow.",
    "Folder deletion only deletes files in that folder owned by the caller; if an admin deletes another user's folder, other owners’ files may retain an orphaned folderId.",
    "Office previews rely on https://view.officeapps.live.com embedding a publicly accessible URL; preview may fail if the direct blob URL is not reachable by Microsoft’s service.",
    "Service worker precaches only /manifest.json and uses caches.match('/index.html') as a navigation fallback; first-time offline navigation may fail until index.html is cached at runtime.",
    "App can show prolonged \"Initializing\" / \"Service Unavailable\" on cold start (Draft and Live), often tied to canister stopped/unavailable (IC0508), causing login/actor init to fail intermittently.",
    "IC0508 stopped-canister errors (reject_code 5) may surface to users during _initializeAccessControlWithSecret calls, resulting in \"Connection Failed\" / \"backend temporarily unavailable\" despite valid Internet Identity sessions."
  ],
  "isFixRequest": true,
  "gameProjectType": "none",
  "projectName": "MyGallery",
  "clarification_mode": "instant",
  "clarification_rounds": 0
}